{
    "task": "Not receiving notifications when phone is locked and connected through WIFI",
    "description": "<!-- This is a bug report template. By following the instructions below and filling out the sections with your information, you will help the developers get all the necessary data to fix your issue.\r\nYou can also preview your report before submitting it. You may remove sections that aren't relevant to your particular case.\r\n\r\nBefore we begin, please note that this tracker is only for issues. It is not for questions, comments, or feature requests.\r\n\r\nIf you would like to discuss a new feature or submit suggestions, please visit the community forum:\r\nhttps://community.signalusers.org\r\n\r\nIf you are looking for support, please visit our support center:\r\nhttps://support.signal.org/\r\nor email support@signal.org\r\n\r\nLet's begin with a checklist: Replace the empty checkboxes [ ] below with checked ones [x] accordingly. -->\r\n\r\n- [x] I have searched open and closed issues for duplicates\r\n- [x] I am submitting a bug report for existing functionality that does not work as intended\r\n- [x] I have read https://github.com/signalapp/Signal-Android/wiki/Submitting-useful-bug-reports\r\n- [x] This isn't a feature request or a discussion topic\r\n\r\n----------------------------------------\r\n\r\n### Bug description\r\nWhenever I lock/sleep my phone (screen goes black) and when I am on wifi I do not get any messages from Signal. Only when I open my phone (I do not have to unlock it, just turn on the screen) I get a \"retrieving message\" pop up on the screen and after that the signal messages comes in. \r\n\r\nWhenever I am on data (4g) messages come through regardless of whether i have my phone locked or not. On Data it works fine.\r\n\r\n\r\nIN the WIFI settings i have it set on keep wifi on during sleep. \r\nSignal is not being optimized for battery savings.\r\n\r\nWhatsapp for example works fine on both wifi and data (messages give push notification when phone sleeps)\r\n\r\nI followed this https://support.signal.org/hc/en-us/articles/360007318711-Troubleshooting-Notifications\r\n\r\nAnd nothing seems to work.\r\n\r\n\r\n### Steps to reproduce\r\n- Turn on wifi\r\n- Lock phone turn off screen\r\n- make friend sent message\r\n- Wait. \r\n\r\n\r\n**Actual result:** Not receiving the message, only when i turn on screen I get \"retrieving message\" and after that the message comes in.\r\n**Expected result:** I should get a push notification of signal, even when my phone sleeps and its screen is turned off. Whatsapp ie works fine. \r\nI do get this notification on Data but not on Wifi. \r\n\r\n\r\n\r\n### Device info\r\n<!-- replace the examples with your info -->\r\n**Device:** samsung j3 2016\r\n**Android version:** 5.1.1\r\n**Signal version:** 4.32.8\r\n\r\n### Link to debug log\r\nhttps://debuglogs.org/1399dff44e93155a45be8004c2daefbf42b066e492496f64ebd6b1d7b650b810\r\n\r\n",
    "type": "GIT",
    "link": "https://github.com/signalapp/Signal-Android/issues/8579",
    "question_id": "8579",
    "resources": {
        "api": [           
            {
                "link": "https://developer.android.com/guide/topics/ui/notifiers/notifications",
                "type": "android",
                "content": [
                    "A notification is a message that Android displays outside your app's UI to provide the user with reminders, communication from other people, or other timely information from your app.",
                    "Users can tap the notification to open your app or take an action directly from the notification.",
                    "This page provides an overview of where notifications appear and the available features.",
                    "If you want to start building your notifications, instead read Create a Notification.",
                    "For more information about the design and interaction patterns, see the Notifications design guide.",
                    "Additionally, see the Android Notifications Sample for a demonstration of best practices in using the Notification.Style API in both mobile and wearable apps.",
                    "Notifications appear to users in different locations and formats, such as an icon in the status bar, a more detailed entry in the notification drawer, as a badge on the app's icon, and on paired wearables automatically.",
                    "When you issue a notification, it first appears as an icon in the status bar.",
                    "Notification icons appear on the left side of the status bar",
                    "Users can swipe down on the status bar to open the notification drawer, where they can view more details and take actions with the notification.",
                    "Notifications in the notification drawer",
                    "Users can drag down on a notification in the drawer to reveal the expanded view, which shows additional content and action buttons, if provided.",
                    "A notification remains visible in the notification drawer until dismissed by the app or the user.",
                    "Beginning with Android 5.0, notifications can briefly appear in a floating window called a heads-up notification.",
                    "This behavior is normally for important notifications that the user should know about immediately, and it appears only if the device is unlocked.",
                    "A heads-up notification appears in front of the foreground app",
                    "The heads-up notification appears the moment your app issues the notification and it disappears after a moment, but remains visible in the notification drawer as usual.",
                    "Example conditions that might trigger heads-up notifications include the following:",
                    "Beginning with Android 5.0, notifications can appear on the lock screen.",
                    "You can programmatically set the level of detail visible in notifications posted by your app on a secure lock screen, or even whether the notification will show on the lock screen at all.",
                    "Users can use the system settings to choose the level of detail visible in lock screen notifications, including the option to disable all lock screen notifications.",
                    "Starting with Android 8.0, users can choose to disable or enable lock screen notifications for each notification channel.",
                    "Notifications on the lock screen with sensitive content hidden",
                    "To learn more, see how to Set lock screen visibility.",
                    "In supported launchers on devices running Android 8.0 ( API level 26 ) and higher, app icons indicate new notifications with a colored `` badge'' ( also known as a `` notification dot'' ) on the corresponding app launcher icon.",
                    "Users can long-press on an app icon to see the notifications for that app.",
                    "Users can then dismiss or act on notifications from that menu, similar to the notification drawer.",
                    "Notification badges and the long-press menu",
                    "To learn more about how badges work, read Notification badges.",
                    "If the user has a paired Wear OS device, all your notifications appear there automatically, including expandable detail and action buttons.",
                    "You can also enhance the experience by customizing some appearances for the notification on wearables and provide different actions, including suggested replies and voice input replies.",
                    "For more information, see how to add wearable-specific features to your notification.",
                    "Notifications automatically appear on a paired Wear OS device",
                    "The design of a notification is determined by system templates -- your app simply defines the contents for each portion of the template.",
                    "Some details of the notification appear only in the expanded view.",
                    "A notification with basic details",
                    "The most common parts of a notification are indicated in figure 7 as follows:",
                    "For more information about how to create a notification with these features and more, read Create a Notification.",
                    "Although it's not required, every notification should open an appropriate app activity when tapped.",
                    "In addition to this default notification action, you can add action buttons that complete an app-related task from the notification ( often without opening an activity ), as shown in figure 9.",
                    "A notification with action buttons",
                    "Starting in Android 7.0 ( API level 24 ), you can also add an action to reply to messages or enter other text directly from the notification.",
                    "Starting in Android 10 ( API level 29 ), the platform can automatically generate action buttons with suggested intent-based actions.",
                    "Adding action buttons is explained further in Create a Notification.",
                    "By default, the notification's text content is truncated to fit on one line.",
                    "If you want your notification to be longer, you can enable a larger text area that's expandable by applying an additional template, as shown in figure 8.",
                    "An expandable notification for large text",
                    "You can also create an expandable notification with an image, in inbox style, a chat conversation, or media playback controls.",
                    "For more information, read Create an Expandable Notification.",
                    "And although we recommend you always use these templates to ensure proper design compatibility on all devices, if necessary, you can also create a custom notification layout.",
                    "To avoid bombarding your users with multiple or redundant notifications when you have additional updates, you should consider updating an existing notification rather than issuing a new one, or consider using the inbox-style notification to show conversation updates.",
                    "However, if it's necessary to deliver multiple notifications, you should consider grouping those separate notifications into a group ( available on Android 7.0 and higher ).",
                    "A notification group allows you to collapse multiple notifications into just one post in the notification drawer, with a summary.",
                    "The user can then expand the notification to reveal the details for each individual notification.",
                    "The user can progressively expand the notification group and each notification within it for more details.",
                    "A collapsed and expanded notification group",
                    "To learn how to add notifications to a group, see Create a Group of Notifications.",
                    "Starting in Android 8.0 ( API level 26 ), all notifications must be assigned to a channel or it will not appear.",
                    "By categorizing notifications into channels, users can disable specific notification channels for your app ( instead of disabling all your notifications ), and users can control the visual and auditory options for each channel -- all from the Android system settings ( figure 11 ).",
                    "Users can also long-press a notification to change behaviors for the associated channel.",
                    "On devices running Android 7.1 ( API level 25 ) and lower, users can manage notifications on a per-app basis only ( effectively each app only has one channel on Android 7.1 and lower ).",
                    "Notification settings for Clock app and one of its channels",
                    "One app can have multiple notification channels -- a separate channel for each type of notification the app issues.",
                    "An app can also create notification channels in response to choices made by users of your app.",
                    "For example, you may set up separate notification channels for each conversation group created by a user in a messaging app.",
                    "The channel is also where you specify the importance level for your notifications on Android 8.0 and higher.",
                    "So all notifications posted to the same notification channel have the same behavior.",
                    "For more information, see Create and Manage Notification Channels.",
                    "Android uses the importance of a notification to determine how much the notification should interrupt the user ( visually and audibly ).",
                    "The higher the importance of a notification, the more interruptive the notification will be.",
                    "On Android 8.0 ( API level 26 ) and above, importance of a notification is determined by the importance of the channel the notification was posted to.",
                    "Users can change the importance of a notification channel in the system settings ( figure 12 ).",
                    "On Android 7.1 ( API level 25 ) and below, importance of each notification is determined by the notification's priority.",
                    "Users can change the importance of each channel on Android 8.0 and higher",
                    "The possible importance levels are the following:",
                    "All notifications, regardless of importance, appear in non-interruptive system UI locations, such as in the notification drawer and as a badge on the launcher icon ( though you can modify the appearance of the notification badge ).",
                    "For more information, see how to set the importance.",
                    "Starting in Android 5.0 ( API level 21 ), users can enable Do Not Disturb mode, which silences sounds and vibration for all notifications.",
                    "Notifications still appear in the system UI as normal, unless the user specifies otherwise.",
                    "There are three different levels available in Do Not Disturb mode:",
                    "Users can can allow notifications through based on system-wide categories ( left ) and based on who sent a message or who is calling ( right ).",
                    "On Android 8.0 ( API level 26 ) and above, users can additionally allow notifications through for app-specific categories ( also known as channels ) by overriding Do Not Disturb on a channel-by-channel basis.",
                    "For example, a payment app might have channels for notifications related to withdrawals and deposits.",
                    "The user can then choose to allow either withdrawal notifications, deposit notifications, or both when in priority mode.",
                    "On devices running Android 7.1 ( API level 25 ) and below, users can allow notifications through on an app by app basis, rather than on a channel by channel basis.",
                    "To properly configure your notifications for these user settings, you must set a system-wide category and channel.",
                    "A notification is required when your app is running a `` foreground service'' -- a Service running in the background that's long living and noticeable to the user, such as a media player.",
                    "This notification can not be dismissed like other notifications.",
                    "To remove the notification, the service must be either stopped or removed from the `` foreground'' state.",
                    "For more information read Running a service in the foreground.",
                    "And if you are building a media player, also read Using MediaStyle notifications with a foreground service.",
                    "Beginning with Android 8.1 ( API level 27 ), apps can not make a notification sound more than once per second.",
                    "If your app posts multiple notifications in one second, they all appear as expected, but only the first notification per second makes a sound.",
                    "However, Android also applies a rate limit when updating a notification.",
                    "If you post updates to a single notification too frequently ( many in less than one second ), the system might drop some updates.",
                    "Since Android 1.0, the notification system UI and the notification-related APIs have continually evolved.",
                    "To use the latest notification API features while still supporting older devices, use the support library notification API: NotificationCompat and its subclasses, as well as NotificationManagerCompat.",
                    "This will allow you to avoid writing conditional code to check API levels because these APIs handle that for you.",
                    "NotificationCompat is updated as the platform evolves to include the latest methods.",
                    "It is important to note that the availability of a method in NotificationCompat does not guarantee that the corresponding feature will be provided on older devices.",
                    "In some cases calling a newly-introduced API results in a no-op on older devices.",
                    "For example, NotificationCompat.addAction ( ) displays the action button on a device running Android 4.1 ( API level 16 ) and higher only.",
                    "The following is a summary of the most notable behavior changes for Android notifications.",
                    "The user's activity is in fullscreen mode ( the app uses fullScreenIntent ).",
                    "The notification has high priority and uses ringtones or vibrations on devices running Android 7.1 ( API level 25 ) and lower.",
                    "The notification channel has high importance on devices running Android 8.0 ( API level 26 ) and higher.",
                    "Small icon: This is required and set with setSmallIcon ( ).",
                    "App name: This is provided by the system.",
                    "Time stamp: This is provided by the system but you can override with setWhen ( ) or hide it with setShowWhen ( false ).",
                    "Large icon: This is optional ( usually used only for contact photos ; do not use it for your app icon ) and set with setLargeIcon ( ).",
                    "Title: This is optional and set with setContentTitle ( ).",
                    "Text: This is optional and set with setContentText ( ).",
                    "Urgent: Makes a sound and appears as a heads-up notification.",
                    "Low: No sound and does not appear in the status bar.",
                    "Total silence: blocks all sounds and vibrations, including from alarms, music, videos, and games.",
                    "Alarms only: blocks all sounds and vibrations, except from alarms.",
                    "Priority only: users can configure which system-wide categories can interrupt them ( such as only alarms, reminders, events, calls, or messages ).",
                    "For messages and calls, users can also choose to filter based on who the sender or caller is ( figure 13 ).",
                    "Introduced expandable notification templates ( called notification styles ), allowing for larger notification content area to display information.",
                    "Users can use a one finger swipe up/down gesture to expand a notification.",
                    "Also introduced the ability to add additional actions, in the form of buttons, to a notification.",
                    "Added ability for users to turn notifications off on a per-app basis in settings.",
                    "Notification listener services were added to the API.",
                    "Android Wear ( now called Wear OS ) support was added in API level 20.",
                    "Introduced lock screen and heads-up notifications.",
                    "The user can now put the phone into Do Not Disturb mode and configure which notifications are allowed to interrupt them when the device is in priority only mode.",
                    "Methods added to API set whether or not a notification is displayed on the lock screen ( setVisibility ( ) ) and for specifying `` public'' version of the notification text.",
                    "setPriority ( ) method added which tells the system how `` interruptive'' this notification should be ( e.g. setting it to high makes the notification appear as a heads-up notification ).",
                    "Notification stacks support added to Android Wear ( now called Wear OS ) devices.",
                    "Put notifications into a stack using setGroup ( ).",
                    "Note that notification stacks were not supported on tablets nor phones yet.",
                    "Notification stacks would later become known as a group or bundle.",
                    "Notification templates were restyled to put emphasis on the hero image and avatar.",
                    "Three notification templates were added: one for messaging apps and the other two for decorating custom content views with the expandable affordance and other system decorations.",
                    "Support added to handheld devices ( phones and tablets ) for notification groups.",
                    "Uses the same API as Android Wear ( now called Wear OS ) notification stacks introduced in Android 5.0 ( API level 21 ).",
                    "Users can reply directly inside of a notification ( they can enter text which will then be routed to the notification's parent app ) using inline reply.",
                    "Individual notifications must now be put in a specific channel.",
                    "Users can now turn off notifications per channel, instead of turning off all notifications from an app.",
                    "Apps with active notifications display a notification `` badge'' on top of their app icon on the home/launcher screen.",
                    "Users can now snooze a notification from the drawer.",
                    "You can set an automatic timeout for a notification.",
                    "You can also set the notification's background color.",
                    "Some APIs regarding notification behaviors were moved from Notification to NotificationChannel.",
                    "For example, use NotificationChannel.setImportance ( ) instead of NotificationCompat.Builder.setPriority ( ) for Android 8.0 and higher.",
                    ""
                ],
                "title": "Notifications Overview  |  Android Developers"
            }
        ],
        "git": [
            {
                "link": "https://github.com/wireapp/wire-android/issues/254",
                "content": [
                    "Not always receiving message notifications when phone is idle - perhaps Doze related ?",
                    "· Issue # 254 · wireapp/wire-android · GitHub",
                    "Unfortunately, I'm experiencing an issue with Wire on Android 7 ( Nexus 6P ) in which I do not always receive message notifications.",
                    "However, the messages are present and marked as unread when I open the Wire app.",
                    "I have noticed this usually occur when I have not used my phone in a short while.",
                    "I'm wondering if this has anything to do with the Doze feature present in newer versions of Android ?",
                    "In most cases, when an app has been ` dozed' I seem to get the notification after a delay or near immediately if I resume using my phone.",
                    "I certainly don't mind having delayed notifications, but not receiving the notifications at all when my phone has been idle affects usability quite severly.",
                    "I'm happy to provide any further information if it would be useful.",
                    "Due to the requirement to leave the device idle, this is a pretty difficulty issue to reliable replicate in a typical environment.",
                    "The text was updated successfully, but these errors were encountered:",
                    "Huawei p8 not receiving notifications",
                    "I don't have this problem on my Nexus 5X with Android 7",
                    "I also have problem with notifications.",
                    "I think the developers may use a debug log captured right after opening the app -- if there are any delayed messages when you open it.",
                    "Next time you experience this issue when you open Wire, go to settings > advanced and capture a debug log.",
                    "Hopefully the developers will find it useful: )",
                    "Actually I have these problems from time to time with mit Nexus 5X on Android 7 too.",
                    "I have also tried to turn the battery optimization off for wire.",
                    "Maybe adding an option in settings to have a permanent notification in the tray like many other apps do would provide more reliable notifications.",
                    "I know that both Conversations as well as Riot provide this option.",
                    "Not always receiving message notifications when phone is ideal - perhaps Doze related ?",
                    "I have the same issue here.",
                    "I will put Wire app on Doze whitelist ( so, this app won't be `` Dozed'' anyway ) and see if it works better with that.",
                    "I think the last update ( which came out a couple of days ago ) should have fixed this.",
                    "Are you still experiencing it ?",
                    "No, it is much better for a couple of days !",
                    "I do not know if it is the update or the undoze of the app, though.",
                    "I think that in your specific situation, undozing the phone was necessary.",
                    "However, the latest update did fix bugs where you would not receive notifications, so I think this issue has been resolved.",
                    "Let's hear what the owner of the issue has to say !",
                    "This issue has not been resolved yet.",
                    "I have sent a email with video example.",
                    "This issue appears more than once in my android phone.",
                    "My device: Innos D6000 ( Android 5.1 ), LG G3 ( Android 4.4 )",
                    "Hi guys, just to keep you all updated, we've been experiencing some issues with ( very particular ) users not receiving GCM notifications.",
                    "We would try to detect these failures and fall back to a constant WebSocket connection.",
                    "Problem is that the fallback mechanism had some issues and was a little bit aggressive in detecting if GCM had failed, so that affected many more people than necessary.",
                    "The latest release tried to make this fallback a bit less aggressive, in the hope that would be enough.",
                    "There will be a second round of fixes coming very soon, and if the WebSocket fallback proves to be stable and doesn't drain the device's battery in our internal testing, then perhaps we'll use it permanently ( those who don't have google play services on their devices, for example, have to rely on this connection anyway ).",
                    "After i opened WIRE to see if someone wrote me, i saw a message delivered 6 hrs before the startup of WIRE.",
                    "I had no notification on my screen.",
                    "I've set notifications in system ( Android 6.0.1 ) for WIRE as prio mode.",
                    "I, well actually my family of 3 Nexus 6P's on Android 7.1.1 and latest Wire, have unreliable notifications similar to what is described here.",
                    "A persistent WebSocket connection worries me somewhat for battery drain and that Wire might end up with a huge background task running.",
                    "Hopefully this can be fixed.",
                    "Well, I have an Huawei Elite P8 with lollipop android, my problem is that I don't receive sounds or any notification while Wire is in inactive mode.",
                    "I wrote to Wire Support but they don't fix the issue.",
                    "@gusstav have you looked at # 253 ?",
                    "Messages delayed or not recieved when device is in Power Saving",
                    "So I'm going to give this a shot, and exempt Wire from Power Saving.",
                    "I'll see if I notice any improvements over the next several days:",
                    "I had the same issue with a Honor 5C Emui 4.1.",
                    "Seems like exempting Wire from Power Saving does the trick.",
                    "Many of my relatives don't receive notifications on different devices though.",
                    ".",
                    "I have turned off battery optimization for Wire on my device, and the messages usually get through.",
                    "However, a few of my contacts will often tell me that they never saw my messages.",
                    "In at least two cases, I have double-checked and their phones are using a version of Android that didn't include the `` battery optimization'' feature.",
                    "At least one contact has suggested ( God forbid ) that we switch to using Whatsapp.",
                    "which seems to imply that she gets Whatsapp message notifications no problem ( though I do not, probably because I allow Whatsapp to be `` battery optimized'' ).",
                    "@ConorIA What phones are your friends on ?",
                    "Might be that they have another setting in the Network/data section that prevents wire from sending data while in background.",
                    "@someoneEsle, one is a Blu Vivo XL.",
                    "The other is a Huawei `` something or other''.",
                    "I think both are on Android 6.0 by now.",
                    "A small update, a lot of my friends ( iPhone 5S, iPhone 6, Samsung G4, Nexus 5 ) still do not receive notifications for new messages and incoming audio/video calls.",
                    "Seems like the problem is still not solved ...",
                    "wire-android is very often not clearing notifications on the phone for messages I already read on desktop until I unlock the phone.",
                    "Most of the times I've Wire parallel running on Android device ( only to actually hear the notification ) and on Linux Desktop ( via app ) I then use for message exchange:",
                    "Telegram message notification 100 % reliable, Wire maybe around 50-70 %.",
                    "I made sure to close the window of Wire Linux Desktop app or at least don't have it activated.",
                    "Additional observation: At least sometimes the Android app only notifies of messages that arrived a while ago after I've sent back the first reply via the desktop app.",
                    "Tried to create a bug report on Android device, but got: `` Unable to open log device ` main'''",
                    "And another one: With the Wire Android app ( device on WiFi ) being the only app logged into the account ( i.e. desktop app was shut down ) the notifications ( and messages, see below ) didn't come through.",
                    "Only when I opened Wire hours later ( after I saw new messages on the restarted desktop app ) the Wire Android app actually downloaded the messages.",
                    "I could observe them showing up one by one.",
                    "On the Android device Wire has all the permissions including `` Wake up'', has been excluded from any power saving app, specifically Greenify.",
                    "And, sometimes notifications/messages coming through without problem, even with the phone haven't been touched for a while.",
                    "As mentioned before, on the same device Telegram runs without any issue.",
                    "Not sure what you need from my end to troubleshoot this.",
                    "I'll add a ` me too', across multiple devices.",
                    "Tested with Axon 7, Honor 8, and Le Pro 3.",
                    "This is easily the most frustrating bug as it really makes the app unreliable/unusable unless you just open the app every few minutes.",
                    "I do not believe it to be power setting related - every other messenger I've used notifies fine.",
                    "Wire on Android fails to receive notifications",
                    "This has happened occasionally for me and a friend of mine as well.",
                    "Same hère, with messages or calls.",
                    "I too am getting this behaviour with friends and workmates.",
                    "Seems to work great on my devices though.",
                    "Do the devs need anything from us with this issue ?",
                    "As I concur with @axaxs -- easily the best messaging app, if it actually 100 % worked.",
                    "Any testing we can do to help the issue with notifications not being received on some Android devices ?",
                    "I have the same situation:",
                    "Galaxy S7, LineageOS, MicroG - everything OK",
                    "Galaxy S4 mini, LineageOS, MicroG - many notifications are simply missed !",
                    "However, as in MicroG you can see when the last message was received, the S4mini definitely receives the messages.",
                    "Only Wire does not notice it ?!",
                    "Still having issues with notifications not being shown.",
                    "I can see a notification count on the wire app but not shown on the main Andriod screen.",
                    "Would you like some logs or screenshots showing this ?",
                    "Hi everyone, please have a look at this: # 1087 :) Stay tuned !",
                    "Messages, or notifications, greatly delayed",
                    "I had the same problem as OP mentioned.",
                    "I'm currently on a LG G3 + Lineageos 14.1 + microG, where microG is disabled and Wire has to use websockets.",
                    "I'm only using Wifi no mobile data.",
                    "The problem was again, that after about 1 min idleness the phone doesn't receive any messages and notifications.",
                    "I realizied that the problem doesn't seem to be Wire related anymore, because when I touch the phone again I see that it instantly tries to re-establish the wifi connection.",
                    "Though, it should have never lost the wifi connection, because I set the android wifi settings to `` keep wifi activated on standby - always'' ( or the like ).",
                    "I googled around and found issues with this Android Wifi setting.",
                    "It does not work as expected for many users.",
                    "They all have set it to `` keep wifi activated on standby - always'' but it's not active during standby.",
                    "Some guy found a solution that worked for me.",
                    "The error is obviously that android is not applying the wifi setting.",
                    "So what you have to do is set the setting from `` always'' to `` never'' and apply it by leaving the menu.",
                    "then get back and change the setting back to `` always'' and leave the menu again.",
                    "that way android seems to finally apply the wifi setting and the phone keeps the wifi connection while standby is on.",
                    "Wire couldn't get messages because android didn't apply the settings correctly.",
                    "no wifi in standby meant no messages for wire while idle.",
                    "so to sum it up again:",
                    "if you want a working Wire with websockets you have to do:",
                    "change the wifi settings `` keep wifi connection while standby''",
                    "apply `` never'' leave the menues ( important ! )",
                    "apply `` always'' leave the menu again.",
                    "it is also important to disable battery savings for the Wire app, otherwise the app gets in a sleep state shortly after standby and messages won't be received either.",
                    "There is an option under Battery/Akku almost hidden, where you can set apps to be `` not optimized'' for battery savings - wire needs to be `` not optimized'' to work.",
                    "This might lead to a battery drain issue ( see # 853 ) because wire seems to be really bad optimized for some devices/OS if it uses websockets.",
                    "However, there is no other way to make it work",
                    "in case it was missed, there's a checklist to go through if you notifications are still acting up: https://support.wire.com/hc/en-us/articles/203624294-What-can-I-do-if-I-m-not-getting-any-notifications-on-Android -",
                    "there are a lot of duplicated issues covering this same problem ( or a very similar one ), let's unify all conversations and keep it going here: # 777.",
                    "Closing this one and continuing there.",
                    ""
                ],
                "title": "Not always receiving message notifications when phone is idle - perhaps Doze related ?"
            }
        ],
        "qa": [
            {
                "uid": "24313539",
                "link": "https://stackoverflow.com/questions/24313539",
                "title": "Push Notifications when app is closed",
                "answers": [
                    {
                        "uid": 24313726,
                        "score": 2,
                        "text": [
                            "I just finished a GCM app.",
                            "It still works well if you close the app.",
                            "The thing is you should have already opened the app for once.",
                            "create two class to achieve this goal: GcmBroadcastReceiver and GcnIntentService.",
                            "Find more information LINK",
                            "Here is the trick",
                            "the class being extended is WakeFulBroadcastReceiver.",
                            "There is a WAKE_LOCK permission in your Manifest.xml.",
                            "This allows using PowerManager WakeLocks to keep processor from sleeping or screen from dimming.",
                            "However, if you extend BroadcastReceiver, it will not work after the app is closed."
                        ]
                    },
                    {
                        "uid": 24313773,
                        "score": 6,
                        "text": [
                            "It will not work on killing the app from task manager, but work if you just slide it away from recent.",
                            "I tried doing on whatsapp by killing it and ask someone to send a msg to me, and I haven't got any notification.",
                            "Then I started the app, and I got notification."
                        ]
                    },
                    {
                        "uid": 24314088,
                        "score": 22,
                        "text": [
                            "Yes, it is possible ` to receive notifications from google cloud message when the application is fully closed'.",
                            "Infact, A broadcast receiver is the mechanism GCM uses to deliver messages.",
                            "You need to have implement a LINK and declare it in the AndroidManifest.xml.",
                            "Please refer to the following code snippet.",
                            "AndroidManifest.xml",
                            "Java code",
                            "When GCM delivers a message to your device, BroadcastReceiver will receive the message and call the onReceive -LRB- -RRB- function, wherein you may start a service to actually perform the intended task for you.",
                            "The above Code example uses a specialized BroadcastReceiver called WakefulBroadcastReceiver, which makes sure that the device doesn't go to sleep, while the service is doing its work.",
                            "Refer to the Official Android Page for the same: LINK"
                        ]
                    },
                    {
                        "uid": 24325023,
                        "score": 0,
                        "text": [
                            "I've been trying another phone and the second worked perfectly, even when the phone was off.",
                            "The first had a room that did not allow to be notified when the app was closed ... Thanks to all"
                        ]
                    },
                    {
                        "uid": 24340912,
                        "score": 18,
                        "text": [
                            "When the app is closed forcelly by the user: notifications don't arrive",
                            "It's a feature of the Android platform.",
                            "Force stopping an application by the user puts the application in a stopped state and none of its code is run, including any broadcast receivers declared in manifest.",
                            "Only when the user explicitly launches the app it is put in a state where the receivers get fired.",
                            "For further reading: LINK"
                        ]
                    },
                    {
                        "uid": 44392003,
                        "score": 9,
                        "text": [
                            "After some testing I did on this issue, I found out that it behaves differently on how the app is closed.",
                            "If you close the app while the cable is connected to the device, it then blocks every notification when the app is closed.",
                            "However, if you take the cable off the device and close the app, when you send the notification, everything works again, as it should !",
                            "In case you get a `` Waiting for the Debugger'' popup message, just restart the device and then send a test notification !"
                        ]
                    },
                    {
                        "uid": 48929424,
                        "score": 7,
                        "text": [
                            "Firebase API has two types of messages, they call them:",
                            "find more information from LINK",
                            "IMPORTANT: You can't send data payload messages from Firebase Console, Console only delivers notification message.",
                            "So I have mentioned how to send push notification using postman please follow below steps for that.",
                            "You must send push messages with data payload because of data payload - Doesn't matter whether your application is in the foreground or background or killed, these messages will always be delivered to onMessageReceived -LRB- -RRB- method.",
                            "In Android 8.0 Oreo if the application is closed, then notification is not received It is because of DOZE mode and battery optimization, you just have to turn off battery optimization for all apps or particular app.",
                            "Turn off battery optimization for your app by below step:",
                            "Settings >> Battery >> battery Optimization >> find your app >> select >> if optimized click on don't optimize >> try pushing notification",
                            "Send push notification using postman",
                            "Step 1: LINK",
                            "Step 2: Set this two into Header",
                            "Authorization: key = AIzaSyBuRl1Ikz3VXFvU7xW9mmg51lJ3uDSH",
                            "Content-Type: application/json",
                            "Step 3: Send this json",
                            "Hope this helps.",
                            ".",
                            "Enjoy :-RRB-: -RRB-"
                        ]
                    },
                    {
                        "uid": 48956700,
                        "score": 0,
                        "text": [
                            "I was having the same issue on Oneplus phone.",
                            "As mentioned by many people above, the issue was forceful app termination.",
                            "In my case, it was done due to `` Recent App management'' setting as shown below.",
                            "Once I changed it to `` Normal clear'' setting everything started working fine.",
                            "LINK"
                        ]
                    }
                ],
                "tags": [
                    "android",
                    "notifications",
                    "push"
                ]
            }
        ],
        "other": [
            {
                "link": "https://www.hongkiat.com/blog/solve-android-delayed-notifications",
                "type": "misc",
                "content": [
                    "Please enable JavaScript in your browser to enjoy a better experience.",
                    "How to Fix Android Delayed Notifications By Karrar Haider in Mobile.",
                    "Recently, notifications on my Android phone were being delayed by up to 15 minutes, and sometimes didn't even reach me until I open the app.",
                    "It was quite frustrating and I missed many urgent messages.",
                    "However, it turns out it was mostly a fault on my end.",
                    "As I was trying to optimize my phone for better performance, I made some mistakes in the process.",
                    "If you are also facing a laggy Android phone causing delayed notifications, then there are a bunch of reasons why it may be happening.",
                    "In this post, I'll list all the solutions to delayed notifications on Android.",
                    "Locked Out of Your Android Device ?",
                    "Here's What You Can Do",
                    "Getting locked out of your own Android phone can be really frustrating and quite embarrassing.",
                    "Maybe you have ... Read more",
                    "Stop using battery & phone optimizing apps Most phone and battery optimizing apps close all the background processes to free up RAM and put less load on the phone.",
                    "This may boost your phone speed, but it will lead to delayed or no notifications from your apps.",
                    "A lot of these background processes sync data and deliver notifications.",
                    "Once they are disabled, you would not be able to receive any updates from the installed apps unless you open them or they have a feature to automatically turn on.",
                    "Don't kill background processes yourself Following up to the above point, many users like to disable background processes from the Android settings to get a bit performance boost.",
                    "Don't do it, at least not for the apps from which you are expecting notifications, such as Facebook Messenger or WhatsApp.",
                    "You should also refrain from task-killing apps that promise to completely shut down the app when you close an app using them.",
                    "They also kill background processes while closing the app interface.",
                    "10 Apps to Enhance & Optimize Your Android Smartphone",
                    "Android, despite of all optimization efforts by Google, tends to slow down with usage over time.",
                    "The new ... Read more",
                    "Use Power Saver mode wisely If you have a phone running Android Lollipop or newer operating system, then you must know about the Power Saver mode that helps you get more juice out of the battery.",
                    "Usually, you are asked to turn on the battery saver mode when your battery goes below 15 %, which is great for keeping your phone alive when you need it.",
                    "However, Power Saver mode disables an important feature of the phone i.e. data syncing.",
                    "While Power Saver mode is enabled, no app will syncs data in the background to keep you updated so you will not receive any notifications either.",
                    "Don't keep Power Saver mode enabled all the time, and only enable it on low battery when you are sure you are not waiting for an important message.",
                    "Keep Wi-Fi enabled at all times In case you only receive notifications as soon as you unlock the screen, then there is a chance that your Wi-Fi gets disabled when your phone goes to sleep.",
                    "It's good for battery saving, but bad for data syncing.",
                    "Here's how to fix it:",
                    "Go to phone Settings and tap on Wi-Fi.",
                    "Now tap on the main menu at the top-right corner and select Advanced from it.",
                    "On the next page, ensure `` Keep Wi-Fi on during sleep'' option is set to Always.",
                    "This should keep Wi-Fi on when the screen goes black and show notifications in time.",
                    "Fixing delayed notifications for a particular app If the notifications are being delayed for a particular app and not all of the apps, then there are multiple ways to fix it.",
                    "First, make sure it is properly syncing data in the background over mobile data connection:",
                    "Go to phone Settings, tap on Data Usage.",
                    "Select the respective app, make sure `` Restrict app background data'' feature is turned off.",
                    "If that's not the problem, then you can also try deleting cache of the app.",
                    "Go to Apps from the phone Settings and open up the respective app.",
                    "Tap on `` Clear Cache'' button to flush the cache.",
                    "You can also tap on ` Clear data'' button to delete all the data of the app.",
                    "However, this will also delete all the app preferences and saved data unless it is backed up in the cloud.",
                    "Decrease Android Heartbeat Interval Almost all of the messaging apps in your phone use Google Cloud Messaging ( GCM ) service to send push notifications.",
                    "Your phone keeps a stable connection with this service to ensure you receive timely notifications.",
                    "For this purpose, your phone will send a network packet called a `` Heartbeat'' after every few minutes to ensure you are connected and able to receive notifications.",
                    "The packet interval is 15 minutes for Wi-Fi connection, and 28 minutes for mobile data connection.",
                    "Now there is a tiny problem, most routers and carriers disconnect from an inactive port after few minutes of inactivity, usually 5 minutes.",
                    "So if you will not receive a notification for 5 minutes, then your connection will be terminated.",
                    "And you will not receive any notifications until another packet ( heartbeat ) is sent and a connection is made.",
                    "To solve this problem, we simply need to speed up the frequency of the heartbeat packet.",
                    "And for this purpose, you can use the free app Push Notifications Fixer.",
                    "After installation, you will see two options, Mobile heartbeat interval, and Wi-Fi heartbeat interval.",
                    "Both of these options will be set to 5 minutes, which is perfect as most connections usually timeout after 5 minutes or more.",
                    "Tap on the Apply button to apply this heartbeat interval and you should start receiving notifications in time.",
                    "Increasing the heartbeat interval impacts your overall battery timing.",
                    "However, the impact is very minimum and I didn't see any noticeable difference in battery time after installing this app.",
                    "In case you want to switch back to default heartbeat interval, either uninstall the app or set the default interval right from the app.",
                    "How to Survive a Dying Battery on Android",
                    "Short battery life is one of the biggest downfalls of Android phones, and there are times when you ... Read more",
                    "Ending thoughts Push Notifications Fixer fixed my problem of delayed notifications.",
                    "And I guess I was a fool to use Power Saver feature all the time in hopes of getting more up time.",
                    "The above-mentioned solutions should be enough to solve your problem of delayed Android notifications.",
                    "Do share which of these methods worked for you.",
                    "5 Common Causes to Laggy Android Devices ( And How to Fix Them ) Hongkiat.com",
                    "How to Manage Your Android Smartphone From DesktopAgus",
                    "How to Sync Mail, Contacts & Calendars From Android to iOSAshutosh KS",
                    "10 Best Music Player Apps for AndroidRean",
                    "How to Know If Your Android Phone Is Victim of Malicious ActsKarrar Haider",
                    "10 Best Free Spy Apps for AndroidHongkiat Lim",
                    "Top 5 Android Emulators For Your DesktopAshutosh KS",
                    "10 Apps to Connect Computer to Android DevicesAshutosh KS",
                    "2021 Reproduction of materials found on this site, in any form, without explicit permission is prohibited.",
                    "Publishing policy & dash ; Privacy Policy",
                    "By Karrar Haider in Mobile.",
                    ""
                ],
                "title": "How to Fix Android Delayed Notifications - Hongkiat"
            }
        ]
    },
    "parsed": true
}