{
    "task": " height must be > 0",
    "description": "java.lang.IllegalArgumentException: height must be > 0\r\n- 3 non-project frames\r\n1\r\nat android.graphics.Bitmap.checkWidthHeight (Bitmap.java:393)\r\n2\r\nat android.graphics.Bitmap.createBitmap (Bitmap.java:696)\r\n3\r\nat android.graphics.Bitmap.createBitmap (Bitmap.java:665)\r\n4\r\nat com.edmodo.cropper.CropImageView.getCroppedImage (CropImageView.java:293)\r\n5\r\nat com.unsw.berrycount.activities.CameraActivity$1.onClick (CameraActivity.java:64)\r\n- 9 non-project frames\r\n6\r\nat android.view.View.performClick (View.java:5232)\r\n7\r\nat android.view.View$PerformClick.run (View.java:21258)\r\n8\r\nat android.os.Handler.handleCallback (Handler.java:739)\r\n9\r\nat android.os.Handler.dispatchMessage (Handler.java:95)\r\n10\r\nat android.os.Looper.loop (Looper.java:179)\r\n11\r\nat android.app.ActivityThread.main (ActivityThread.java:5650)\r\n12\r\nat java.lang.reflect.Method.invoke (Unknown source)\r\n13\r\nat com.android.internal.os.ZygoteInit$MethodAndArgsCaller.run (ZygoteInit.java:791)\r\n14\r\nat com.android.internal.os.ZygoteInit.main (ZygoteInit.java:681)",
    "type": "GIT",
    "link": "https://github.com/edmodo/cropper/issues/131",
    "question_id": "131",
    "resources": {
        "api": [
            {
                "link": "https://docs.oracle.com/javase/7/docs/api/java/awt/Rectangle.html",
                "type": "java",
                "content": [
                    "A Rectangle object's width and height are public fields.",
                    "The constructors that create a Rectangle, and the methods that can modify one, do not prevent setting a negative value for width or height.",
                    "A Rectangle whose width or height is exactly zero has location along those axes with zero dimension, but is otherwise considered empty.",
                    "The isEmpty ( ) method will return true for such a Rectangle.",
                    "Methods which test if an empty Rectangle contains or intersects a point or rectangle will always return false if either dimension is zero.",
                    "Methods which combine such a Rectangle with a point or rectangle will include the location of the Rectangle on that axis in the result as if the add ( Point ) method were being called.",
                    "A Rectangle whose width or height is negative has neither location nor dimension along those axes with negative dimensions.",
                    "Such a Rectangle is treated as non-existant along those axes.",
                    "Such a Rectangle is also empty with respect to containment calculations and methods which test if it contains or intersects a point or rectangle will always return false.",
                    "Methods which combine such a Rectangle with a point or rectangle will ignore the Rectangle entirely in generating the result.",
                    "If two Rectangle objects are combined and each has a negative dimension, the result will have at least one negative dimension.",
                    "Methods which affect only the location of a Rectangle will operate on its location regardless of whether or not it has a negative or zero dimension along either axis.",
                    "Note that a Rectangle constructed with the default no-argument constructor will have dimensions of 0x0 and therefore be empty.",
                    "That Rectangle will still have a location of ( 0,0 ) and will contribute that location to the union and add operations.",
                    "Code attempting to accumulate the bounds of a set of points should therefore initially construct the Rectangle with a specifically negative width and height or it should use the first point in the set to construct the Rectangle.",
                    "This class uses 32-bit integers to store its location and dimensions.",
                    "Frequently operations may produce a result that exceeds the range of a 32-bit integer.",
                    "The methods will calculate their results in a way that avoids any 32-bit overflow for intermediate results and then choose the best representation to store the final results back into the 32-bit fields which hold the location and dimensions.",
                    "The location of the result will be stored into the x and y fields by clipping the true result to the nearest 32-bit value.",
                    "The values stored into the width and height dimension fields will be chosen as the 32-bit values that encompass the largest part of the true result as possible.",
                    "Generally this means that the dimension will be clipped independently to the range of 32-bit integers except that if the location had to be moved to store it into its pair of 32-bit fields then the dimensions will be adjusted relative to the `` best representation'' of the location.",
                    "If the true result had a negative dimension and was therefore non-existant along one or both axes, the stored dimensions will be negative numbers in those axes.",
                    "If the true result had a location that could be represented within the range of 32-bit integers, but zero dimension along one or both axes, then the stored dimensions will be zero in those axes.",
                    "This method is included for completeness, to parallel the getBounds method of Component.",
                    "Note that the definition of insideness can lead to situations where points on the defining outline of the shape may not be considered contained in the returned bounds object, but only in cases where those points are also not considered contained in the original shape.",
                    "If a point is inside the shape according to the contains ( point ) method, then it must be inside the returned Rectangle2D bounds object according to the contains ( point ) method of the bounds.",
                    "shape.contains ( p ) requires bounds.contains ( p )",
                    "If a point is not inside the shape, then it might still be contained in the bounds object:",
                    "bounds.contains ( p ) does not imply shape.contains ( p )",
                    "This method is included for completeness, to parallel the setBounds method of Component.",
                    "This method is included for completeness, to parallel the getLocation method of Component.",
                    "This method is included for completeness, to parallel the setLocation method of Component.",
                    "This method is included for completeness, to parallel the getSize method of Component.",
                    "This method is included for completeness, to parallel the setSize method of Component.",
                    "If either Rectangle has any dimension less than zero the rules for non-existant rectangles apply.",
                    "If only one has a dimension less than zero, then the result will be a copy of the other Rectangle.",
                    "If both have dimension less than zero, then the result will have at least one dimension less than zero.",
                    "If the resulting Rectangle would have a dimension too large to be expressed as an int, the result will have a dimension of Integer.MAX _ VALUE along that dimension.",
                    "If this Rectangle has any dimension less than zero, the rules for non-existant rectangles apply.",
                    "In that case, the new bounds of this Rectangle will have a location equal to the specified coordinates and width and height equal to zero.",
                    "After adding a point, a call to contains with the added point as an argument does not necessarily return true.",
                    "The contains method does not return true for points on the right or bottom edges of a Rectangle.",
                    "Therefore, if the added point falls on the right or bottom edge of the enlarged Rectangle, contains returns false for that point.",
                    "If the specified point must be contained within the new Rectangle, a 1x1 rectangle should be added instead:",
                    "In that case, the new bounds of this Rectangle will have a location equal to the coordinates of the specified Point and width and height equal to zero.",
                    "After adding a Point, a call to contains with the added Point as an argument does not necessarily return true.",
                    "Therefore if the added Point falls on the right or bottom edge of the enlarged Rectangle, contains returns false for that Point.",
                    "If either Rectangle has any dimension less than 0, the result will have the dimensions of the other Rectangle.",
                    "If both Rectangles have at least one dimension less than 0, the result will have at least one dimension less than 0.",
                    "If either Rectangle has one or both dimensions equal to 0, the result along those axes with 0 dimensions will be equivalent to the results obtained by adding the corresponding origin coordinate to the result rectangle along that axis, similar to the operation of the add ( Point ) method, but contribute no further dimension beyond that.",
                    "This method modifies the Rectangle so that it is h units larger on both the left and right side, and v units larger at both the top and bottom.",
                    "The new Rectangle has ( x - h, y - v ) as its upper-left corner, width of ( width + 2h ), and a height of ( height + 2v ).",
                    "If negative values are supplied for h and v, the size of the Rectangle decreases accordingly.",
                    "The grow method will check for integer overflow and underflow, but does not check whether the resulting values of width and height grow from negative to non-negative or shrink from non-negative to negative.",
                    "The result is true if and only if the argument is not null and is a Rectangle object that has the same upper-left corner, width, and height as this Rectangle.",
                    ""
                ],
                "title": "Rectangle (Java Platform SE 7 )"
            }
        ],
        "git": [
            {
                "link": "https://github.com/Devlight/NavigationTabBar/issues/67",
                "content": [
                    "java.lang.IllegalArgumentException: width and height must be > 0 navigation tab bar",
                    "The text was updated successfully, but these errors were encountered:",
                    "sorry it was all my fault",
                    "@Beckuro What was your issue and how did you solve it ?",
                    "I have already solver mine, check this one to see if you are under the same conditions",
                    "I'm facing same please help",
                    "You need setup models first before onDraw called.",
                    "@mdtuyen What do you suggest exactly ?",
                    "Can you share any code snippet ?",
                    "May be am doing the same thing.",
                    "You must first use the butterknife binding.",
                    "If you just use it, the above same error will occur.",
                    ""
                ],
                "description": "i just got \njava.lang.IllegalArgumentException: width and height must be > 0 navigation tab bar\n",
                "title": "java.lang.IllegalArgumentException: width and height must be > 0 navigation tab bar"
            }
        ],
        "qa": [
            {
                "uid": "38980595",
                "link": "https://stackoverflow.com/questions/38980595",
                "title": "IllegalArgumentException: width and height must be &gt; 0 in activity",
                "answers": [
                    {
                        "uid": 39669349,
                        "score": 5,
                        "text": [
                            "It sounds like you may be using the support library ?",
                            "I had the same error and traced it to a bug with DrawableCompat.wrap -LRB- -RRB- in 23.4.0 that doesn't exist in earlier & later versions of the support library.",
                            "This bug incorrectly sets the drawable bounds to 0 -LRB- or negative in the case of an inset drawable -RRB-.",
                            "I've seen this cause a crash on Android 5.1.",
                            "I didn't see a specific issue opened for this, but looking at the code for DrawableWrapperDonut/DrawableWrapperGingerbread, I can see that the problem was introduced around 23.4.0 and later fixed, so if you were using the buggy version, switching to a good version should fix this crash."
                        ]
                    }
                ],
                "tags": [
                    "android"
                ]
            }
        ],
        "other": [
            {
                "link": "https://www.b4x.com/android/forum/threads/webview-capturebitmap-java-exception-width-and-height-must-be-0.23759",
                "type": "misc",
                "content": [
                    "General Guides Video Tutorials Glossary",
                    "What's new New profile posts Latest activity",
                    "Current visitors New profile posts Search profile posts",
                    "Welcome to B4X forum !",
                    "B4X is a set of simple and powerful cross platform RAD tools:",
                    "B4A ( free ) - Android development B4J ( free ) - Desktop and Server development B4i - iOS development B4R ( free ) - Arduino, ESP8266 and ESP32 development",
                    "All developers, with any skill level, are welcomed to join the B4X community.",
                    "For a better experience, please enable JavaScript in your browser before proceeding.",
                    "Webview CaptureBitMap - Java Exception Width and height must be > 0",
                    "Similar threadsB4A Tutorial Camera2 - Still images and videosB4A Tutorial Handle the soft keyboard with the IME libraryB4A Tutorial Using CallSubDelayed to interact between activities and servicesB4A Tutorial ImageDownloader - The simple way to download imagesB4A Question Webview CaptureBitmap not working with api 21 +",
                    "If you look at the following code it works if the MsgBox is un-commented in the PageFinished Sub.",
                    "If left as commented then Java Exception `` width and height must be > 0'' occurs.",
                    "I have tried everything I can think of to resolve this without any joy.",
                    "Any help is greatly appreciated.",
                    "Attached is a Project File which shows this.",
                    "Thanks in advance, Mark S.",
                    "Erel Administrator Staff member Licensed User",
                    "A bit ugly but should work:",
                    "B4X programming - video tutorials All Android developers should read Teaching programming with B4X",
                    "Thank you very much Erel.",
                    "That has solved my problem Have a nice rest of the day.",
                    "hello erel: i have found this error in my android 401 unauthorized your client does not have permision to get URL / cgi-bin/view/image from this server.",
                    "i want to get same image from IP camera with this URL http://192.168.0.100:8080/cgi-bin/view/image ( in mozila URL fine )",
                    "my IP camera is TPlink SC3030 ...",
                    "i think before get image, must log in to IP camera with user and pas can u help me ...",
                    "Please start a new thread for this question.",
                    "i tried this example with an webcam ....",
                    "but it do not work.",
                    "Do i something wrong ?",
                    "Add to Manifest android: hardwareAccelerated = `` true''",
                    "Which error do you get ?",
                    "You must log in or register to reply here.",
                    "Contact us Terms and rules Privacy policy Help Home RSS",
                    "Forum software by XenForo ® © 2010-2020 XenForo Ltd..",
                    ""
                ],
                "title": "Webview CaptureBitMap- Java Exception Width and height must be > 0 | B4X Programming Forum"
            },
            {
                "link": "https://www.b4x.com/android/forum/threads/solved-how-to-fix-crashlytics-width-and-height-must-be-0-with-as-onboarding-view.110398",
                "type": "misc",
                "content": [
                    "General Guides Video Tutorials Glossary",
                    "What's new New profile posts Latest activity",
                    "Current visitors New profile posts Search profile posts",
                    "Welcome to B4X forum !",
                    "B4X is a set of simple and powerful cross platform RAD tools:",
                    "B4A ( free ) - Android development B4J ( free ) - Desktop and Server development B4i - iOS development B4R ( free ) - Arduino, ESP8266 and ESP32 development",
                    "All developers, with any skill level, are welcomed to join the B4X community.",
                    "For a better experience, please enable JavaScript in your browser before proceeding.",
                    "Android Question -LSB- Solved -RSB- How to fix Crashlytics `` width and height must be > 0'' with `` AS Onboarding View'' ?",
                    "Similar threadsB4J Tutorial -LSB- B4X -RSB- Custom Views with Enhanced Designer SupportB4A Tutorial -LSB- B4X -RSB- -LSB- XUI -RSB- Creating custom views with XUIB4A Tutorial -LSB- B4X -RSB- How to get <custom view here> from <CLV or any other container> B4A Tutorial -LSB- B4X -RSB- I need 100 <custom view here> s.",
                    "How to add programmatically?B4A Library -LSB- B4X -RSB- -LSB- XUI -RSB- Cross platform & native UI library",
                    "fredo Well-Known Member Licensed User",
                    "The'' -LSB- B4X -RSB- -LSB- XUI -RSB- AS Onboarding View'' from @Alexander Stolte is a helpful addition to the B4X world.",
                    "The handling is simple and understandable.",
                    "Unfortunately Firebase Crashlytics throws an error which does not appear on all devices:",
                    "Fatal Exception: java.lang.IllegalArgumentException: width and height must be > 0",
                    "at android.graphics.Bitmap.createBitmap ( Bitmap.java: 829 ) at android.graphics.Bitmap.createBitmap ( Bitmap.java: 808 ) at android.graphics.Bitmap.createBitmap ( Bitmap.java: 775 ) at anywheresoftware.b4a.objects.drawable.CanvasWrapper.Initialize ( CanvasWrapper.java: 81 ) at anywheresoftware.b4a.objects.B4XCanvas.Initialize ( B4XCanvas.java: 37 )",
                    "_ ini_views ( asonboarding.java: 673 ) at myapp.asonboarding.",
                    "_ base_resize ( asonboarding.java: 273 ) at myapp.asonboarding.",
                    "_ designercreateview ( asonboarding.java: 395 )",
                    "_ buildlayout ( main.java: 796 ) at myapp.main $ ResumableSub_Activity_Create.",
                    "at java.lang.reflect.Method.invoke ( Method.java ) at anywheresoftware.b4a.BA.raiseEvent2 ( BA.java: 196 ) at myapp.main.afterFirstLayout ( main.java: 104 ) at myapp.main.access $ 000 ( main.java: 17 ) at myapp.main $ WaitForLayout.run ( main.java: 82 ) at android.os.Handler.handleCallback ( Handler.java: 739 ) at android.os.Handler.dispatchMessage ( Handler.java: 95 ) at android.os.Looper.loop ( Looper.java: 148 ) at android.app.ActivityThread.main ( ActivityThread.java: 5421 ) at java.lang.reflect.Method.invoke ( Method.java ) at com.android.internal.os.ZygoteInit $ MethodAndArgsCaller.run ( ZygoteInit.java: 726 ) at com.android.internal.os.ZygoteInit.main ( ZygoteInit.java: 616 ) Click to expand ...",
                    "Spoiler: code of relevant bas module",
                    "API of the affected device: 23",
                    "What should be done to prevent the error from occurring again ?",
                    "xpnl_circlebackground = xui.CreatePanel ('''' )",
                    "i would guess you need to add a xpnl_circlebackground.",
                    "setlayoutanimated ( ... ) XUI.CreatePanel does not set a size ...",
                    "I guess you should see a similar warning in the project.",
                    "Maybe you are ignoring this warnings ?",
                    "If you find my answer useful please click on like.",
                    "You can even Multipart Fileupload b4A - > PHP | Create PDF | Create dynamic JPG | My Libraries ( Overview )",
                    "additionally i think this does not work too",
                    "Whenever you want to add a view to xpnl_headerarea or xpnl_bottomarea it width and height get 0.",
                    "On the 1st sight i would guess it is a design error.",
                    "Did not tried the example though.",
                    "Alexander Stolte Expert Licensed User",
                    "On the develop i had this error too, but i have fixed it with this line of code in the `` ini_views'' sub.",
                    "But the V1 .8 already has this line in it.",
                    "This line on `` Base_Resize'' is also critical:",
                    "Maybe your mBase width is 0 ?",
                    "-LSB- B4X -RSB- AS Views Overview You saved time and effort ?",
                    "You like what i do ?",
                    "show it with a small donation.",
                    "Maybe something around `` CanvasWrapper'' ?",
                    "( I never worked with Canvas )",
                    "Erel Administrator Staff member Licensed User",
                    "The problem happens because xpnl_circlebackground size is zero or less.",
                    "It can happen for example if the view is anchored to both sides and it becomes zero sized.",
                    "You can fix it in the class code by checking its size and setting it:",
                    "B4X programming - video tutorials All Android developers should read Teaching programming with B4X",
                    "Reactions: fredo and Alexander Stolte",
                    "You can fix it in the class code Click to expand ...",
                    "Spoiler: For anyone interested here the modified class",
                    "Spoiler: For anyone interested here the modified class Click to expand ...",
                    "Fix Crash on Crashlytics `` width and height must be > 0''",
                    "You must log in or register to reply here.",
                    "Contact us Terms and rules Privacy policy Help Home RSS",
                    "Forum software by XenForo ® © 2010-2020 XenForo Ltd..",
                    "at java.lang.reflect.Method.invoke ( Method.java ) at anywheresoftware.b4a.BA.raiseEvent2 ( BA.java: 196 ) at myapp.main.afterFirstLayout ( main.java: 104 ) at myapp.main.access $ 000 ( main.java: 17 ) at myapp.main $ WaitForLayout.run ( main.java: 82 ) at android.os.Handler.handleCallback ( Handler.java: 739 ) at android.os.Handler.dispatchMessage ( Handler.java: 95 ) at android.os.Looper.loop ( Looper.java: 148 ) at android.app.ActivityThread.main ( ActivityThread.java: 5421 ) at java.lang.reflect.Method.invoke ( Method.java ) at com.android.internal.os.ZygoteInit $ MethodAndArgsCaller.run ( ZygoteInit.java: 726 ) at com.android.internal.os.ZygoteInit.main ( ZygoteInit.java: 616 )",
                    ""
                ],
                "title": "[Solved] How to fix Crashlytics \"width and height must be > 0\" with \"AS Onboarding View\"? | B4X Programming Forum"
            }
        ]
    },
    "parsed": true
}