{
    "0": {
        "run_cnt": 9,
        "overall": {
            "precision": [
                0.5715907164582031,
                0.5760118047174212,
                0.5188833269210958,
                0.538706593063397,
                0.5648963389425007,
                0.5420665553534629,
                0.5345632737478861,
                0.5299167160079016,
                0.5522659006075777
            ],
            "recall": [
                0.5915250994257258,
                0.6106959362203017,
                0.5597370350002967,
                0.5632033607436823,
                0.5834562422181722,
                0.5538665594477697,
                0.545414588957278,
                0.5508813298243987,
                0.5627556423429936
            ],
            "fscore": [
                0.5471501523317285,
                0.5277109903244602,
                0.46237372375891805,
                0.5237911453123868,
                0.5213086866394209,
                0.48124815943481924,
                0.4704226723253773,
                0.47970431031908917,
                0.4723883983639952
            ]
        },
        "api": {
            "precision": [
                0.5613713838216325,
                0.5772388851179365,
                0.5540745376934892,
                0.4442982015682927,
                0.4962654044731327,
                0.5556114741343923,
                0.5103570671064535,
                0.4961932300509338,
                0.5565089585666294
            ],
            "recall": [
                0.5565349946977731,
                0.5986687623087411,
                0.48772913194970463,
                0.4244624896136031,
                0.4673362162757709,
                0.4854315002777357,
                0.5050221959023655,
                0.48567509284635474,
                0.5146284653840327
            ],
            "fscore": [
                0.4562096319110168,
                0.4777008746462587,
                0.3586119483935553,
                0.39930454795617154,
                0.41033454489492394,
                0.3688577489853785,
                0.4020158660059304,
                0.3979342109268239,
                0.3504698408983399
            ]
        },
        "so": {
            "precision": [
                0.6051587301587301,
                0.6429101943807826,
                0.47973137973137975,
                0.5270833333333332,
                0.6027777777777777,
                0.5284493284493285,
                0.5736673457261693,
                0.5833916083916084,
                0.5907308377896613
            ],
            "recall": [
                0.6182367149758453,
                0.6364734299516908,
                0.5205917874396135,
                0.5707125603864734,
                0.6080917874396136,
                0.5522342995169082,
                0.5863526570048309,
                0.6064009661835749,
                0.6057971014492753
            ],
            "fscore": [
                0.6054778554778555,
                0.6201923076923077,
                0.4782326185834958,
                0.5325955267815733,
                0.5853313840155946,
                0.5074074074074074,
                0.5368504044974634,
                0.5626592007026789,
                0.5586452762923352
            ]
        },
        "git": {
            "precision": [
                0.5827020202020202,
                0.5128676470588236,
                0.5347222222222222,
                0.5331293706293706,
                0.579059829059829,
                0.5520833333333333,
                0.4735663082437276,
                0.48585526315789473,
                0.48247008618525644
            ],
            "recall": [
                0.6544642857142857,
                0.6126893939393939,
                0.6818181818181819,
                0.5651785714285714,
                0.6232142857142857,
                0.5892857142857143,
                0.4579545454545454,
                0.5168560606060606,
                0.5030303030303029
            ],
            "fscore": [
                0.5816411849020544,
                0.4764423076923077,
                0.5458204334365325,
                0.546957671957672,
                0.5646882011769189,
                0.5381479933110368,
                0.39738430583501005,
                0.44341532350469787,
                0.43086913086913087
            ]
        },
        "misc": {
            "precision": [
                0.5203467248001661,
                0.5375812974804612,
                0.5265811416321504,
                0.6561270965876229,
                0.5625416250416251,
                0.5389306989488647,
                0.5611103379260526,
                0.5274893162393163,
                0.5601212512977218
            ],
            "recall": [
                0.5235085945399394,
                0.5820634118156869,
                0.5683816625740286,
                0.6887052217246858,
                0.6228649068322982,
                0.5893308536761519,
                0.6118599234435937,
                0.5668333814820165,
                0.6060459699552216
            ],
            "fscore": [
                0.5161080854629242,
                0.4902678125830433,
                0.4589004472097997,
                0.6119046438195375,
                0.4928692677821598,
                0.4974998640491598,
                0.5122262468770629,
                0.4733310609503611,
                0.5064409064320049
            ]
        }
    },
    "venn_diagram_set": [
        "",
        "Since the version of Retrofit 2.6.0, you can get the annotations in OkHttp Interceptor using the tag field like this:",
        "Typically, the computed size is just big enough for the control and the label to be fully visible.",
        "ComponentActivity, the base class for FragmentActivity and AppCompatActivity, allows you to control the behavior of the Back button by using its OnBackPressedDispatcher, which you can retrieve by calling getOnBackPressedDispatcher ( ).",
        "Call ActivityOptions.setLockTaskEnabled ( ) and supply these options when starting the activity.",
        "get a seekable file descriptor from your pdf document:",
        "If you want to set a specific size for your camera preview, set this in the surfaceChanged ( ) method as noted in the comments above.",
        "Of the suggestions proposed, LINK actually combines observable results with each other, which may or may not be what is wanted, but was not asked in the question.",
        "Make a Snackbar to display a message.",
        "These permission can then be allowed or denied by the user.",
        "The magic behind this is the setTag ( ) method which lets us attach an arbitrary object onto a View object, which is how we save the already inflated View for future reuse.",
        "When scaling a document for printing the aspect ratio should be preserved.",
        "Optimizing Performance Whenever you scroll the ListView, its adapter's getView ( ) method is called in order to create a row and display it on screen.",
        "These repeated calls can seriously harm the ListView's performance, especially if your app is running on limited resources and/or you have a very large list.",
        "Have you checked RemoteControlClient ?",
        "You can also tap on ` Clear data'' button to delete all the data of the app.",
        "Instead of changing implementation to api ( Not Recommended ), you can add dependencies of missing libraries in app's build.gradle and rebuild the project.",
        "Returns the value mapped by name if it exists and is a JSONObject, or null otherwise.",
        "Initialize a new instance of MediaRecorder with the following calls:",
        "This method also deletes ongoing notifications.",
        "The SafetyNet service includes a reCAPTCHA API that you can use to protect your app from malicious traffic.",
        "The ActionBar by default now has just the title for the current activity.",
        "The second method is more useful if you are also doing plain HTTP requests, where everyone can see the parameters being sent.",
        "This is designed to prevent apps from eavesdropping on telephone conversations.",
        "This means there are a couple more things to consider when working with permissions for a Marshmallow app.",
        "Similar to how private/public variables are managed, using a parent component allows more explicit control and better encapsulation, but using subcomponents makes dependency injection easier to manage at the expense of less encapsulation.",
        "An input queue that holds Runnable tasks.",
        "But what if we want to render a PDF Document in our app itself.",
        "Volley provides the following classes for JSON requests:",
        "You either allowed all permissions an app needed to function -- before installation -- or you declined them all, which meant you couldn't install the app.",
        "99 % of the time, not working properly == not used properly.",
        "Note: With the introduction of the Multi-Window feature in Android 7.0 ( API level 24 ) and higher, you can no longer assume the aspect ratio of the preview is the same as your activity even after calling setDisplayOrientation ( ).",
        "I guess all that's really missing in the generated code is a typecast to Provider to achieve erasure bliss.",
        "The activity also removes registered callbacks when their associated LifecycleOwner is destroyed, which prevents memory leaks and makes it suitable for use in fragments or other lifecycle owners that have a shorter lifetime than the activity.",
        "A Rectangle object's width and height are public fields.",
        "A lot of these background processes sync data and deliver notifications.",
        "At that time, your app can request the runtime permission that's required for accessing that data.",
        "getLastLocation ( GoogleApiClient ) this API should be used when there is no need for continuous access to location from an application.",
        "Returns the value mapped by name if it exists and is a JSONArray, or throws otherwise.",
        "Make sure you are referencing your project's BuildConfig class, not from any of your dependency libraries.",
        "The simplest adapter to use is called an ArrayAdapter because the adapter converts an ArrayList of objects into View items loaded into the ListView container.",
        "You will get a JSON Response with a success field.",
        "Returns the value mapped by name if it exists and is a JSONArray, or null otherwise.",
        "Normal permission groups are allowed by default, because they don't pose a risk to your privacy.",
        "Note that you must always use getChildFragmentManager when interacting with nested fragments instead of using getSupportFragmentManager.",
        "Instead of creating the dependencies an activity requires in the onCreate ( ) method, you want Dagger to populate those dependencies for you.",
        "I don't know if it's useful, but you can simulate a timeout with MockWebServer:",
        "RemoteControlClient was what you were looking for, but now it's deprecated and has been replaced with MediaSession.",
        "This document shows you how to use MediaRecorder to write an application that captures audio from a device microphone, save the audio, and play it back ( with MediaPlayer ).",
        "RecyclerView is designed to be very efficient, even with large lists, by reusing, or recycling, the views that have scrolled off the screen.",
        "You still need to validate the user's response token from your backend server.",
        "If you read the docs then you'll see that Volley runs on background threads.",
        "When you use this class to obtain references to your database, the system performs the potentially long-running operations of creating and updating the database only when needed and not during app startup.",
        "If you declare any dangerous permissions, and if your app is installed on a device that runs Android 6.0 ( API level 23 ) or higher, you must request the dangerous permissions at runtime by following the steps in this guide.",
        "Consider the following below: If you have a JSON object for `` Vehicle'', it could be a `` Car'' or `` Plane'', each with its own fields, some unique to the other.",
        "This example layout specifies a horizontal ( landscape ) layout and the code below fixes the orientation of the application to landscape.",
        "PS: the common point in all these approaches is,",
        "Sets the horizontal alignment of the text and the vertical gravity that will be used when there is extra space in the TextView beyond what is required for the text itself.",
        "Check whether the user has already granted the runtime permission that your app requires.",
        "A Rectangle whose width or height is exactly zero has location along those axes with zero dimension, but is otherwise considered empty.",
        "Hi you do it by using this approach, all fragments will remain in the container once added initially and then we are simply revealing the desired fragment and hiding the others within the container.",
        "An app can also create notification channels in response to choices made by users of your app.",
        "If your expected response is one of these types, you probably don't have to implement a custom request.",
        "Please refer to the following code snippet.",
        "You can then use one of the following classes:",
        "Since the cursor starts at position -1, calling moveToNext ( ) places the `` read position'' on the first entry in the results and returns whether or not the cursor is already past the last entry in the result set.",
        "Binding the Adapter to the RecyclerView In our activity, we will populate a set of sample users which should be displayed in the RecyclerView.",
        "You can use the default size constraints of nodes, or you can set them to provide the look that you want.",
        "While developing for a target platform of 2.3.3 using Eclipse on Ubuntu, I had permission failures in the log file that indicated I needed this exact line while working on something similar.",
        "This is a short-circuiting terminal operation.",
        "These are permissions that are requested while the app is running ( instead of before the app is installed ).",
        "As Toolbar is just a ViewGroup and can be styled and positioned like any other view.",
        "After some time, I figured out, that it works if I annotate the stations field with a @JsonProperty annotation:",
        "There are three ways to define anchor in Hilt.",
        "That is because, when your app starts, the ViewPager displays the movie at index 0.",
        "gravity is the way the text will align itself in the TextView.",
        "We instantiate a new LocationRequest object.",
        "Getting a bitmap cache from a layout or a view by doing something like First you got ta setDrawingCacheEnabled to a layout -LRB- a linearlayout or relativelayout, or a view -RRB-",
        "The easiest way to simulate network issues with MockWebServer is by setting the SocketPolicy to SocketPolicy.DISCONNECT _ AT_START, SocketPolicy.NO _ RESPONSE or etc:",
        "I run into the same issue today ( I suppose ).",
        "You may extend it from BaseAdapter.",
        "Using both WHERE predicates and ORDER BY both require an index and SQLite can only use one, so that can be a point where performance suffers.",
        "In MainActivity, add the EXTRA_MESSAGE constant and the sendMessage ( ) code, as shown:",
        "Your example code prints the correct type value strings, but the deserialized object types are all instances of the Default class.",
        "Then inside of the interceptor, you can verify if the request is annotated or no.",
        "This method returns either PERMISSION_GRANTED or PERMISSION_DENIED, depending on whether your app has the permission.",
        "We use a ScaleGestureDetector on the activity to listen to touch events.",
        "The more indexes you have, the slower your INSERTs will be, so you will have to work out the best trade-off for your situation.",
        "If it finds one, it assigns the references to the respective fields.",
        "Client will use this passcode to encrypt user's email ID and send to the server.",
        "This code sample demonstrates how to modify the contents of the text view defined in the previous XML layout:",
        "They are not mutually exclusive: in many cases, a class is both injectable and has dependencies.",
        "Layouts query the preferred size of their nodes by invoking the prefWidth ( height ) and prefHeight ( width ) methods.",
        "Kapt LINK to run annotation processors.",
        "Since getCount ( ) now returns a number larger than the size of the list, the ViewPager will try to access the movie at an index greater than the array size when the user swipes past the last movie.",
        "By multiplying the length of the array with MAX_VALUE, the swipe limit will grow proportionally to the number of movies in your list.",
        "If this isn't the case, see the backwards compatibility section to understand how permissions will behave on your configuration.",
        "If you are using Android Studio and Gradle, you should have the following dependencies added in build.gradle file",
        "For more info on how scopes work refer to LINK and Dagger's generated code.",
        "basically I used a private string property taken as a string to construct a computed property with that enum correspondance.",
        "Unscoped - when no annotation declared.",
        "During deserialization, you would want Jackson to deserialize the `` Vehicle'' JSON object to the appropriate `` Car'' or `` Plane'' class.",
        "Overview A fragment is a reusable class implementing a portion of an activity.",
        "Fragment Listener If a fragment needs to communicate events to the activity, the fragment should define an interface as an inner type and require that the activity must implement this interface:",
        "While Dagger 2 also enables the ability to create scoped instances, the responsibility rests on you to create and delete references that are consistent with the intended behavior.",
        "If not, look below at what our class should now look like.After instantiating a new instance of this class in another class or activity, we can access these methods to perform some background task in doInBackground ( ) and retrieve the result in onPostExecute ( ).",
        "But these action buttons should not duplicate the action performed when the user taps the notification.",
        "Check the provider that's associated with the new location.",
        "Here is a more complex example from the InteractiveChart sample provided with this class.",
        "Check permissions before calling Contacts.getAll ( )",
        "The newApplication method provides the application instance you'll use in the test.",
        "Every application on Android runs in a secure sandbox environment, so other processes on the system can not access your code or private data without proper handshake.",
        "Must be one or more ( separated by' |' ) of the following constant values.",
        "Both of these options will be set to 5 minutes, which is perfect as most connections usually timeout after 5 minutes or more.",
        "In this way, even for a list of 1000 items, only ~ 7 item view rows are ever instantiated or held in memory.",
        "The user had no way of changing permissions, even after installing the app.",
        "It is useful when dependency does not necessarily need to have single instance but may be shared for increased performance -LRB- less allocations -RRB- in single component or between components.",
        "requestLocationUpdates ( GoogleApiClient, LocationRequest, LocationListener ) this API should be used when there a need for continuous location updates and the location is accessed when the application is active in foreground.",
        "For example, the following code shows how to send a broadcast to a specific receiver:",
        "Custom scope annotations are just annotations.",
        "The parent waits for each child callback to complete, then fires off it's own handleSuccess -LRB- -RRB-.",
        "If you are using Android Studio, or if you are using Gradle from the command line, you can add your own stuff to BuildConfig or otherwise tweak the debug and release build types to help distinguish these situations at runtime.",
        "Prerequisite Google Play Services is required.",
        "Create a new ViewHolder with subviews initialized by using findViewById ( ).",
        "The following code shows how to do this in the context of an Activity, but this is also possible from within a Fragment.",
        "Next, you'll need to initiate the permission request and handle the result.",
        "The following sample is ( again ) wrong:",
        "Using this approach, all three fragments will remain in the container once added initially and then we are simply revealing the desired fragment and hiding the others within the container.",
        "Before using the reCAPTCHA API, you need to add the SafetyNet API to your project.",
        "For example, when using a WebView, you might want to override the default Back button behavior to allow the user to navigate back through their web browsing history instead of the previous screens in your app.",
        "This is what happens here: in this example, we have 4 fragments A-B-C-D if the user is on fragment A -LRB- first -RRB-, the new List will become: D-A-B-C -LSB- remove the last and push as first -RSB- I update the ViewPager and move -LRB- without animation -RRB- again to fragment A so index 1.",
        "If your app needs to use resources or information outside of its own sandbox, you can declare a permission and set up a permission request that provides this access.",
        "To overcome this, I have created a custom ViewPager -LRB- based on LINK -RRB- that calculates it's height in the required manner.",
        "@Named is a qualifier that is pre-defined by dagger, but you can create your own qualifier annotations as well:",
        "So normally the simplified algorithm is like that:",
        "I think you missed to convert String Buffer -LRB- sb -RRB- into json array object.",
        "Returns the value mapped by name if it exists and is a long or can be coerced to a long, or fallback otherwise.",
        "For example, you could override onTouchEvent ( ) to process touch events directly, and produce a scrolling effect or a `` snapping to page'' animation in response to those touch events.",
        "This is an intermediate operation.",
        "This bug incorrectly sets the drawable bounds to 0 -LRB- or negative in the case of an inset drawable -RRB-.",
        "When setting preview size, you must use values from getSupportedPreviewSizes ( ).",
        "One thing that I ran across when I applied this approach to my production code is that you still need to keep the @JsonSubtypes annotation as part of the Base class.",
        "Hang onto this holder for future recycling by using setTag ( ) to set the tag property of the view that the holder belongs to.",
        "Basically, each individual callback registers with a parent.",
        "You call cancelAll ( ), which removes all of the notifications you previously issued.",
        "If the user granted the permission to your app, you can access the private user data.",
        "You can read more about this on the material design guidelines which state: `` The use of application icon plus title as a standard layout is discouraged on API 21 devices and newer.''",
        "This line means: add a meta-property on serialization or read a meta-property on deserialization -LRB- include = JsonTypeInfo.As.PROPERTY -RRB- called'' @class'' -LRB- property ='' @class'' -RRB- that holds the fully-qualified Java class name -LRB- use = JsonTypeInfo.Id.CLASS -RRB-.",
        "The ArrayAdapter fits in between an ArrayList ( data source ) and the ListView ( visual representation ) and configures two aspects:",
        "When a fragment is not visible, the PagerAdapter will detach it, but not destroy it, so the fragment instance remains alive in the FragmentManager.",
        "Normal Permissions When you need to add a new permission, first check this page to see if the permission is considered a PROTECTION_NORMAL permission.",
        "You may find it helpful to create a companion class, known as a contract class, which explicitly specifies the layout of your schema in a systematic and self-documenting way.",
        "Right now the infinite scrolling works only when the user navigates forward through the array ( swipes left ).",
        "Those recording sources may only be used by system apps.",
        "In your app's manifest file, declare the permissions that your app might need to request.",
        "The important thing to keep in mind is that fragments should not directly communicate with each other and should generally only communicate with their parent activity.",
        "These permissions will show a dialog to the user, similar to the following one:",
        "The first step when adding a `` Runtime Permission'' is to add it to the AndroidManifest:",
        "However, Power Saver mode disables an important feature of the phone i.e. data syncing.",
        "You access the font by creating a Typeface, which specifies the intrinsic style and typeface of the font, by using ResourcesCompat.getFont ( ).",
        "If we define a defaultImpl class as a catch-all for unknown types, deserialization fails for any protocol objects that contain other protocol objects if the reference to those objects is null.",
        "Using of rawQuery -LRB- -RRB- instead of building using ContentValues will fasten up in certain cases.",
        "To customize what type of view is used for the data object, override getView ( int, android.view.View, android.view.ViewGroup ) and inflate a view resource.",
        "2 - Create MarkerView",
        "You have to explicitly use ... subscribeOn ( ):",
        "In Marshmallow, Google has designated certain permissions to be `` safe'' and called these `` Normal Permissions''.",
        "You can schedule code to run after multiple CompletionStages have finished using CompletableFuture.allOf ( ).",
        "Try to check below FragmentPagerAdapter to get endless viewpager adapter:",
        "If you want to render a PDF, you create a renderer and for every page you want to render, you open the page, render it, and close the page.",
        "EDIT: When using Zip, make sure that the Observables being zipped all emit the same number of items.",
        "The ViewPager usually displays the `` pages'' using fragment instances, but it can also work with simple views such as ImageView if you want to display static content.",
        "There is a simple method call in android to go from pixels to dp.",
        "Starting with Android 8.0, users can choose to disable or enable lock screen notifications for each notification channel.",
        "Set the view Marker in the chart",
        "That's why using @ActivityScope dependency in non-@ActivityScope component will fire a compilation error.",
        "Collections are primarily concerned with the efficient management of, and access to, their elements.",
        "Returns the value mapped by name if it exists and is a double or can be coerced to a double, or NaN otherwise.",
        "What if there was an encryption technique where the algorithm would generate a key pair for you comprising of 2 keys.",
        "subscribe ( ) is single-threaded by design and there is no way around it.",
        "GoogleApiClient FusedLocationProviderApi requires the GoogleApiClient instance to get the Location and it can be obtained as below.",
        "The user clicks the notification, and you called setAutoCancel ( ) when you created the notification.",
        "In the meantime I think that you will need to annotate your child classes with @JsonTypeInfo and @JsonSubTypes to override the inherited annotations.",
        "This made it easy for developers to deal with permissions, but wasn't the best user experience.",
        "Classes that have dependencies that you intend to inject.",
        "In essence, because Hilt aggregates your modules into your root app Gradle project where Dagger generates the component implementation and because such code generated references all of your binding types in other modules, then the root app Gradle project must have visibility in its classpath to all of those other Gradle modules where you define Dagger modules along with its dependencies if they are used in those Dagger modules.",
        "Although what you are doing is really not appropriate.",
        "Aside from the compiler not letting you within recent updates, using the UI thread to complete a request has deadly consequences.For example: Lets say we implement a GET request on our UI thread, and our API ( for some reason ) can not process it.",
        "Swipe views allow you to navigate between sibling screens, such as tabs, with a horizontal finger gesture, or swipe.",
        "create the PdfRenderer",
        "Let's create a Java class that will act as the Business model in our application:",
        "Some devices ( like Chromebooks ) have volume controls but do not allow apps to use the AudioManager methods described above to change the level of an audio stream.",
        "Defining the Model Given a Java object that has certain fields defined such as a User class:",
        "By default, UI controls compute default values for their preferred size that is based on the content of the control.",
        "render the page on the prepared bitmap",
        "Returns the value mapped by name if it exists and is a boolean or can be coerced to a boolean, or fallback otherwise.",
        "If you are using onBackPressed ( ) to handle Back button events, we recommend using a OnBackPressedCallback instead.",
        "Normally, the Android OS prohibits apps from accessing each other's files -LRB- i.e. databases, preference files, regular files stored in the app's private directory -RRB- through proven Linux file permissions.",
        "The naive approach to this ( without any view caching ) looks like the following:",
        "Now you can simply write",
        "To send a task to a thread pool, use the ExecutorService interface.",
        "This is a stateful intermediate operation.",
        "Once you have built the request, you are ready to start listening on location updates after `` onConnected ( )'' method has been fired:",
        "In here, you're assigning a custom font to each of the text views in your rows' layout.",
        "The proposed solutions are correct but to achieve the result you need to set the initial value of your viewpager to Integer.MAX _ VALUE/2.",
        "A test runner makes this possible.",
        "To add an action button, pass a PendingIntent to the addAction ( ) method.",
        "For more complex use-cases or if you want to have your HTTP APIs abstracted as Java classes as part of a larger application look at Retrofit or Feign.",
        "Use LINK to modify the collection in place.",
        "Users can use the system settings to choose the level of detail visible in lock screen notifications, including the option to disable all lock screen notifications.",
        "and successfully create a Business with Business.fromJson ( json ).",
        "In the end, I found out that the issue seemed to be data classes that have non-primitive members, e.g. a data class containing a List or another data class.",
        "So the correct way to do this is:",
        "Set the audio encoder using setAudioEncoder ( ).",
        "A provider is a factory function that returns an instance of an object.",
        "When doing so, the callbacks are invoked in the reverse order in which they are added - the callback added last is the first given a chance to handle the Back button event.",
        "This is why forEach is slower than the C style.",
        "Set the audio source using setAudioSource ( ).",
        "It can perform different logic depending on the result:",
        "@geoand This is the same issue I described above ( complex structures ) and why I added troubleshooting notes to the Kotlin documentation.",
        "Fragment Hiding vs Replace In many of the examples above, we call transaction.replace ( ... ) to load a dynamic fragment which first removes the existing fragment from the activity invoking onStop and onDestroy for that fragment before adding the new fragment to the container.",
        "In Dagger 2, you can define how components should be encapsulated by defining custom scopes.",
        "Open MoviesPagerAdapter.kt and add the following method inside the class:",
        "First, define the qualifiers that you will use to annotate the @Binds or @Provides methods:",
        "To learn how to validate the user's response token, see Verifying the user's response.",
        "Now make your activity implement the interface:",
        "Anyone with HTTP POST knowledge could put random data inside of the g-recaptcha-response form field, and foll your site to make it think that this field was provided by the google widget.",
        "Capture and Save Files - Setup the code for capturing pictures or videos and saving the output.",
        "There are two types of standard PagerAdapters that manage the lifecycle of each fragment: FragmentPagerAdapter and FragmentStatePagerAdapter.",
        "This tells the API to provide updates every 20 seconds ( preferably ), but if there is a change available within a 5 second period, it should provide that too.",
        "But forEach is very different, according to this answer on StackOverFlow and document from Oracle, JVM has to convert forEach to an iterator and call hasNext ( ) with every item.",
        "Once you have defined how your database looks, you should implement methods that create and maintain the database and tables.",
        "This is a synchronous request:",
        "Instead, as the user scrolls through the list, items that leave the screen are kept in memory for later use and then every new row that enters the screen reuses an older row kept around in memory.",
        "Alternatively, if you want more flexibility, you can pass in a Handler to each function:",
        "By contrast, streams do not provide a means to directly access or manipulate their elements, and are instead concerned with declaratively describing their source and the computational operations which will be performed in aggregate on that source.",
        "If document page size is greater than the printed media size the content should be anchored to the upper left corner of the page for left-to-right locales and top right corner for right-to-left locales.",
        "Beginning in Android 6.0 -LRB- API level 23 -RRB-, users grant permissions to apps while the app is running, not when they install the app.",
        "Basically you need to load a bitmap and pass to each event you want to draw.",
        "Wait for the user to invoke the task or action in your app that requires access to specific private user data.",
        "This way, after you divide pagerAdapter.count by 2, pagerAdapter.count % movies.size = 0 ( which is the first index that the ViewPager asks for when the app starts ).",
        "The PagerAdapter will create each Fragment, add the corresponding movie data to it and return it to the ViewPager.",
        "The following code snippet shows how to handle the permissions response:",
        "If you use an ordering predicate -LRB- <, < =, > etc -RRB- then that needs to be in the last used column of the index.",
        "In Android, scrolling is typically achieved by using the ScrollView class.",
        "If the user denied the permission instead, gracefully degrade your app experience so that it provides functionality to the user, even without the information that's protected by that permission.",
        "Make sure you have the icon set in the manifest.xml file, in the application tag as:",
        "Go to Apps from the phone Settings and open up the respective app.",
        "In your activity's onCreate ( ) method, create an instance of the Fused Location Provider Client as the following code snippet shows.",
        "So really you want to replace:",
        "Pull the data, update the ArrayList that your Adapter is connected to, then call adapter.notifyDataSetChanged -LRB- -RRB-.",
        "That way the PagerAdapter will keep creating pages until the page index reaches the value returned by getCount ( ).",
        "This will ensure that the ViewPager doesn't request the element at an index larger than movies.size because the remainder after you divide the position by movies.size will always be greater than or equal to 0 and less than movies.size.",
        "It wasn't until I moved the * uses-permission ... READ_CONTACTS * line to outside the application tag that things worked.",
        "Only when the user explicitly launches the app it is put in a state where the receivers get fired.",
        "Note: Please, set HttpClient of your code -LRB- e.g. AsyncHttpClient -RRB- with that number port for testing purpose.",
        "With this method in place, we could take a single business JSON dictionary such as:",
        "JsonObjectRequest -- A request for retrieving a JSONObject response body at a given URL, allowing for an optional JSONObject to be passed in as part of the request body.",
        "I'd still recommend to use use = JsonTypeInfo.Id.NAME, as the new way LINK in complex cases when it has no way to determine which subtype to use.",
        "Keep in mind that your targetSdkVersion must be > = 23 and your emulator / device must be running Marshmallow to see the new permissions model.",
        "Get the data item associated with the specified position in the data set.",
        "One of the biggest advantages of using the Toolbar widget is that you can place the view anywhere within your layout.",
        "Afterwards, refer to Kirill's answer ; essentially a `` scope'' by itself only determines that it is a different scope from the other one.",
        "Android-Lollipop -LRB- api 21 -RRB- introduce a new API: LINK",
        "If not you should instantiate a new one.",
        "Next you set the typeface for the corresponding TextView to set the custom font.",
        "Instantiating the component We should do all this work within a specialization of the Application class since these instances should be declared only once throughout the entire lifespan of the application:",
        "In that case, you need to tell Hilt how to provide two different implementations of OkHttpClient.",
        "The constructors that create a Rectangle, and the methods that can modify one, do not prevent setting a negative value for width or height.",
        "Create a file named MockTestRunner.kt in the androidTest folder and add the following code to it:",
        "Due to the specifics of Android threading, we can not run network tasks on the same thread as the UI thread.",
        "Make sure to rebuild the project ( in Android Studio, select Build > Rebuild Project ) if you can not reference the Dagger component.",
        "So the first thing you should do its to create your custom adapter.",
        "Here is a sample Kotlin code for retrieving a Bitmap:",
        "You also inflate a custom view from the XML layout defined in res/layout/list_item_recipe.xml -- more on this in the next section.",
        "Here you define what information shows and where it sits within the ListView.",
        "The SQLiteOpenHelper class contains a useful set of APIs for managing your database.",
        "Change the android: label or android: icon to modify the ActionBar title or icon for a given activity or for the application as a whole.",
        "Select the respective app, make sure `` Restrict app background data'' feature is turned off.",
        "The system disables any features you don't include in the flags argument.",
        "Make a Snackbar to display a message",
        "We will then iterate through each line of our response and append it to our StringBuilder.",
        "Check the Accept the reCAPTCHA Terms of Service checkbox, then click Register.",
        "Snackbar will try and find a parent view to hold Snackbar's view from the value given to view.",
        "Therefore, Android will always ask you to approve dangerous permissions.",
        "Next, you'll create an instance of MockWebServer.",
        "This is a boolean value that will be true for a debug build, false otherwise:",
        "To look at a row in the cursor, use one of the Cursor move methods, which you must always call before you begin reading values.",
        "To create instances of subcomponents, you need an instance of the parent component.",
        "If the user denies or revokes a permission that a feature needs, gracefully degrade your app so that the user can continue using your app, possibly by disabling the feature that requires the permission.",
        "If true, adjusts the padding of this view to leave space for the system windows.",
        "Hilt is a dependency injection library for Android that reduces the boilerplate of doing manual dependency injection in your project.",
        "Tap on `` Clear Cache'' button to flush the cache.",
        "Returns the value mapped by name if it exists and is a JSONObject, or throws otherwise.",
        "You can see that it returns an application instance using PotterTestApp instead of PotterApp.",
        "However, on rooted devices an application can obtain root access and read everything.",
        "If we need two different objects of the same return type, we can use the @Named qualifier annotation.",
        "It works kind of like this: The ListView asks the adapter what it should display, and the adapter jumps into action:",
        "Pull the data all at once - not in small parts.",
        "Make sure you add it outside of the application tag.",
        "Use this to benchmark any gains as you optimize.",
        "Finally, getView ( ) creates a view to be used as a row in the list.",
        "one way could be to encrypt it using a passcode.",
        "For simplicity in rendering a camera preview, you should change your application's preview activity orientation to landscape by adding the following to your manifest.",
        "Dagger 2 analyzes these dependencies for you and generates code to help wire them together.",
        "The InteractiveChart sample supports both scrolling ( panning ) and scaling with multiple fingers, using the ScaleGestureDetector `` span'' ( getCurrentSpanX/Y ) and `` focus'' ( getFocusX/Y ) features:",
        "Can you imagine something more readable ?",
        "When GCM delivers a message to your device, BroadcastReceiver will receive the message and call the onReceive -LRB- -RRB- function, wherein you may start a service to actually perform the intended task for you.",
        "An example of polymorphic deserialization is if you want your JSON object to deserialize into a java subclass.",
        "If the fragment should always be within the activity, use XML to statically add the fragment but in more complex cases be sure to use the Java-based approach.",
        "Classes that can be injected as dependencies.",
        "Note that in the zip function, the parameters have concrete types that correspond to the types of the observables being zipped.",
        "Thus, all objects provided in the parent component are provided in the subcomponent too.",
        "In this case, you could use a Hilt module with @Provides.",
        "Installing a module into a component allows its bindings to be accessed as a dependency of other bindings in that component or in any child component below it in the component hierarchy:",
        "If you are using this class to rasterize a PDF for printing or show a print preview, it is recommended that you respect the following contract in order to provide a consistent user experience when seeing a preview and printing, i.e. the user sees a preview that is the same as the printout.",
        "Just before the return statement, add the following:",
        "However, in many cases, we may want to keep both fragments around in the container and simply toggle their visibility.",
        "Google Location Services API Google Location Services API, also known as FusedLocationProviderApi, is Google's recommended way of getting a user's location.",
        "A content provider manages access to a central repository of data.",
        "Have you tried the JSONParser ?",
        "To insert child views that represent each page, you need to hook this layout to a FragmentStateAdapter.",
        "ProGuard Dagger 2 should work out of box without ProGuard, but if you start seeing library class dagger.producers.monitoring.internal.Monitors $ 1 extends or implements program class javax.inject.Provider, make sure your Gradle configuration uses the annotationProcessor declaration instead of provided.",
        "that is done because rotation is around the top left point ( the origin ) of the view.",
        "Every adapter has three primary methods: onCreateViewHolder to inflate the item layout and create the holder, onBindViewHolder to set the view attributes based on the data and getItemCount to determine the number of items.",
        "When the reCAPTCHA API executes the onSuccess ( ) method, the user has successfully completed the CAPTCHA challenge.",
        "I uploaded some sample code in a branch here:",
        "Introducing the ViewPager Adding a ViewPager to the UI will allow the users to move forward or backward through the movies by swiping across the screen.",
        "with some custome code which simply draws a drawable icon.",
        "Fragments encapsulate views and logic so that it is easier to reuse within activities.",
        "You can limit the size of the scaling with something like",
        "Note: javac still uses multiple rounds, it just can't pick up generated kotlin sources.",
        "The error message you are getting appears to be due to dubiously-legal JSON, particularly on the receiving side:",
        "An adapter loads the information to be displayed from a data source, such as an array or database query, and creates a view for each item.",
        "Add the following line before setup ( ) in the MainActivityTest file:",
        "The command result will show you human-readable tree hierarchy of all dependencies as below.",
        "you should try this:",
        "We'll be setting our result to null here, so it is VERY important to check for a null response in the other classes that you are using this with.",
        "Note that the activities, services, or fragments that are allowed to request the dependencies declared by the modules ( by means of the @Inject annotation ) should be declared in this class with individual inject ( ) methods:",
        "You call cancel ( ) for a specific notification ID.",
        "Defining the Adapter Next, we need to define the adapter to describe the process of converting the Java object to a View ( in the getView method ).",
        "with the api 23, permission <uses-permission android:name=\"android.pemission.READ_CONTACTS\"/> dont work, change the api level in the emulator for api 22 -LRB- lollipop -RRB- or lower",
        "It triggers when you scroll the view -LRB- list for example -RRB-.",
        "The constructor for OnBackPressedCallback takes a boolean for the initial enabled state.",
        "That means you can not use the @Inject annotation in the constructor of the class ( constructor injection ) as you did in the previous examples.",
        "In the case of a GET request, we only need to catch IOException.",
        "The following code snippet demonstrates how to request a permission using a request code:",
        "For field injection, you instead apply the @Inject annotation to the fields that you want to get from the Dagger graph.",
        "The cool thing about the new Google Recaptcha is that the validation is now completely encapsulated in the widget.",
        "Just make a GET Request to",
        "Returns the value mapped by name if it exists and is a long or can be coerced to a long, or 0 otherwise.",
        "For example, this snippet fetches a JSON feed and displays it as text in the UI:",
        "When the Activity loads onCreate runs and inflates the layout in activity_main.xml and the included content_main.xml.",
        "Build a Preview Layout - Once you have the camera preview class, create a view layout that incorporates the preview and the user interface controls you want.",
        "For example, don't assume that permissions appear in the same permission group.",
        "When your ListView is connected to an adapter, the adapter will instantiate rows until the ListView has been fully populated with enough items to fill the full height of the screen.",
        "Now Android allows you to decide which permissions to accept on a case-by-case basis -- after the app is installed.",
        "If the user presses and holds the button, then onKeyDown ( ) is called multiple times.",
        "For each row, you can read a column's value by calling one of the Cursor get methods, such as getString ( ) or getLong ( ).",
        "This is a short-circuiting stateful intermediate operation.",
        "You can either rotate your bitmap when you draw it by using a matrix:",
        "Get a View that displays the data at the specified position in the data set.",
        "Because the interface that generates the graph is annotated with @Component, you can call it ApplicationComponent or ApplicationGraph.",
        "All that remains now is to implement the callback method to satisfy the LocationListener interface:",
        "Define the provider's authority string, its content URIs, and column names.",
        "You can do this by modifying setup ( ) as follows:",
        "Methods added to API set whether or not a notification is displayed on the lock screen ( setVisibility ( ) ) and for specifying `` public'' version of the notification text.",
        "So in order to get a scoped provider in a module, you need to specify the scope for your module's provider method.",
        "Once your ListView has reached the max amount of rows it can display on a screen, Android is smart enough to begin recycling those row Views.",
        "A contract class is a container for constants that define names for URIs, tables, and columns.",
        "On most devices, the default orientation of the camera preview is landscape.",
        "You also can not constructor-inject a type that you do not own, such as a class from an external library.",
        "Do not set arbitrary values in the setPreviewSize ( ) method.",
        "Override the onSuccess ( ) and onFailure ( ) methods to handle both possible outcomes of the verification request task.",
        "For activities specifically, any initialization code needs to go into the onCreate ( ) method.",
        "When we want to transfer some sensitive data to server ( at runtime ), we generate a passcode ( aka secret key ) using a symmetric encryption ( say AES ).",
        "Injection will also require these named annotations too:",
        "The FragmentPagerAdapter stores the fragments in memory as long as the user can navigate between them.",
        "Zipping a list of observables is also possible, either directly:",
        "To find duplicate dependencies or its required dependencies, you can visualize library dependencies in tree.",
        "When using the verifyWithRecaptcha ( ) method in your app, you must do the following:",
        "In Android, you usually create a Dagger graph that lives in your application class because you want an instance of the graph to be in memory as long as the app is running.",
        "Returns the value mapped by name if it exists and is a boolean or can be coerced to a boolean, or false otherwise.",
        "Add following code in your layout file.",
        "Use EXPLAIN QUERY PLAN on your queries to see which index would be used or if the query requires a full table scan.",
        "Above mentioned class is deprecated now.",
        "In addittion, you can do in a Fragment -LRB- for example when getting server data failed -RRB-:",
        "Within this method, the PagerAdapter creates a new fragment that displays the information about the movie at the correct position in the array.",
        "Call this method, passing in the outer most ViewGroup that you want a screen shot of:",
        "So, my recommendation for anyone having these issues, is to use mapper.readTree when using native-image, pull out the bits you want from the JSON-nodes and use mapper.readValue on that, rather than relying on a large tree to object conversion.",
        "For example, you may set up separate notification channels for each conversation group created by a user in a messaging app.",
        "SolutionThe solution to open PDF is solved by the introduction of the class PdfRenderer in Android-Lollipop ( API 21 ).",
        "The ones we'll be using are doInBackground ( ) and onPostExecute, and the type we want to return is String.",
        "The OnBackPressedDispatcher controls how Back button events are dispatched to one or more OnBackPressedCallback objects.",
        "The CompletionStage API lets programmers define pipelines of asynchronous operations for data, and handles the asynchronous behaviour for you.",
        "getView -LRB- -RRB- is the main part of your adapter.",
        "Creating a Test Runner Now, you need to provide a test runner that uses PotterTestApp instead of PotterApp when running a test.",
        "PdfRenderer -- This class enables rendering a PDF document.",
        "You use them following the same basic pattern you use for other types of requests.",
        "The FragmentStatePagerAdapter will stop creating new fragments when the current index reaches the number of objects returned by getCount ( ), so you need to change the method to return a fairly large number that the users are not very likely to reach by continuously swiping in the same direction.",
        "Wiring up the ViewPager and the Adapter",
        "Next, we need to add method that would manage the deserialization of a JSON dictionary into a populated Business object:",
        "Apart from the @Inject annotation, there's another way to tell Dagger how to provide an instance of a class: the information inside Dagger modules.",
        "You now have a ViewPager that doesn't do anything particularly interesting without an Adapter that tells it what to display.",
        "Creating an Adapter for the ViewPager",
        "However, with a RecyclerView the adapter requires the existence of a `` ViewHolder'' object which describes and provides access to all the views within each item row.",
        "It fully relies on the adapter to tell it what to display and how to display it.",
        "If you forget to add this line, you will likely see an error about an injection target missing.",
        "Runtime permissions are permissions that are requested as they are needed while the app is running.",
        "Stream API can iterate over Collections in a very straightforward manner.",
        "This is a terminal operation.",
        "Calling inject ( ) will cause Dagger 2 to locate the singletons in the dependency graph to try to find a matching return type.",
        "dataSpec.position is the position within the media that the caller wants to start reading from.",
        "getView going to be called for each position every time it is displayed.",
        "If you have more complex queries that can't make use of any indexes that you might create, you can de-normalize your schema, structuring your data in such a way that the queries are simpler and can be answered using indexes.",
        "Well we can put some kind of encryption into our requests, for example using RSA we can have a private key, put it into the application, and encrypt the requests.",
        "Your new class extends FragmentStatePagerAdapter.",
        "If the permission manager is not installed, there is no reason for TSecure not to be able to access your contacts.",
        "You need to have implement a LINK and declare it in the AndroidManifest.xml.",
        "This class enables rendering a PDF document.",
        "To avoid duplicates, you can add exclude clauses in each project build.gradle file.",
        "it is very simple: `` matrix.postrotate ( rotation )''.",
        "This may boost your phone speed, but it will lead to delayed or no notifications from your apps.",
        "Because certain Android framework classes such as activities and fragments are instantiated by the system, Dagger can't create them for you.",
        "Back navigation is how users move backward through the history of screens they previously visited.",
        "The above classes should be: The @JsonTypeInfo includes a few configuration fields to indicate how Jackson should find the classes to deserialize the JSON to.",
        "Define your scopes by the semantics of using them.",
        "Every time the flow builder calls emit, it suspends until the element is completely processed.",
        "This way when the app later needs the WRITE_CONTACTS permission, Android can automatically grant this itself without prompting the user.",
        "The startActivity ( ) method starts an instance of the DisplayMessageActivity that's specified by the Intent.",
        "First, the ViewPager asks the PagerAdapter how many movies are in the array by calling getCount ( ).",
        "This is the best and most reasonable way to do this.",
        "Dependencies that you provide in Hilt modules are available in all generated components that are associated with the Android class where you install the Hilt module.",
        "Dependent components require the parent component to explicitly list out what dependencies can be injected downstream, while subcomponents do not.",
        "Leaving the base or common implementation without a qualifier is error-prone and could result in Hilt injecting the wrong dependency.",
        "You can also control concurrency, which means coordinating the execution of several coroutines declaratively with Flow.",
        "The contract class allows you to use the same constants across all the other classes in the same package.",
        "I ran into this thread while trying to solve the same problem.",
        "Grab a copy of a typical database and use the REPL to time queries.",
        "The two files are automatically merged together when activity_main.xml is loaded.",
        "This new builder must be added to the parent component graph using a `` binder'' module with a `` subcomponents'' parameter:",
        "Returns the value mapped by name if it exists and is an int or can be coerced to an int, or throws otherwise.",
        "Hilt provides a standard way to use DI in your application by providing containers for every Android class in your project and managing their lifecycles automatically.",
        "The fragments allow their parent activity to respond to intents and callbacks in most cases.",
        "The ViewModel needs to implement the callback now.",
        "For scaling, Android provides ScaleGestureDetector.",
        "inject.Scope annotation - Dependencies declared with that scope with have caching Provider with double-check lock generated and only single instance will be created for it within component declared with the same scope and its creation will be thread safe.",
        "onStart ( ) is called once the fragment is ready to be displayed on screen.",
        "The adapter's role is to convert an object at a position into a list row item to be inserted.",
        "If the device is running Android 6.0 or higher, and your app's target SDK is 23 or higher: The app has to list the permissions in the manifest, and it must request each dangerous permission it needs while the app is running.",
        "Check the user's response, whether they chose to grant or deny the runtime permission.",
        "A mock web server is a program that mocks the behavior of an actual remote server but doesn't make calls over the internet.",
        "To check if the user has already granted your app a particular permission, pass that permission into the ContextCompat.checkSelfPermission ( ) method.",
        "Use the addTrack ( ) method to mix multipe tracks together.",
        "In Android development, any time we want to show a vertical list of scrollable items we will use a ListView which has data populated using an Adapter.",
        "Another major difference is that subcomponents simply need to be declared in the parent component.",
        "After that override getView -LRB- -RRB- method and make sure to return your custom View there.",
        "Force stopping an application by the user puts the application in a stopped state and none of its code is run, including any broadcast receivers declared in manifest.",
        "PagerAdapter is an abstract class, so you will have an instance of one of its subclasses ( FragmentPagerAdapter and FragmentStatePagerAdapter ) rather than an instance of the PagerAdapter itself.",
        "Say we have a few simple observables of different types:",
        "Returns the value mapped by name if it exists, coercing it if necessary, or the empty string if no such mapping exists.",
        "1 -RRB- Add save Button in each row of RecyclerView on this Button click -LRB- onClick -RRB-",
        "I haven't tried recording phone call's but there is a option in LINK for:",
        "Below we place the toolbar at the top of a LinearLayout like the standard ActionBar:",
        "This becomes a problem specifically when seeking, because dataSpec.position will not be 0 in this case, yet your implementation will nevertheless read from the start of the media.",
        "MockWebServer makes it possible to easily test how your apps behave when making HTTP/HTTPS calls.",
        "When an app requests a permission that belongs to a particular permission group ( i.e. READ_CONTACTS ), Android asks the user about the higher level group instead ( CONTACTS ).",
        "In particular, your app should make users aware of the features that don't work because of the missing permission.",
        "One possible option is to move your generated classes into a separate module like it's LINK.",
        "First, we will create an InputStreamReader that reads our request input.",
        "You can inject the specific type that you need by annotating the field or parameter with the corresponding qualifier:",
        "Return the fragment associated with the object located at the specified position.",
        "You probably need your implementation to do something more like ( untested pseudocode ):",
        "This also continuously updates the location on the move.",
        "and then you can use the FragmentManager to create a FragmentTransaction which allows us to add fragments to the FrameLayout at runtime:",
        "The problem in the first case is that Dagger is overeager to use a single static factory instance for generating instances of scoped generic classes.",
        "A binding's scope must match the scope of the component where it is installed, so in this example you must install AnalyticsService in SingletonComponent instead of ActivityComponent:",
        "The fused location provider is one of the location APIs in Google Play services.",
        "For an asynchronous request the client and request are made in the same way, then call.",
        "You can also do it by rotating the canvas before drawing:",
        "Clicks can be handled using onClick property as usual or more typically in this case, using the onOptionsItemSelected method in the fragment:",
        "The toolbar is not given any special treatment as a view.",
        "If you have a lot of string / text type data, consider creating Virtual tables using full text search -LRB- FTS3 -RRB-, which can run faster query.",
        "Now you can fire the method NavUtils.navigateUpFromSameTask -LRB- this -RRB- ; BUT if you don't have specified the android: parentActivityName in you AndroidManifest.xml this will crash your app.",
        "In order to change preview orientation as the user re-orients the phone, within the surfaceChanged ( ) method of your preview class, first stop the preview with Camera.stopPreview ( ) change the orientation and then start the preview again with Camera.startPreview ( ).",
        "In cases where you need Hilt to provide different implementations of the same type as dependencies, you must provide Hilt with multiple bindings.",
        "You should add logic in your app to gracefully handle such an error.",
        "A qualifier is an annotation that you use to identify a specific binding for a type when that type has multiple bindings defined.",
        "Each UUID is loaded sequentially.",
        "If you have the options to left click and `` generate'' its override methods, select `` doInBackground ( )'' and `` onPostExecute''.",
        "A notification can offer up to three action buttons that allow the user to respond quickly, such as snooze a reminder or even reply to a text message.",
        "Subcomponents are components that inherit and extend the object graph of a parent component.",
        "However, in the API response, we actually get a collection of business JSON in an array.",
        "When the flow builder completes, the Flow is cancelled and collect resumes, letting and the calling coroutine prints `` flow is completed.''",
        "It should hopefully be clear that if dataSpec.position is non-zero, readPosition = mediaPosition + dataSpec.position ( correct ) is going to end up reading from a different position than readPosition = mediaPosition ( incorrect ).",
        "JsonArrayRequest -- A request for retrieving a JSONArray response body at a given URL.",
        "Even though Dagger 2 does not rely on the annotation at runtime, keeping the RetentionPolicy at RUNTIME is useful in allowing you to inspect your modules later.",
        "However, when adding another @Inject element or removing scoping it succeeds:",
        "Use android: fitsSystemWindows = `` true'' in the root view of your layout -LRB- LinearLayout in your case -RRB-.",
        "You can define any number of custom scope annotations in your application by declaring them as a public @interface:",
        "And this code snippet demonstrates the recommended process of checking for a permission, and requesting a permission from the user when necessary:",
        "Note that for every instance of component itself new instance of that dependency will be created.",
        "To display the system permissions dialog when necessary, call the launch ( ) method on the instance of ActivityResultLauncher that you saved in the previous step.",
        "Displaying ActionBar Icon In the new Android 5.0 material design guidelines, the style guidelines have changed to discourage the use of the icon in the ActionBar.",
        "In Android versions before 9.0, an app starts its own activities in lock task mode by calling Activity.startLockTask ( ).",
        "You can call KeyguardManager methods to find out if the device is locked and use an Activity lifecycle callback ( such as onResume ( ) that's called after unlocking ) to start lock task mode.",
        "layout_gravity is the way the TextView will align itself in its parent, in your case in the vertical LinearLayout",
        "To do this, we need to create our own custom ArrayAdapter class.",
        "Callbacks are added via the addCallback methods.",
        "Returns the value mapped by name if it exists and is a double or can be coerced to a double, or throws otherwise.",
        "As getView is call many times inflating a new view every time is expensive so list view provides you one of the previously created view to re-use.",
        "As promised, I'm putting an example for how to use annotations to serialize/deserialize polymorphic objects, I based this example in the Animal class from the tutorial you were reading.",
        "Returns the value mapped by name if it exists and is a boolean or can be coerced to a boolean, or throws otherwise.",
        "Unlike Dagger modules, you must annotate Hilt modules with @InstallIn to tell Hilt which Android class each module will be used or installed in.",
        "In Android 9.0 or higher when lock task mode is enabled, your DPC can enable certain system UI features on the device -- useful to developers creating a custom launcher.",
        "However, there are a few cases where your app might need to implement its own Back behavior in order to provide the best possible user experience.",
        "To do this, we might modify this code:",
        "Have you tried Jackson ?",
        "LINK allows filtering collections without writing loops or inner classes:",
        "Usage Defining a Fragment A fragment, like an activity, has an XML layout file and a Java class that represents the Fragment controller.",
        "Currently the recommended API for making screenshots is the LINK class available from API 24 -LRB- but the methods which accept Window parameter are available from API 26 == Android 8.0 Oreo -RRB-.",
        "Next, we will create a BufferedReader that will allow us to iterate through the response.",
        "Do not inset the content with any margins from the PrintAttributes as the application is responsible to render it such that the margins are respected.",
        "There, you can define dependencies with the @Provides annotation.",
        "When a list item is scrolled off the screen, RecyclerView reuses that view for the next list item about to be displayed.",
        "Well, subscribeOn ( ) on the outer stream level basically said that all events should be processed sequentially, within this stream, on a different thread.",
        "The Dagger basics page explained how Dagger can help you automate dependency injection in your app.",
        "There are a few different ways of using it, so let's look at an example.",
        "prepare the Bitmap",
        "Specifically, use the fused location provider to retrieve the device's last known location.",
        "After Marshmallow, permissions must now be requested at runtime before being used.",
        "Don't mess with the visibility flags of the container - FragmentTransaction.hide / show does that internally for you.",
        "If you do not want the size of a node to change, set the minimum, maximum, and preferred sizes to the same size.",
        "Here we caught our IOException, printed the stack trace in order to see more details if/when we have do debug, and set our result to null.",
        "You simply override the onOptionsItemSelected method in your `` child'' activity and check for the id of the back button which is android.R.id.home.",
        "LocationListener provides call back for location change through onLocationChanged.",
        "To invoke the SafetyNet reCAPTCHA API, you call the verifyWithRecaptcha ( ) method.",
        "AndroidManifest.xml Remember to give access permissions as shown below.",
        "Your implementation is currently ignoring these parameters.",
        "You will connect your Fragment instances with the ViewPager using a PagerAdapter, which is an object that sits between the ViewPager and the data set containing the information you want the ViewPager to display ( in this case the movies array ).",
        "Note that this means if you are in a RelativeLayout, you need to ensure that all other views are positioned below the toolbar explicitly.",
        "EDIT START: though generally, you don't need to instantiate your own implementations inside your modules, so you can actually just do this:",
        "In the Adding reCAPTCHA to your app section on the page that appears next, your public and private keys appear under Site key and Secret key, respectively.",
        "You can programmatically set the level of detail visible in notifications posted by your app on a secure lock screen, or even whether the notification will show on the lock screen at all.",
        "Fragments should be modular, standalone and reusable components.",
        "For example, if you added three callbacks named one, two and three in order, they would be invoked in the order of three, two, and one, respectively.",
        "Each time your app needs to access functionality that requires a permission, you should check that your app is still granted that permission.",
        "Enums are on our wishlist as well, but there are some challenges involved as one of the primary design goals of Realm is cross-platform compatibility and enums doesn't exist in Objective-C like they do in Java.",
        "If so, your app can access the private user data.",
        "Usually, you should use onKeyUp ( ) if you want to be sure that you receive only one event.",
        "However, this method only indicates that the user has solved the CAPTCHA correctly.",
        "First of all, always use HTTPS.",
        "Communicating with Fragments Fragments should generally only communicate with their direct parent activity.",
        "Checking for permissions before performing privileged actions seems fine to me.",
        "Starting with Android 8.0 ( API level 26 ) you can use a MediaMuxer to record multiple simultaneous audio and video streams.",
        "You use the site key when you send the verify request, and you use the secret key when you validate the user response token.",
        "As you can see the Settings item in the default action bar is set to never show.",
        "Use android: fillViewport = `` true'' in ScrollView",
        "Reusable annotation - Dependencies declared with that scope may be shared between different components through common parent component and will have caching Provider with single-check lock generated.",
        "It is possible that the JSONObject parser has been made more lenient in newer Android releases.",
        "Values may be any mix of JSONObjects, JSONArrays, Strings, Booleans, Integers, Longs, Doubles or NULL.",
        "We can do that using the @JsonTypeInfo and @JsonSubTypes annotations.",
        "Try adding this piece of code before loading your viewPager",
        "Fragments communicate through their parent activity allowing the activity to manage the inputs and outputs of data from that fragment coordinating with other fragments or activities.",
        "Dependency Definition and Injection When writing code that uses Dependency Injection, there are two main components to consider:",
        "Now replace the return movies.size line inside getCount ( ) with this:",
        "You have to rotate the canvas first and then draw whatever you want.",
        "For developing a customized camera feature, check out the Building a Camera App section.",
        "As this is something you might do quite often, you can also save an instance of the Handler in the same place you saved the ExecutorService:",
        "When a scale -LRB- ie, pinch -RRB- gesture is detected, then the scale factor is used to resize the ImageView.",
        "That means, that the widget will take care of asking questions, validating responses all the way till it determines that a user is actually a human, only then you get a g-recaptcha-response value.",
        "When the ViewPager needs to display a fragment, it initiates a chat with the PagerAdapter.",
        "Using api is correct here.",
        "Any standard layout that might extend beyond the bounds of its container should be nested in a ScrollView to provide a scrollable view that's managed by the framework.",
        "Using a Custom ArrayAdapter When we want to display a series of items from a list using a custom representation of the items, we need to use our own custom XML layout for each item.",
        "However for items that you would like to give the user a more direct access to you can set the showAsAction attribute.",
        "Name the scope annotations depending on the lifetime where the annotation is used.",
        "A Dagger module is a class that is annotated with @Module.",
        "Let's design the XMLNow we are done with designing let's move to the coding part it's nothing but a fragment handling all the steps discussed above",
        "We check if a View is recycled with if ( convertView == null ).",
        "First, let's take a look at our Repository class and see how it's making the network request:",
        "In rare cases, you can set the volume of an audio stream programmatically.",
        "To fix this issue, open MainActivity.kt and add the following line inside onCreate ( ) below the line where you connect the PageAdapter to the ViewPager:",
        "So ideally we also would have an easy way of processing an array of businesses into an ArrayList of Business objects.",
        "Here, http://127.0.0.1 is the local URL of your computer and 8080 is the port MockWebServer will use.",
        "Define a concrete implementation of the ContentProvider class and its required methods.",
        "It appears that Jackson attempts to substitute the null with an instance of the default class.",
        "createAsync ( ) method returns a Future.",
        "Tap on the Apply button to apply this heartbeat interval and you should start receiving notifications in time.",
        "If you don't directly own the AnalyticsService class, you can tell Hilt how to provide instances of this type by creating a function inside a Hilt module and annotating that function with @Provides.",
        "that is specified in the offsetx and offsety values.",
        "Such instructions are called bindings ...",
        "All I did was create a counter for the number of calls I'm going to do, then each async result calls ready -LRB- -RRB- -LRB- be sure to do this on the failure methods too, unless you're going to do something different -RRB-",
        "Let's create another function called makeLoginRequest ( ) that moves the execution to the background thread and ignores the response for now:",
        "I would suggest that you write your downloaded JSON out to a file and compare it with your original to see if there is a problem with the download logic.",
        "Here's how you might use it to swipe across a collection of Fragment objects:",
        "In earlier versions of Android, accepting potentially dangerous permission groups was an all-or-nothing affair.",
        "You are using the AppCompat version 21 + and it is normal.",
        "the second step is to translate the view up and left by half the width and half the height.",
        "( what I could not convert with native-image using the entire tree, yet works when you pick more specific nodes of interest )",
        "After the user responds to the system permissions dialog, the system then invokes your app's implementation of onRequestPermissionsResult ( ).",
        "This class implements SurfaceHolder.Callback in order to capture the callback events for creating and destroying the view, which are needed for assigning the camera preview input.",
        "When finished iterating through results, call close ( ) on the cursor to release its resources.",
        "In this way, an object from a subcomponent can depend on an object provided by the parent component.",
        "Internally, the ExecutorService manages the Runnable and executes it in an available thread.",
        "Now you should implement the logic for the back button.",
        "Once the test is done we shutdown the server.",
        "You can remove the if conditions because you only want to draw one icon right ?",
        "A Fragment is a combination of an XML layout file and a java class much like an Activity.",
        "Server will, in turn, use the same passcode to decrypt the data received from the client.",
        "Use:",
        "You define what you want to happen, and Java takes care of when it can happen.",
        "requestLocationUpdates ( GoogleApiClient, LocationRequest, PendingIntent ) this API is used to receive location updates in the background even when the application is not active.",
        "Now you need to add a Toolbar to your Activity layout file.",
        "Returns the value mapped by name, or null if no such mapping exists.",
        "The work is being done in a background thread, and when you need the result you can call a method on the Furture to get the result.",
        "I created a ViewPager that supports infinite looping effect, smart auto-scroll, compatible with any indicators and easy to use.",
        "In the form that appears, provide the following information: Label: A unique label for your key.",
        "The dataSpec argument is not defining the entire media.",
        "It's just a part of the storage-sample from Android docs.Our example is to render a document which is a bitmap in our case so we need an ImageView, as it displays one page at a time we need two buttons to move to next & previous pages if available.",
        "Changing the ActionBar Title The ActionBar title displayed at the top of the screen is governed by the AndroidManifest.xml file within the activity nodes.",
        "Connecting the PagerAdapter and the ViewPager",
        "Permission Groups Permission Groups avoids spamming the user with a lot of permission requests while allowing the app developer to only request the minimal amount of permissions needed at any point in time.",
        "dataSpec.length is the length of data that the caller wants to read, or C.LENGTH _ UNSET to read to the end of the media.",
        "So in a nutshell, when you run your test MockWebServer intercepts your network call providing you with the data you mock data.Why?So it comes down to this.",
        "If the holder holds the view you want, you can reuse it.",
        "Making calls to findViewById ( ) can be slow in practice, and if your adapter has to call it for each View in your row for every single row then you can often run into performance issues.",
        "Java 8 -LRB- LINK -RRB- solves this problem using streams and lambdas in one line of code:",
        "If you have multiple predicates, then the index that will be used is the one that is expected to reduce the result set the most -LRB- based on ANALYZE -RRB-.",
        "Follow these steps to add a method to the MainActivity class that's called when the Send button is tapped:",
        "Let's design the XMLNow we are done with designing let's move to the coding part it's nothing but a fragment handling all the steps discussed aboveSummaryNow that you should have a basic idea of opening the PDF documents.",
        "But the easiest option is to generate java code directly and your generated java classes will be picked up by javac automatically, launching second round of annotation processing, where dagger will process them.",
        "All Android devices provide a Back button for this type of navigation, so you should not add a Back button to your app's UI.",
        "A reference to the parent view that this view will be a child of.",
        "It is strongly recommended to use the addCallback ( ) method which takes a LifecycleOwner.",
        "If you don't declare any dangerous permissions, or if your app is installed on a device that runs Android 5.1 ( API level 22 ) or lower, the permissions are automatically granted, and you don't need to complete any of the remaining steps on this page.",
        "You don't need to use so many lists, just create a class that will contain all the data of single item, there is no need for buttons, use just text change listener instead.",
        "You set this text view a width of `` wrap_content'' it means, what ever the text is, the view take the size of the text.",
        "Add annotation to constructor @Inject",
        "Summary There are a lot of choices for HTTP clients in Java - for simple cases I would recommend the built-in java.net.http.HttpClient.",
        "To request one of the many permissions, simply specify it in the AndroidManifest.xml: For example, an application that needs to read the user's contacts would add the following to it's AndroidManifest.xml:",
        "Improving Performance with the ViewHolder Pattern To improve performance, we should modify the custom adapter by applying the ViewHolder pattern which speeds up the population of the ListView considerably by caching view lookups for smoother, faster item loading:",
        "Request the runtime permission that your app requires in order to access the private user data.",
        "Next, we will be setting our request method, read and connection timeouts.",
        "This class previews the live images from the camera.",
        "Unscoped dependency will have simple Provider generated without any caching and any instance of that dependency created in component will be new for every new injection -LRB- as in constructor, or in module provision method, or just as a field -RRB-.",
        "The following code snippet shows how to invoke this method:",
        "You can use a Handler to enqueue an action to be performed on a different thread.",
        "Modules are a way to semantically encapsulate information on how to provide objects.",
        "Constructor injection is also not possible if you don't own the class because it comes from an external library ( classes like Retrofit, OkHttpClient, or Room databases ), or if instances must be created with the builder pattern.",
        "Using the field annotation does overcome it, but may be considered a workaround.",
        "subscribeOn ( ) ( and observeOn ( ) for that matter ) barely switch execution to a different worker ( thread ) without introducing any concurrency.",
        "The simplest way to wait for them all is something like this:",
        "We can create a custom ListView of User objects by subclassing ArrayAdapter to describe how to translate the object into a view within that class and then using it like any other adapter.",
        "Every android app has its own internal storage only that app can access, you can read from there or write to it.",
        "In your case, you can add Retrofit and OkHttp dependency in app's build.gradle.",
        "If the permission you need to add isn't listed under the normal permissions, you'll need to deal with `` Runtime Permissions''.",
        "and the variables used are:",
        "In this case, you want to add a `` placeholder'' container ( usually a FrameLayout ) to your activity where the fragment is inserted at runtime:",
        "Execute gradle command as below.",
        "The FragmentManager class and the FragmentTransaction class allow you to add, remove and replace fragments in the layout of your activity at runtime.",
        "The adapter acts as the middle man between the ListView and data source, or its provider.",
        "We didn't say that there should many sub-streams running concurrently.",
        "Although the icon can be added back with:",
        "The app will not crash, since all the",
        "Get relevant subviews of the row view.",
        "The TextView being in wrap_content this does nothing, as the TextView is exactly the size of the text.",
        "Returns the value mapped by name, or throws if no such mapping exists.",
        "Returns the value mapped by name if it exists and is an int or can be coerced to an int, or 0 otherwise.",
        "I think your DataSource is implemented incorrectly.",
        "Beginning with Android 5.0, notifications can appear on the lock screen.",
        "Decide whether you trust this provider more than the one used in your app's cached location.",
        "So no need to implement your async tasks.",
        "You can define multiple bindings for the same type with qualifiers.",
        "Returns the value mapped by name if it exists and is an int or can be coerced to an int, or fallback otherwise.",
        "Flow produces values one at a time ( instead of all at once ) that can generate values from async operations like network requests, database calls, or other async code.",
        "Here's an example callback implementation:",
        "I didn't see a specific issue opened for this, but looking at the code for DrawableWrapperDonut/DrawableWrapperGingerbread, I can see that the problem was introduced around 23.4.0 and later fixed, so if you were using the buggy version, switching to a good version should fix this crash.",
        "If you would like an application icon -LRB- but I discourage it -RRB-, you can use the method setLogo -LRB- -RRB-.",
        "The system passes in the user response to the permission dialog, as well as the request code that you defined, as shown in the following code snippet:",
        "This class is not thread safe.If you want to render a PDF, you create a renderer and for every page you want to render, you open the page, render it, and close the page.",
        "If you create enough items and scroll through the list, the views will be recycled and far smoother by default than the ListView widget:",
        "Replace the code inside getItem ( position: Int ) with this line:",
        "Specify a URL and receive a raw string in response.",
        "Listening for Location Updates After you invoke `` getLastLocation'', you might want to request periodic updates from the Fused Location Provider.",
        "This tells the ViewPager to display the movie found in the middle of the array.",
        "once the bitmap is rotated, it needs to have its location translated to the place where it should display in the view.",
        "internal attribute to adjust view layout based on system windows such as the status bar.",
        "The Java controller for a fragment looks like:",
        "Since you want to offset the icon to the top right, you will need to offset the ( x, y ) position slightly, but make sure you use dp because if you simply offset the ( x, y ) by some amount it willnot translate to different devices.",
        "This is happening because FusedLocationProviderApi deprecated in a recent version of google play services.",
        "As you can read LINK:",
        "A typical use of the APIs to render a PDF looks like this:",
        "and dont forget to set scaleType property to matrix of ImageView tag like:",
        "I think the key piece of information I was missing is that the annotations are inherited by the child classes, which makes the default class apply to all of the subclasses and not just the base class.",
        "to this approach instead leveraging add, show, and hide in the FragmentTransaction:",
        "Contacts Allows apps to read, create, or edit your contact list, as well as access the list of all accounts ( e.g., Facebook, Instagram, Twitter, etc. ) used on your device.",
        "Keep a reference to the return value of registerForActivityResult ( ), which is of type ActivityResultLauncher.",
        "Merely wrapping blocking code in a Flowable doesn't magically add concurrency.",
        "Use constructor injection with @Inject to add types to the Dagger graph whenever it's possible.",
        "Validating the response is really easy.",
        "Important: Normal Permissions must be added to the AndroidManifest:",
        "Although content providers are meant to make data available to other applications, you may of course have activities in your application that allow the user to query and modify the data managed by your provider.",
        "... or by wrapping the list into an Observable < Observable < ?",
        "By default the system places menu items into the overflow area that is only revealed when the user selects the three dot icon or more generally the action overflow icon.",
        "The full implementation to our HTTP GET request is complete.Step 3: SummarizeWe've gone through and implemented, step by step, the process of creating an asynchronous HTTP GET request in Java, using Android's AsyncTask class.",
        "I am using mic to record phone audio and also use the Telephony manager to find the calling state.",
        "In the example below, the activity `` FirstActivity'' will have an ActionBar with the string value of the resource identified by @string / activity_name.",
        "The next steps will all be wrapped in this try-catch block as we will need to catch certain exceptions that may occur during the GET request.As you can see we are casting our myUrl.openConnection ( ) to a HttpURLConnection type.",
        "We have a protocol where all JSON objects contain a _ type field that indicates what the JSON represents.",
        "Respect the property whether the document would like to be scaled for printing as per shouldScaleForPrinting ( ).",
        "Depending on the window size and aspect ratio, you may may have to fit a wide camera preview into a portrait-orientated layout, or vice versa, using a letterbox layout.",
        "Alternatively, if you want to customize the details of the thread pool, you can create an instance using ThreadPoolExecutor directly.",
        "Before Marshmallow, permissions were handled at install-time and specified in the AndroidManifest.xml within the project.",
        "In you case, you first want to check if you such file exist before creating one.",
        "Use ANALYZE to allow SQLite's query planner to work more efficiently.",
        "The only real way of securing your data is by asking your user for a password, besides doing all the work I wrote about above.",
        "To register a key pair for use with the SafetyNet reCAPTCHA API, navigate to the reCAPTCHA Android signup site, then complete the following sequence of steps:",
        "Here is a LINK on how to record audio using the LINK.",
        "You can use this adapter to provide views for an AdapterView, Returns a view for each object in a collection of data objects you provide, and can be used with list-based user interface widgets such as ListView or Spinner.",
        "Understanding the FragmentManager The FragmentManager is responsible for all runtime management of fragments including adding, removing, hiding, showing, or otherwise navigating between fragments.",
        "You can provide multiple callbacks via addCallback ( ).",
        "The ViewHolder class stores each of the row's subviews, and in turn is stored inside the tag field of the layout.",
        "Accessing Google APIs To access Google APIs, we just need to perform one more step: create an instance of GoogleApiClient.",
        "It's not clear how you are actually applying the offset and length in or before FileDataSource.",
        "Only when a callback is enabled ( i.e., isEnabled ( ) returns true ) will the dispatcher call the callback's handleOnBackPressed ( ) to handle the Back button event.",
        "Once they are disabled, you would not be able to receive any updates from the installed apps unless you open them or they have a feature to automatically turn on.",
        "If it is not null then we have a recycled View and can just change its values, otherwise we need to create a new row View.",
        "Now add the following code in your PdfRenderActivity -- 7.",
        "The simplest, and best long-term solution, is to use BuildConfig.DEBUG.",
        "Applications often need to directly set the minimum, preferred, and maximum size constraints on controls.",
        "Create a Preview Class - Create a camera preview class that extends SurfaceView and implements the SurfaceHolder interface.",
        "Not sure this is very `` realm'' friendly since I'm new to Android development but I thought this worked actually pretty well.",
        "the code in onclick finds the two views in its layout and sets properties that control the amount of rotation, size of the bitmap, and x and y offsets.",
        "Nothing much happening here before starting the test we create the server and start it at port 8080.",
        "The reason why dataSpec.position needs to be included is already explained as clearly as I'm able to explain it in my response above.",
        "Must be one of the following constant values.",
        "To be able to record, your app must tell the user that it will access the device's audio input.",
        "The use of application icon plus title as a standard layout is discouraged on API 21 devices and newer.",
        "The system displays a runtime permission prompt, such as the one shown on the permissions overview page.",
        "The function makeLoginRequest ( ) should take a callback as a parameter so that it can return a value asynchronously.",
        "Users should know which actions might require them to grant permission for your app to access private user data.",
        "First function of scopes is a way to tell Dagger compiler which scopes are allowed within scoped component.",
        "Your next step is to implement the adapter methods.",
        "Here's a bit of code to get EXPLAIN QUERY PLAN results into Android logcat from a running Android app.",
        "Add this block of code inside onCreate ( ), above the line where you set viewPager.currentItem:",
        "You should also refrain from task-killing apps that promise to completely shut down the app when you close an app using them.",
        "Pin down exactly which queries you need to optimize.",
        "For good practice, I'll make these constants as well.Now that we have set our timeouts, request method, and connected ( attempted anyway ), we are going to create a Stringbuilder and InputStreamReader to read our input from the API.",
        "So you have to validate this token.",
        "Open RecipeAdapter.java and go to the getView ( ) method.",
        "The best advice that I could give you is to fetch the data beforehand.",
        "And replace the response_string with the value that you earlier got by the g-recaptcha-response field.",
        "This means that that the zip function would have to check the number of parameters and cast them accordingly.",
        "To do so, include the request code in a call to requestPermissions ( ).",
        "The ActivityResultCallback defines how your app handles the user's response to the permission request.",
        "Similar to promises in other languages, Futures are objects that will contain a result when it's ready.",
        "Instead of that you directly create the json object from string buffer.",
        "Pass in your API site key as a parameter.",
        "onCreate ( ) is called to do initial creation of the fragment.",
        "To request the last known location, call the getLastLocation ( ) method.",
        "Retrofit Changelog:",
        "You can use a class prefixed with Dagger ( i.e. DaggerTwitterApiComponent.java ) that will be responsible for instantiating an instance of our dependency graph and using it to perform the injection work for fields annotated with @Inject.",
        "Starting in Android 2.2 ( API Level 8 ), you can use the setDisplayOrientation ( ) method to set the rotation of the preview image.",
        "onCreate of the Activity, you can use do the following",
        "Here is another related diagram on view recycling:",
        "As a best practice, if you add a qualifier to a type, add qualifiers to all the possible ways to provide that dependency.",
        "While we are at it, we should also define the version of Google Play Services we are using for this application:",
        "Each group contains multiple permissions, and approving a single permission from any group automatically approves all other permissions within that same group.",
        "The constructor of the superclass requires a FragmentManager, thus your custom PagerAdapter needs it as well.",
        "Design the raw storage for your data.",
        "You might have heard about this subscribeOn ( ) operator and how it enables concurrency.",
        "Now Run your app & you will see your PDF Document will render in android app itself.Wowww ... ... ... That's it ... Thanks ....",
        "Adding camera features to your manifest causes Google Play to prevent your application from being installed to devices that do not include a camera or do not support the camera features you specify.",
        "It's common to use scroller objects in conjunction with a fling gesture, but they can be used in pretty much any context where you want the UI to display scrolling in response to a touch event.",
        "Gets a View that displays in the drop down popup the data at the specified position in the data set.",
        "That line draws a single event.",
        "Of course there are some obfuscating approaches, like ProGuard that you should use, but they wouldn't stop a determined hacker to find our private key in our code.",
        "Statically To add the fragment statically, simply embed the fragment in the activity's xml layout file:",
        "As you can see, there is nothing special for Cat and Dog, the only one that know about them is the abstract class Animal, so when deserializing, you'll target to Animal and the ObjectMapper will return the actual instance as you can see in the following test:",
        "You can go through the trouble of determining the height and width of each button and then setting the preferred size of each button to the greatest height and width of the buttons in the set.",
        "The following code sample shows a typical use, with an XML layout and code to modify the contents of the text view:",
        "This restriction is imposed because of reasons described here.",
        "If your app can not communicate with the reCAPTCHA service successfully, it may be because the API is encountering an error.",
        "-LSB- full code on GitHub -RSB- Apache provides several more examples for sync and async requests.",
        "Potentially dangerous permissions to look out for Anyone concerned about their privacy and security should keep an eye out for apps that request access to following nine permission groups.",
        "You must check whether you have that permission every time you perform an operation that requires that permission.",
        "Next, modify teardown ( ) to stop the server:",
        "Every Android app runs in a limited-access sandbox.",
        "In certain situations, the permission might be denied automatically, without the user taking any action.",
        "Dangerous permission groups, however, can give apps access to things like your calling history, private messages, location, camera, microphone, and more.",
        "In human speech it would be like,",
        "Design your app's UX so that specific actions in your app are associated with specific runtime permissions.",
        "Add other optional pieces, such as sample data or an implementation of AbstractThreadedSyncAdapter that can synchronize data between the provider and cloud-based data.",
        "Note: You'll want to add android: fitsSystemWindows = `` true'' ( learn more ) to the parent layout of the Toolbar to ensure that the height of the activity is calculated correctly.",
        "You can discover if your app is running on a fixed-volume device by calling isVolumeFixed ( ).",
        "Returns the value mapped by name if it exists, coercing it if necessary, or throws if no such mapping exists.",
        "Now you can enable the back button in the onCreate method of your `` child'' activity.",
        "reCAPTCHA is a free service that uses an advanced risk analysis engine to protect your app from spam and other abusive actions.",
        "So your code might look like this:",
        "Is it possible to render a PDF Document in android app ?",
        "However, we will need to begin by configuring the build script and adding Google Play Services as a dependency for this application.",
        "My Friend was able to get it all working, if I remember well the problematic settings were in Security > Privacy for the contacts and in battery for GCM.",
        "The user can grant or deny each permission, and the app can continue to run with limited capabilities even if the user denies a permission request.",
        "It returns View that will be displayed as your list/grid/gallary / any view that use adapter item.",
        "it is used for the Android Music Remote control even if the App is in Lock mode.",
        "Stop using battery & phone optimizing apps Most phone and battery optimizing apps close all the background processes to free up RAM and put less load on the phone.",
        "and in the LinearLayout, the default gravity -LRB- used here -RRB- is ` center'",
        "To ensure that volume controls adjust the correct stream, you should call setVolumeControlStream ( ) passing in the stream type matching your attributes that you can retrieve from AudioAttributes.getVolumeControlStream.",
        "UI controls also provide default minimum and maximum sizes that are based on the typical usage of the control.",
        "For SELECTs and UPDATEs, indexes can things up, but only if the indexes you create can actually be used by the queries that you need speeding up.",
        "Returns the value mapped by name if it exists and is a double or can be coerced to a double, or fallback otherwise.",
        "For each of the get methods, you must pass the index position of the column you desire, which you can get by calling getColumnIndex ( ) or getColumnIndexOrThrow ( ).",
        "Both methods have the same return type, but the qualifiers label them as two different bindings:",
        "Returns the value mapped by name if it exists and is a long or can be coerced to a long, or throws otherwise.",
        "Then, Hilt needs to know how to provide an instance of the type that corresponds with each qualifier.",
        "Here is full code for my CustomViewPager:",
        "After that, extend the class AsyncTask.",
        "To set this up, you'll need a mechanism to tell the app to use the real URL normally, but the mock URL when you run tests.",
        "I simply reorder the fragment list, update the viewPager and move to the new page without animation, the result is an endless loop in both directions:",
        "Then your subclasses, Dog and Cat.",
        "A camera preview class is a SurfaceView that can display the live image data coming from a camera, so users can frame and capture a picture or video.",
        "You can develop these things yourself, but if you would like to use a pre-made custom view, copy LINK into your project and use it like a normal ImageView.",
        "I'm still convinced that there are some security settings in the OS that deny the access to the contacts.",
        "After the user completes the resolution provided by `` GooglePlayServicesUtil.getErrorDialog ( )'', a callback method `` onActivityResult ( )'' is fired, so we have to implement some logic to handle that call:",
        "Within our activity, we simply need to get access to these components and call inject ( ).",
        "Instead, it should use the mock server's URL.",
        "However, in both of these cases, the zip function can only accept a single Object -LSB- -RSB- parameter since the types of the observables in the list are not known in advance as well as their number.",
        "With Dagger, you don't have to write tedious and error-prone boilerplate code.",
        "One of your classes implements a subclass ContentProvider, which is the interface between your provider and other applications.",
        "It is worth noting that apparently Dagger2 creates a single instance per scoped provider in a module per component.",
        "Returns the value mapped by name if it exists, coercing it if necessary, or fallback if no such mapping exists.",
        "When I updated your sample with these annotations, Jackson correctly deserialized each object to the expected subclass.",
        "That's all there was to it.",
        "Continuous Location Access Activity Following is the complete class which accesses the Fused Location Provider to get the location continuously in the Android example application.",
        "The following example code demonstrates how to create a basic camera preview class that can be included in a View layout.",
        "You can avoid this problem by using the View Holder Pattern.",
        "How to make a dependency injectable To make an object embeddable in Hilt, you need to tell Hilt how to instantiate that object.",
        "I am using mic to record calls for better support and compatibility.",
        "This can be done by modifying the `` build.gradle'' file as follows:",
        "First of all your Animal class with the Json Annotations for the subclasses.",
        "To report detected gesture events, gesture detectors use listener objects passed to their constructors.",
        "When you create a test with a mock server, the app shouldn't use the real URL.",
        "Initial and maximum pool size.",
        "Android uses this pattern in their Contacts-App.",
        "Skip all the expensive inflation steps and just get the holder you already made.",
        "The client code looks like this:",
        "Normal permissions are automatically granted at install time and never prompt the user asking for permission.",
        "The FragmentStatePagerAdapter makes sure to destroy all the fragments the user does not see and only keep their saved states in the FragmentManager, hence the name.",
        "To allow the system to manage the request code that's associated with a permissions request, add dependencies on the following libraries in your module's build.gradle file:",
        "I have used Volley library here.",
        "Therefore, the objects provided by the parent component to the subcomponent are still scoped to the parent component.",
        "Any time you need to display a lot of data and make it easy to navigate, you've got a job for Android's ListView, which handily creates scrollable lists.",
        "Specify a URL and get a JSON object or array ( respectively ) in response.",
        "In most of your interaction with the permission API's you'll be working with the individual permissions and not the permission groups, but pay close attention to what the API expects as both permissions and permission groups are Strings.",
        "Runtime Permissions If the permission you need to add isn't listed under the normal permissions, you'll need to deal with `` Runtime Permissions''.",
        "Output after running the Test class:",
        "-LSB- full code on GitHub -RSB- Handling Errors in CompletionStages If any exceptions are thrown in your asynchronous code, the CompletionStage API will catch them and let you handle them in a few different ways.",
        "Javac annotation processor uses rounds instead of defining processors order.",
        "Return the number of objects in the array.",
        "To read from a database, use the query ( ) method, passing it your selection criteria and desired columns.",
        "Then, when another value is requested from the flow, it resumes from where it left off until it calls emit again.",
        "Open MoviesPagerAdapter.kt and create a new constant representing the large number by adding this line at the top of the file above the class definition:",
        "If during the transmission of the data someone gets access to the transmitting data, he / she wouldn't be able to make sense of it as it is encrypted.",
        "These are called fixed-volume devices.",
        "You will define it both where you provide the singletons ( @Provides annotation ), and where you inject them ( @Inject annotations ):",
        "A DPC must allowlist apps before they can be used in lock task mode.",
        "when you press the rotate button, each of the images is rotated around its center, while maintaining its position in the center of the region on the screen.",
        "The results of the query are returned to you in a Cursor object.",
        "The following fails to build:",
        "When the app needs to use any of the protected features of the device ( sending network requests, accessing the camera, sending an SMS, etc ) it must obtain the appropriate permission from the user to do so.",
        "A good implementation that never crashes your app would be:",
        "To handle an individual key press, implement onKeyDown ( ) or onKeyUp ( ) as appropriate.",
        "-LRB- In my case it looks like the problem is too many queries rather than poor use of indexing ; but maybe this will help someone else ... -RRB-",
        "What the ViewHolder class does is cache the call to findViewById ( ).",
        "A Toolbar is a generalization of action bars for use within application layouts.",
        "It introduced the concept of runtime permissions.",
        "With that in place, we can now pass an JSONArray of business json data and process that easily into a nice ArrayList object for easy use in our application with Business.fromJson ( myJsonArray ).",
        "Ask for permissions in context, when the user starts to interact with the feature that requires it.",
        "Check out this stackoverflow for a discussion on deciding when to replace vs hide and show.",
        "Usually these are the following steps to create json object through the Http connection in android.",
        "In your activity or fragment's initialization logic, pass in an implementation of ActivityResultCallback into a call to registerForActivityResult ( )."
    ],
    "1": {
        "run_cnt": 9,
        "overall": {
            "precision": [
                0.63664249509744,
                0.6139749907860393,
                0.5502112603211115,
                0.6394440358720298,
                0.5899946275697254,
                0.625494942683189,
                0.6293576255840932,
                0.579781376988617,
                0.6459004180274975
            ],
            "recall": [
                0.6589319832633639,
                0.655814484335532,
                0.5488165805737905,
                0.6522308974172971,
                0.5937289353174838,
                0.6421418774802081,
                0.6408657318109122,
                0.5861840296415677,
                0.6595952971211443
            ],
            "fscore": [
                0.5495902303299687,
                0.5436753470670407,
                0.5093667594083506,
                0.49310940711056667,
                0.5354644863638575,
                0.5339605289919589,
                0.5437481999116391,
                0.5052539209851548,
                0.5624410625726675
            ]
        },
        "api": {
            "precision": [
                0.5687729251880195,
                0.5874601666913012,
                0.5229404610958532,
                0.5710301513022106,
                0.4800048479698445,
                0.5837587681021124,
                0.6223744240243523,
                0.5228306038083714,
                0.6118785038139878
            ],
            "recall": [
                0.6288589356771174,
                0.6707251082251083,
                0.5646289737198827,
                0.601507499234772,
                0.5041677598495781,
                0.6288800774221014,
                0.6357951812497267,
                0.5565826576225376,
                0.6876557785648695
            ],
            "fscore": [
                0.5020350913856239,
                0.5840675500864113,
                0.4911309037606915,
                0.3458817942789791,
                0.37817117942467543,
                0.4826893042969917,
                0.5221229271568778,
                0.3751465949930308,
                0.5963554929547576
            ]
        },
        "so": {
            "precision": [
                0.7096748598464846,
                0.6638791763791764,
                0.46108108108108115,
                0.7111447963800905,
                0.6364479813664596,
                0.6541774891774892,
                0.6386549707602339,
                0.5721848739495798,
                0.6503556445461479
            ],
            "recall": [
                0.7259649122807017,
                0.6859158926728586,
                0.5216124871001032,
                0.719734262125903,
                0.624187306501548,
                0.6808359133126934,
                0.6509287925696594,
                0.5996284829721362,
                0.6650954592363261
            ],
            "fscore": [
                0.6438328430378034,
                0.5694304388422035,
                0.47305405080052976,
                0.6230974907445495,
                0.5798728145239773,
                0.6003072672192815,
                0.5786258569017189,
                0.5414200831847891,
                0.5614981899192426
            ]
        },
        "git": {
            "precision": [
                0.6619047619047619,
                0.6041666666666666,
                0.8939393939393939,
                0.6269349845201238,
                0.6851851851851851,
                0.7,
                0.7040133779264214,
                0.770935960591133,
                0.7040133779264214
            ],
            "recall": [
                0.6961538461538461,
                0.6153846153846154,
                0.65,
                0.6576923076923077,
                0.6730769230769231,
                0.7461538461538462,
                0.7346153846153847,
                0.7115384615384616,
                0.7346153846153847
            ],
            "fscore": [
                0.6629787234042555,
                0.6072727272727273,
                0.6714471968709257,
                0.6148148148148148,
                0.6782522343594836,
                0.6989966555183946,
                0.712511091393079,
                0.7304812834224599,
                0.712511091393079
            ]
        },
        "misc": {
            "precision": [
                0.5743707014893455,
                0.5605856135986733,
                0.6114563137403257,
                0.5925263367123833,
                0.590831964969896,
                0.6085039121951873,
                0.5959600010694901,
                0.6046583850931676,
                0.6531259680769484
            ],
            "recall": [
                0.5648761948572195,
                0.6042114695340502,
                0.5446165367417739,
                0.5886282176604757,
                0.606076829558803,
                0.5606635616123282,
                0.5979146301726946,
                0.561460292817029,
                0.597361182987369
            ],
            "fscore": [
                0.4022781837364933,
                0.43915886435383666,
                0.5340969835815197,
                0.38312174465076687,
                0.5711479970376309,
                0.43673222269756556,
                0.4509897471891211,
                0.5433776311628278,
                0.480074743672815
            ]
        }
    },
    "2": {
        "run_cnt": 9,
        "overall": {
            "precision": [
                0.5572935801652549,
                0.46776036238283725,
                0.5668660691466717,
                0.5564789183135908,
                0.5533325719282315,
                0.5436754932218192,
                0.5573291632558414,
                0.5677501841097987,
                0.5651598475717476
            ],
            "recall": [
                0.6039510007403524,
                0.5018674144415144,
                0.5847688512103646,
                0.5892586984329183,
                0.5854765660526479,
                0.5531014886612082,
                0.5495486129333124,
                0.5961066267703033,
                0.6013513505417486
            ],
            "fscore": [
                0.49597508365535187,
                0.45797932768507005,
                0.4521777526958854,
                0.4561393374559538,
                0.5188573533410706,
                0.5137768399774577,
                0.5128225941548296,
                0.4743592331499986,
                0.5043563633994733
            ]
        },
        "api": {
            "precision": [
                0.595030157088656,
                0.4046038336663336,
                0.5831667445520585,
                0.5791132529680985,
                0.4435230708897058,
                0.5840792974370903,
                0.559541178836191,
                0.6048081241863382,
                0.5966526154919318
            ],
            "recall": [
                0.6309796891798171,
                0.4737286393096815,
                0.5795043564704689,
                0.5647942730223741,
                0.5500209713205237,
                0.5689321654475108,
                0.5554192574972626,
                0.5903375090915053,
                0.5772404598811248
            ],
            "fscore": [
                0.513553425280811,
                0.40146259662769096,
                0.39970909025874357,
                0.42795678188779956,
                0.4287406018835134,
                0.4874481549374117,
                0.4708364951926179,
                0.4884108630455285,
                0.5043453710385419
            ]
        },
        "so": {
            "precision": [
                0.5402081476530006,
                0.4766981132075472,
                0.5984026116427432,
                0.55535181941115,
                0.6702298722519311,
                0.545648690078038,
                0.6048047880768469,
                0.554389312090884,
                0.5813751352813852
            ],
            "recall": [
                0.5534426028195911,
                0.5095849802371542,
                0.6069905041935795,
                0.5473716964371789,
                0.6272683661336895,
                0.5641731280384514,
                0.5911341199450955,
                0.5537719262003462,
                0.5972434158277212
            ],
            "fscore": [
                0.5036544992363958,
                0.4466528473091364,
                0.5482659774436089,
                0.503699957543802,
                0.6000688646784185,
                0.528862617595808,
                0.5498779557589626,
                0.5076018880629118,
                0.5606212946110206
            ]
        },
        "git": {
            "precision": [
                0.4607142857142857,
                0.4393939393939394,
                0.5,
                0.5588235294117647,
                0.4166666666666667,
                0.42857142857142855,
                0.43548387096774194,
                0.4930555555555556,
                0.46703296703296704
            ],
            "recall": [
                0.4083333333333333,
                0.48333333333333334,
                0.5,
                0.6416666666666666,
                0.3333333333333333,
                0.4,
                0.45,
                0.48333333333333334,
                0.425
            ],
            "fscore": [
                0.3955555555555556,
                0.46031746031746035,
                0.414387031408308,
                0.48328267477203646,
                0.3703703703703704,
                0.4137931034482759,
                0.4426229508196722,
                0.39525691699604737,
                0.4117647058823529
            ]
        },
        "misc": {
            "precision": [
                0.5600885235265316,
                0.5168086692940517,
                0.5419695086548391,
                0.5388042074923023,
                0.5749955135524053,
                0.5327947052947053,
                0.5419481093923768,
                0.5637314553745475,
                0.5466187791756463
            ],
            "recall": [
                0.6618583018067935,
                0.521911198132105,
                0.5881568948577822,
                0.6318582467111953,
                0.6308362483173766,
                0.5621999334626132,
                0.5314934142593882,
                0.6571443400567017,
                0.6591966809498194
            ],
            "fscore": [
                0.4958527835101087,
                0.5117862703052423,
                0.4248402471049356,
                0.4352082183769822,
                0.5556789420313782,
                0.5427679132206505,
                0.530807112708324,
                0.45234426853403437,
                0.47787154382240454
            ]
        }
    },
    "3": {
        "run_cnt": 9,
        "overall": {
            "precision": [
                0.5031526577620525,
                0.5432010991607723,
                0.4974716133691686,
                0.5334917811461138,
                0.5280296037445292,
                0.49967626573061785,
                0.5253273438237338,
                0.45957398547099726,
                0.5012565206215093
            ],
            "recall": [
                0.5520684942253999,
                0.5921849428460577,
                0.5351073809416202,
                0.5811698641151115,
                0.5658207737107978,
                0.5367921301752676,
                0.5582920105860392,
                0.523522682942485,
                0.5437318470913883
            ],
            "fscore": [
                0.4402530817495247,
                0.46639071944897753,
                0.44606293449067014,
                0.48175562520545945,
                0.40576230582473327,
                0.4199879712711826,
                0.4264876470955562,
                0.4292841787194346,
                0.38724801862049296
            ]
        },
        "api": {
            "precision": [
                0.5401545891770433,
                0.5654929444896237,
                0.4858786224602635,
                0.5594427849130309,
                0.5646565781215676,
                0.5040027842144431,
                0.5637460634444852,
                0.4473421901412494,
                0.526305291930292
            ],
            "recall": [
                0.595345123893814,
                0.6135448945743587,
                0.5134054375280268,
                0.6201577707711503,
                0.5968047676903142,
                0.5229645025111738,
                0.5839897607216511,
                0.565084647404522,
                0.5740195943982551
            ],
            "fscore": [
                0.4389743390019052,
                0.45458796445015476,
                0.40227619315583096,
                0.4668475671425397,
                0.36224303156514803,
                0.38193566671523643,
                0.41219576904110156,
                0.39922448795680454,
                0.3554139445199667
            ]
        },
        "so": {
            "precision": [
                0.44421596921596923,
                0.500878680669952,
                0.46042735042735045,
                0.47925792742726386,
                0.5238555142063914,
                0.45822510822510826,
                0.48088023088023085,
                0.41510884014622795,
                0.4736526758265889
            ],
            "recall": [
                0.4401154401154401,
                0.5020159578983109,
                0.44994058229352346,
                0.46963330786860197,
                0.5159366777013835,
                0.46301247771836,
                0.479076479076479,
                0.46632289279348105,
                0.47585094643918174
            ],
            "fscore": [
                0.43841970121381885,
                0.4881919917725545,
                0.454671192351857,
                0.46474702620747244,
                0.48716524216524215,
                0.45973009676653137,
                0.47501253132832083,
                0.436307043267994,
                0.4378576378576378
            ]
        },
        "git": {
            "precision": [
                NaN,
                NaN,
                NaN,
                NaN,
                NaN,
                NaN,
                NaN,
                NaN,
                NaN
            ],
            "recall": [
                NaN,
                NaN,
                NaN,
                NaN,
                NaN,
                NaN,
                NaN,
                NaN,
                NaN
            ],
            "fscore": [
                NaN,
                NaN,
                NaN,
                NaN,
                NaN,
                NaN,
                NaN,
                NaN,
                NaN
            ]
        },
        "misc": {
            "precision": [
                0.5175538277511962,
                0.555801057213124,
                0.5499731975228602,
                0.5629405541905541,
                0.4610367892976589,
                0.5353587319243603,
                0.5185494972729016,
                0.550735294117647,
                0.49256474519632415
            ],
            "recall": [
                0.6334448160535118,
                0.6538739921560706,
                0.6492101041411752,
                0.6704988851727982,
                0.5786789297658863,
                0.6290086195176333,
                0.6032438752481171,
                0.5261984392419174,
                0.5849777034559642
            ],
            "fscore": [
                0.44556063804832274,
                0.4603264537904976,
                0.4958369984092689,
                0.5370846398282791,
                0.3706964498331405,
                0.43098225185042865,
                0.39701860026873087,
                0.47886926342185565,
                0.37500173796582803
            ]
        }
    },
    "4": {
        "run_cnt": 9,
        "overall": {
            "precision": [
                0.5710608154785174,
                0.5167777100880743,
                0.5533472400737048,
                0.5778169923490121,
                0.5212301996613136,
                0.5361007247625412,
                0.5716760528662875,
                0.6914225367566381,
                0.584408566255857
            ],
            "recall": [
                0.596953411485431,
                0.5360833295888352,
                0.5718595351491613,
                0.6081916247194428,
                0.6145708283313326,
                0.5782690293918923,
                0.604055154334059,
                0.6403706118462711,
                0.6327503695259418
            ],
            "fscore": [
                0.5078781410393979,
                0.5131261609767459,
                0.4827053460816237,
                0.5610363534538428,
                0.5418469926585548,
                0.4715187103263107,
                0.5132643137870033,
                0.5784421996128749,
                0.5204952173987262
            ]
        },
        "api": {
            "precision": [
                0.536547619047619,
                0.5526986454405809,
                0.47645502645502646,
                0.5567870826491517,
                0.4796200721303321,
                0.5301799326449947,
                0.5440476190476191,
                0.5330780699376525,
                0.4967094017094017
            ],
            "recall": [
                0.5357553366174056,
                0.5357348111658456,
                0.4585933223864258,
                0.5660132731253421,
                0.5307539682539683,
                0.5557368637110016,
                0.5394430760810072,
                0.5645970169677066,
                0.500964696223317
            ],
            "fscore": [
                0.4455618364037658,
                0.5275,
                0.39858326371484265,
                0.5128217156080933,
                0.48659405111018006,
                0.43767499263188914,
                0.3400156045504883,
                0.4759327864856321,
                0.39677637111706965
            ]
        },
        "so": {
            "precision": [
                0.6410984848484849,
                0.478030303030303,
                0.6354166666666666,
                0.5113636363636364,
                0.5113636363636364,
                0.5265151515151515,
                0.5113636363636364,
                0.74375,
                0.6916666666666667
            ],
            "recall": [
                0.6654761904761906,
                0.5654761904761905,
                0.6476190476190476,
                0.6964285714285714,
                0.6964285714285714,
                0.5738095238095238,
                0.6964285714285714,
                0.7107142857142856,
                0.7416666666666667
            ],
            "fscore": [
                0.5607142857142857,
                0.5006085192697769,
                0.5351503759398497,
                0.5631372549019608,
                0.5631372549019608,
                0.4625,
                0.5631372549019608,
                0.6028491436100132,
                0.6456876456876457
            ]
        },
        "git": {
            "precision": [
                0.519738247863248,
                0.5193452380952381,
                0.5204081632653061,
                0.6064814814814815,
                0.4974667271627344,
                0.5199448088305871,
                0.6262147335423197,
                0.816820276497696,
                0.5573412698412699
            ],
            "recall": [
                0.5339387464387464,
                0.5183404558404558,
                0.5294871794871794,
                0.5635327635327636,
                0.5138888888888888,
                0.5383903133903134,
                0.5590811965811966,
                0.5824074074074074,
                0.6159900284900284
            ],
            "fscore": [
                0.4791208791208791,
                0.5109649122807017,
                0.4755860201404756,
                0.5732028577733642,
                0.5028178243774574,
                0.48303523035230345,
                0.5740320427236315,
                0.6107120051085568,
                0.5121639809329318
            ]
        },
        "misc": {
            "precision": [
                0.6026570048309179,
                0.5172955974842768,
                0.6088709677419355,
                0.6954545454545454,
                0.6717105263157894,
                0.5994252873563218,
                0.6384803921568627,
                0.6526610644257703,
                0.5994252873563218
            ],
            "recall": [
                0.7083333333333333,
                0.5134803921568627,
                0.7316176470588236,
                0.6053921568627452,
                0.8198529411764706,
                0.7120098039215687,
                0.6384803921568627,
                0.767156862745098,
                0.7120098039215687
            ],
            "fscore": [
                0.5843529847979235,
                0.5137362637362637,
                0.5602981029810298,
                0.6289308176100629,
                0.6878306878306877,
                0.5342105263157896,
                0.6384803921568627,
                0.6701075268817204,
                0.5342105263157896
            ]
        }
    },
    "5": {
        "run_cnt": 9,
        "overall": {
            "precision": [
                0.5085528207400851,
                0.5509503638425207,
                0.5320629987817974,
                0.5367752794921279,
                0.5294239004907927,
                0.5361362252967768,
                0.553265608472815,
                0.5638400098273049,
                0.5569896276200589
            ],
            "recall": [
                0.5541134680038423,
                0.601624284744951,
                0.5778017577623621,
                0.5520857584705249,
                0.543044515675733,
                0.58194977826422,
                0.5616019715962909,
                0.61716514495298,
                0.6182524875262472
            ],
            "fscore": [
                0.4531053409300188,
                0.471348876865534,
                0.48833147719783637,
                0.491854649238368,
                0.494707116148222,
                0.45171861443295697,
                0.4966125143158561,
                0.511873692484856,
                0.46382793946350626
            ]
        },
        "api": {
            "precision": [
                0.4427540794189776,
                0.5121889684389684,
                0.48367658459304763,
                0.5369858825725531,
                0.4915097048920579,
                0.5082390389263983,
                0.5088666830018331,
                0.5554200818433491,
                0.518602582413324
            ],
            "recall": [
                0.4973086148507112,
                0.5223983042668033,
                0.45955637745442746,
                0.5649530883917369,
                0.5010481398163205,
                0.5325978188037804,
                0.5013877796480197,
                0.5943891945267316,
                0.5254740082326
            ],
            "fscore": [
                0.3500752115831903,
                0.368375417773356,
                0.3863409360819593,
                0.4497316497131768,
                0.4214357469272544,
                0.3528666478920909,
                0.4067755095885099,
                0.4728034743164476,
                0.38205654757618956
            ]
        },
        "so": {
            "precision": [
                0.5791820540513064,
                0.5720274700789407,
                0.5722700041198044,
                0.541115293142017,
                0.5635819740174752,
                0.5671062776626801,
                0.5839534733256295,
                0.5727576130439908,
                0.5857487724579632
            ],
            "recall": [
                0.6372985507920532,
                0.6695769478533229,
                0.6438142988235492,
                0.5679637578197462,
                0.589555158988585,
                0.6408409944997477,
                0.6103732862809442,
                0.654117355396365,
                0.6952287496017885
            ],
            "fscore": [
                0.5444132714585663,
                0.5238095245267498,
                0.5496980821124364,
                0.5247621036223977,
                0.5492583563725569,
                0.5109898411397887,
                0.5517971235936925,
                0.5237708843577942,
                0.5087479599130024
            ]
        },
        "git": {
            "precision": [
                NaN,
                NaN,
                NaN,
                NaN,
                NaN,
                NaN,
                NaN,
                NaN,
                NaN
            ],
            "recall": [
                NaN,
                NaN,
                NaN,
                NaN,
                NaN,
                NaN,
                NaN,
                NaN,
                NaN
            ],
            "fscore": [
                NaN,
                NaN,
                NaN,
                NaN,
                NaN,
                NaN,
                NaN,
                NaN,
                NaN
            ]
        },
        "misc": {
            "precision": [
                0.5240450785269695,
                0.5874498811998812,
                0.559097681979038,
                0.5306375894915666,
                0.5470701284531071,
                0.532039070636077,
                0.5863466644540325,
                0.5631764428503307,
                0.5826225098474107
            ],
            "recall": [
                0.5378747795414461,
                0.6430640347307014,
                0.6868606701940035,
                0.5094695428028763,
                0.5510242843576176,
                0.5692307692307693,
                0.5969305385972051,
                0.5982634649301316,
                0.6702482702482703
            ],
            "fscore": [
                0.5030783158033362,
                0.5730237784708762,
                0.5764935725048316,
                0.5181830426016472,
                0.5440910778840545,
                0.5044929342116694,
                0.5727613764909847,
                0.54810439421215,
                0.5402202320097057
            ]
        }
    },
    "6": {
        "run_cnt": 9,
        "overall": {
            "precision": [
                0.562043509190533,
                0.585652866591263,
                0.6008613955228356,
                0.5553645573416848,
                0.5340028253545857,
                0.5621453575621067,
                0.5589578590257211,
                0.5488424083022543,
                0.5663610071462872
            ],
            "recall": [
                0.6038087556378862,
                0.594383273148268,
                0.6429776680076166,
                0.591818669498424,
                0.5668868953089209,
                0.5800872823997321,
                0.5763300205725888,
                0.5795414202812363,
                0.6004235442362873
            ],
            "fscore": [
                0.45032741727198017,
                0.5157058194658944,
                0.48549894273014976,
                0.43385421822689474,
                0.5099038662523846,
                0.4538417786131948,
                0.4808738891997677,
                0.42323032439078007,
                0.46118613672927344
            ]
        },
        "api": {
            "precision": [
                0.5399374372465071,
                0.517690076439076,
                0.5376311097868313,
                0.5392047835980978,
                0.5476074235443582,
                0.486487536066269,
                0.5372739018087854,
                0.5373105473460567,
                0.5372559609118924
            ],
            "recall": [
                0.5954750426341336,
                0.5693673750491932,
                0.5870851370851371,
                0.5899563820018365,
                0.6206513183785911,
                0.44383362849271935,
                0.5862865669683851,
                0.5740563098517645,
                0.5916756854256854
            ],
            "fscore": [
                0.33186809275566487,
                0.37964248436094056,
                0.28393808950811006,
                0.32013755520765275,
                0.4491223918590421,
                0.2719260019932233,
                0.36351973930445775,
                0.31608410316850216,
                0.31303334969261415
            ]
        },
        "so": {
            "precision": [
                0.5960871998371998,
                0.5881127881127881,
                0.6117592592592592,
                0.5903906938472157,
                0.5475165982071353,
                0.5768606522476493,
                0.5274872785166903,
                0.5719572413945816,
                0.6102248677248678
            ],
            "recall": [
                0.619125939849624,
                0.5781223893065999,
                0.6234857978279031,
                0.6044381787802839,
                0.5857403926482874,
                0.5874216791979949,
                0.5528143274853801,
                0.5751148705096074,
                0.6445802005012531
            ],
            "fscore": [
                0.535114936685901,
                0.5433072085828219,
                0.565668651664148,
                0.509820443788011,
                0.5578459047522575,
                0.5075036338592194,
                0.5050613133697318,
                0.4861592011101127,
                0.5553198161187601
            ]
        },
        "git": {
            "precision": [
                0.5776077097505669,
                0.7044541107041108,
                0.6841329966329965,
                0.5792576070264673,
                0.5361918213613129,
                0.6373199588477366,
                0.6483300099700897,
                0.5579419201759627,
                0.5632294921991929
            ],
            "recall": [
                0.5782203600604565,
                0.6523186146026644,
                0.7465857710433846,
                0.5755419082056284,
                0.5554200386462339,
                0.713357290597146,
                0.5868527871842456,
                0.5485873292221223,
                0.5477083293475419
            ],
            "fscore": [
                0.4760197250803639,
                0.6248934841527435,
                0.6300839855019421,
                0.4764790764790765,
                0.5284685583291773,
                0.5800991706646802,
                0.5660424767854487,
                0.46845359948808224,
                0.4784783929520772
            ]
        },
        "misc": {
            "precision": [
                0.5319249413742613,
                0.5444491242188612,
                0.5722080793216886,
                0.5156984552714367,
                0.5110128959841361,
                0.544113654362834,
                0.5475299393664352,
                0.5271869846594204,
                0.5418390832766
            ],
            "recall": [
                0.6088448365748576,
                0.5900197954338622,
                0.6315558266472925,
                0.5900825894901935,
                0.5226548581253643,
                0.5731570206841019,
                0.5903651521760098,
                0.6058314909460171,
                0.5931447321909301
            ],
            "fscore": [
                0.42120010788281803,
                0.5013608358833137,
                0.4280186644003374,
                0.4005430755260148,
                0.4872918971424415,
                0.4285082479820286,
                0.47477878071953433,
                0.3974552153464329,
                0.4455687758281
            ]
        }
    },
    "7": {
        "run_cnt": 9,
        "overall": {
            "precision": [
                0.5955710776195127,
                0.6330791556228413,
                0.6266438490801304,
                0.6030999368892804,
                0.622358265221759,
                0.601379922203928,
                0.6142480060333176,
                0.6234775979864602,
                0.6309614707693415
            ],
            "recall": [
                0.5939901701118876,
                0.6441969517346037,
                0.6116174357512719,
                0.592695392663465,
                0.6325925188947188,
                0.5657248332017388,
                0.6047713566368063,
                0.6336163299675004,
                0.6246461032611397
            ],
            "fscore": [
                0.5369595914360585,
                0.5638222404825733,
                0.5337967114412651,
                0.4985245483372413,
                0.5349385113391423,
                0.5341158126855796,
                0.5627851097244002,
                0.5206453839266205,
                0.5630565666401747
            ]
        },
        "api": {
            "precision": [
                0.5402318814261394,
                0.5546328330139806,
                0.5427935483518372,
                0.539791679462049,
                0.5416994927440519,
                0.5278884470370692,
                0.5324059825039454,
                0.548965169201652,
                0.5346825369255992
            ],
            "recall": [
                0.5855811259725501,
                0.6779816126118251,
                0.5902828226534953,
                0.5741914539441093,
                0.6187528593699915,
                0.5292781092461463,
                0.5467800762012995,
                0.6122490857301046,
                0.55590108401084
            ],
            "fscore": [
                0.4688990028400515,
                0.49620389099220047,
                0.4481729173585156,
                0.38391843154584654,
                0.42246630687610276,
                0.47220720242033454,
                0.49315072404927,
                0.3932963459136898,
                0.4588746245674089
            ]
        },
        "so": {
            "precision": [
                0.6692162004662005,
                0.7143550893550894,
                0.7101061076604555,
                0.6880822981366459,
                0.7317330917874396,
                0.6672008547008548,
                0.7043803418803418,
                0.7216810966810967,
                0.7335858585858586
            ],
            "recall": [
                0.6050595238095238,
                0.6229166666666667,
                0.6291666666666667,
                0.61875,
                0.6708333333333334,
                0.5895833333333333,
                0.6416666666666666,
                0.6645833333333334,
                0.675
            ],
            "fscore": [
                0.5860747354497355,
                0.6073544973544973,
                0.5803216483849114,
                0.5854567706156218,
                0.6356732208320721,
                0.5694940476190475,
                0.6110524891774892,
                0.623977873977874,
                0.6395622895622896
            ]
        },
        "git": {
            "precision": [
                0.5089285714285714,
                NaN,
                NaN,
                NaN,
                0.5492424242424242,
                NaN,
                0.5916666666666667,
                NaN,
                NaN
            ],
            "recall": [
                0.5166666666666666,
                NaN,
                NaN,
                NaN,
                0.6083333333333334,
                NaN,
                0.6833333333333333,
                NaN,
                NaN
            ],
            "fscore": [
                0.4888888888888888,
                NaN,
                NaN,
                NaN,
                0.4866071428571428,
                NaN,
                0.5818181818181818,
                NaN,
                NaN
            ]
        },
        "misc": {
            "precision": [
                0.6022804774083546,
                0.6274199333760666,
                0.6274199333760666,
                0.5597517292490118,
                0.6014840775354794,
                0.6167210075437923,
                0.6089580510813387,
                0.5760954581668039,
                0.6182705628237918
            ],
            "recall": [
                0.6273313027179006,
                0.6191882001160351,
                0.6191882001160351,
                0.577594055429107,
                0.5959198018476369,
                0.5909012808497345,
                0.6076823090998349,
                0.6144168117106261,
                0.6614283482840184
            ],
            "fscore": [
                0.5988858318743036,
                0.6119944257194712,
                0.6119944257194712,
                0.55387233736327,
                0.5825791855203619,
                0.5871765633491342,
                0.5960025861215918,
                0.5686784798499751,
                0.6184090049414765
            ]
        }
    },
    "8": {
        "run_cnt": 9,
        "overall": {
            "precision": [
                0.5377374818164292,
                0.5290453992919344,
                0.5240159453140435,
                0.5249722052006274,
                0.5586424371613447,
                0.572638328193926,
                0.5590496599893928,
                0.5477142997761313,
                0.5572563967521951
            ],
            "recall": [
                0.5813236384380002,
                0.5724604123135576,
                0.5645411350863478,
                0.5687929411998561,
                0.6175726874240981,
                0.6398628330375555,
                0.6198074368200409,
                0.593460673979291,
                0.6071203461842917
            ],
            "fscore": [
                0.4824884073409196,
                0.4863958884591582,
                0.47430375647561096,
                0.45497647865709967,
                0.49076972851935574,
                0.5136195720238993,
                0.5073775915266966,
                0.5159400281795331,
                0.5122765993706146
            ]
        },
        "api": {
            "precision": [
                0.5641851204351205,
                0.5437171286425018,
                0.5452676952676953,
                0.5345694799658993,
                0.5151931401931402,
                0.5165889665889666,
                0.5511622807017544,
                0.6383458646616542,
                0.516548204048204
            ],
            "recall": [
                0.5760101010101011,
                0.563510101010101,
                0.5683080808080808,
                0.5758838383838384,
                0.5236111111111111,
                0.5305555555555556,
                0.5869949494949495,
                0.6768939393939394,
                0.5313131313131314
            ],
            "fscore": [
                0.528382990121648,
                0.5206480021421558,
                0.5281638296344179,
                0.4561014955021614,
                0.3437827362245967,
                0.41600498452072665,
                0.4779096215053273,
                0.6493216123927219,
                0.38821495666721517
            ]
        },
        "so": {
            "precision": [
                0.581759955444166,
                0.5496307319223985,
                0.57396331738437,
                0.559866384330492,
                0.5856125356125356,
                0.5945959670417874,
                0.5754475474400286,
                0.5633408919123205,
                0.5803927553927554
            ],
            "recall": [
                0.7023123522458631,
                0.646373204218949,
                0.6872812102200401,
                0.651877045826514,
                0.7085578059647207,
                0.7519634251682125,
                0.6976978768867067,
                0.6685562147663212,
                0.6892986224768141
            ],
            "fscore": [
                0.5074217413505481,
                0.47824842051854066,
                0.5086609931649281,
                0.4855722105340167,
                0.551494396282286,
                0.5659053917991116,
                0.5204826355928306,
                0.5067187412693954,
                0.5710259036104337
            ]
        },
        "git": {
            "precision": [
                0.4246031746031746,
                0.5416666666666666,
                0.4156862745098039,
                0.4416666666666667,
                0.65625,
                0.625,
                0.6135265700483092,
                0.45021645021645024,
                0.5703703703703704
            ],
            "recall": [
                0.3592592592592593,
                0.5483091787439613,
                0.34074074074074073,
                0.39629629629629626,
                0.6932367149758454,
                0.5676328502415459,
                0.6135265700483092,
                0.41481481481481486,
                0.5458937198067633
            ],
            "fscore": [
                0.36374269005847953,
                0.5393133997785161,
                0.34545454545454546,
                0.3992490613266583,
                0.6389743589743591,
                0.5656108597285067,
                0.6135265700483092,
                0.4166666666666667,
                0.5428571428571428
            ]
        },
        "misc": {
            "precision": [
                0.46590909090909094,
                0.4253246753246753,
                0.44,
                0.4844006568144499,
                0.46702317290552586,
                0.5665024630541872,
                0.47115384615384615,
                0.4170692431561997,
                0.5561497326203209
            ],
            "recall": [
                0.45104895104895104,
                0.39277389277389274,
                0.4125874125874126,
                0.47785547785547783,
                0.4568764568764569,
                0.5944055944055944,
                0.458041958041958,
                0.37995337995337997,
                0.5734265734265734
            ],
            "fscore": [
                0.43464495703301675,
                0.389416553595658,
                0.3923611111111111,
                0.41666666666666663,
                0.45436507936507936,
                0.5,
                0.4208494208494208,
                0.3761140819964349,
                0.5535714285714286
            ]
        }
    },
    "9": {
        "run_cnt": 9,
        "overall": {
            "precision": [
                0.5536099062022508,
                0.598718011094742,
                0.58930980312826,
                0.5727746145553703,
                0.5592696547796976,
                0.5493852779905988,
                0.5317321919763596,
                0.532504032287542,
                0.6078148768379378
            ],
            "recall": [
                0.589340784283585,
                0.6060188617474682,
                0.6263762827095091,
                0.5749859248576421,
                0.612461031599588,
                0.5534475701286252,
                0.5440227633204315,
                0.5893418192380618,
                0.6471323053772936
            ],
            "fscore": [
                0.5358940118090774,
                0.5584049308152107,
                0.5199515265704362,
                0.5382797642200695,
                0.5396026208097907,
                0.40108715069580647,
                0.4470454407969428,
                0.5120974698411054,
                0.5716788527217689
            ]
        },
        "api": {
            "precision": [
                0.4751722888349206,
                0.5454594267416433,
                0.5972958406276341,
                0.57953189499484,
                0.5811854035359469,
                0.47428570224732625,
                0.4905753968253968,
                0.5416758192638758,
                0.5555311605516524
            ],
            "recall": [
                0.52475,
                0.5820439560439561,
                0.6384285714285713,
                0.5705137362637362,
                0.639271978021978,
                0.48182692307692304,
                0.48586538461538464,
                0.5689697802197802,
                0.6000576923076923
            ],
            "fscore": [
                0.46841060895542425,
                0.5182109859219833,
                0.41946701339764925,
                0.5743421255387396,
                0.5489989177489177,
                0.2500844605674438,
                0.3562029937933553,
                0.5088961167921391,
                0.447605779926414
            ]
        },
        "so": {
            "precision": [
                0.5634897360703812,
                0.6442191321223579,
                0.6206536519036518,
                0.540625588179936,
                0.524308044009131,
                0.6230355020796197,
                0.5718247002545782,
                0.49533357750995133,
                0.6798217498875393
            ],
            "recall": [
                0.5859472049689441,
                0.6370988612836439,
                0.6145186335403727,
                0.5747670807453417,
                0.6070393374741201,
                0.5977096273291925,
                0.5841356107660456,
                0.5609472049689441,
                0.6992753623188406
            ],
            "fscore": [
                0.5235355370773671,
                0.5678589114533643,
                0.5472229951137746,
                0.4869351984212284,
                0.5239030736952732,
                0.45414060025340514,
                0.483074876146564,
                0.47288995726495725,
                0.6419387692253545
            ]
        },
        "git": {
            "precision": [
                0.6113013698630136,
                0.5802631578947368,
                0.5597072419106317,
                0.47435897435897434,
                0.5802631578947368,
                0.5357142857142857,
                0.5253048780487805,
                0.474025974025974,
                0.6080316742081449
            ],
            "recall": [
                0.711038961038961,
                0.599025974025974,
                0.7516233766233766,
                0.4805194805194805,
                0.599025974025974,
                0.6623376623376623,
                0.6347402597402597,
                0.474025974025974,
                0.810064935064935
            ],
            "fscore": [
                0.64,
                0.5882352941176471,
                0.5418552036199096,
                0.47741935483870973,
                0.5882352941176471,
                0.31176470588235294,
                0.4071648690292758,
                0.474025974025974,
                0.6385395537525356
            ]
        },
        "misc": {
            "precision": [
                0.573498056736043,
                0.5797071903599881,
                0.5520615001673642,
                0.6439403428284346,
                0.5842768022646071,
                0.5058083604595232,
                0.5078558156819026,
                0.5954428000939629,
                0.5465892578392566
            ],
            "recall": [
                0.5963600206403711,
                0.5828930954087399,
                0.5924025911510267,
                0.6097479908493676,
                0.6062943453431563,
                0.505881894492658,
                0.4990713870563683,
                0.6792212793464358,
                0.5546804282724183
            ],
            "fscore": [
                0.5626589172901522,
                0.5626521321256784,
                0.5432780182780182,
                0.6029844141998643,
                0.5380602612337773,
                0.46079182630906773,
                0.4728613489223954,
                0.5791988872469909,
                0.5384274455703028
            ]
        }
    }
}