{
    "0": {
        "run_cnt": 1,
        "overall": {
            "precision": [
                0.5340317625936459
            ],
            "recall": [
                0.5765000616063527
            ],
            "fscore": [
                0.5413142368529384
            ]
        },
        "api": {
            "precision": [
                0.4350791052918712
            ],
            "recall": [
                0.46045422410745845
            ],
            "fscore": [
                0.4468041066401722
            ]
        },
        "so": {
            "precision": [
                0.5565359477124183
            ],
            "recall": [
                0.6117753623188406
            ],
            "fscore": [
                0.567171999161313
            ]
        },
        "git": {
            "precision": [
                0.5091346153846155
            ],
            "recall": [
                0.5748106060606061
            ],
            "fscore": [
                0.507537483702738
            ]
        },
        "misc": {
            "precision": [
                0.6241252894262928
            ],
            "recall": [
                0.641322403582262
            ],
            "fscore": [
                0.6308144767533432
            ]
        }
    },
    "venn_diagram_set": [
        "Hi you do it by using this approach, all fragments will remain in the container once added initially and then we are simply revealing the desired fragment and hiding the others within the container.",
        "Grab a copy of a typical database and use the REPL to time queries.",
        "After Marshmallow, permissions must now be requested at runtime before being used.",
        "Define your scopes by the semantics of using them.",
        "These permissions will show a dialog to the user, similar to the following one:",
        "The SafetyNet service includes a reCAPTCHA API that you can use to protect your app from malicious traffic.",
        "You also can not constructor-inject a type that you do not own, such as a class from an external library.",
        "If we define a defaultImpl class as a catch-all for unknown types, deserialization fails for any protocol objects that contain other protocol objects if the reference to those objects is null.",
        "Consider the following below: If you have a JSON object for `` Vehicle'', it could be a `` Car'' or `` Plane'', each with its own fields, some unique to the other.",
        "LocationListener provides call back for location change through onLocationChanged.",
        "render the page on the prepared bitmap",
        "The problem in the first case is that Dagger is overeager to use a single static factory instance for generating instances of scoped generic classes.",
        "In MainActivity, add the EXTRA_MESSAGE constant and the sendMessage ( ) code, as shown:",
        "with some custome code which simply draws a drawable icon.",
        "When the reCAPTCHA API executes the onSuccess ( ) method, the user has successfully completed the CAPTCHA challenge.",
        "Make a Snackbar to display a message.",
        "When a scale -LRB- ie, pinch -RRB- gesture is detected, then the scale factor is used to resize the ImageView.",
        "Before using the reCAPTCHA API, you need to add the SafetyNet API to your project.",
        "This bug incorrectly sets the drawable bounds to 0 -LRB- or negative in the case of an inset drawable -RRB-.",
        "The use of application icon plus title as a standard layout is discouraged on API 21 devices and newer.",
        "You set this text view a width of `` wrap_content'' it means, what ever the text is, the view take the size of the text.",
        "I am using mic to record calls for better support and compatibility.",
        "For scaling, Android provides ScaleGestureDetector.",
        "Next, you'll need to initiate the permission request and handle the result.",
        "Classes that have dependencies that you intend to inject.",
        "While developing for a target platform of 2.3.3 using Eclipse on Ubuntu, I had permission failures in the log file that indicated I needed this exact line while working on something similar.",
        "A notification can offer up to three action buttons that allow the user to respond quickly, such as snooze a reminder or even reply to a text message.",
        "For an asynchronous request the client and request are made in the same way, then call.",
        "get a seekable file descriptor from your pdf document:",
        "Once your ListView has reached the max amount of rows it can display on a screen, Android is smart enough to begin recycling those row Views.",
        "Client will use this passcode to encrypt user's email ID and send to the server.",
        "Since the version of Retrofit 2.6.0, you can get the annotations in OkHttp Interceptor using the tag field like this:",
        "The TextView being in wrap_content this does nothing, as the TextView is exactly the size of the text.",
        "The cool thing about the new Google Recaptcha is that the validation is now completely encapsulated in the widget.",
        "A Rectangle object's width and height are public fields.",
        "The constructors that create a Rectangle, and the methods that can modify one, do not prevent setting a negative value for width or height.",
        "Now Android allows you to decide which permissions to accept on a case-by-case basis -- after the app is installed.",
        "Note that in the zip function, the parameters have concrete types that correspond to the types of the observables being zipped.",
        "Each time your app needs to access functionality that requires a permission, you should check that your app is still granted that permission.",
        "The proposed solutions are correct but to achieve the result you need to set the initial value of your viewpager to Integer.MAX _ VALUE/2.",
        "You use them following the same basic pattern you use for other types of requests.",
        "-LSB- full code on GitHub -RSB- Handling Errors in CompletionStages If any exceptions are thrown in your asynchronous code, the CompletionStage API will catch them and let you handle them in a few different ways.",
        "You can call KeyguardManager methods to find out if the device is locked and use an Activity lifecycle callback ( such as onResume ( ) that's called after unlocking ) to start lock task mode.",
        "An example of polymorphic deserialization is if you want your JSON object to deserialize into a java subclass.",
        "One thing that I ran across when I applied this approach to my production code is that you still need to keep the @JsonSubtypes annotation as part of the Base class.",
        "However, with a RecyclerView the adapter requires the existence of a `` ViewHolder'' object which describes and provides access to all the views within each item row.",
        "To request one of the many permissions, simply specify it in the AndroidManifest.xml: For example, an application that needs to read the user's contacts would add the following to it's AndroidManifest.xml:",
        "EDIT START: though generally, you don't need to instantiate your own implementations inside your modules, so you can actually just do this:",
        "This class is not thread safe.If you want to render a PDF, you create a renderer and for every page you want to render, you open the page, render it, and close the page.",
        "If the permission manager is not installed, there is no reason for TSecure not to be able to access your contacts.",
        "A Toolbar is a generalization of action bars for use within application layouts.",
        "Introducing the ViewPager Adding a ViewPager to the UI will allow the users to move forward or backward through the movies by swiping across the screen.",
        "Enums are on our wishlist as well, but there are some challenges involved as one of the primary design goals of Realm is cross-platform compatibility and enums doesn't exist in Objective-C like they do in Java.",
        "Try adding this piece of code before loading your viewPager",
        "Normally, the Android OS prohibits apps from accessing each other's files -LRB- i.e. databases, preference files, regular files stored in the app's private directory -RRB- through proven Linux file permissions.",
        "To ensure that volume controls adjust the correct stream, you should call setVolumeControlStream ( ) passing in the stream type matching your attributes that you can retrieve from AudioAttributes.getVolumeControlStream.",
        "These permission can then be allowed or denied by the user.",
        "that is done because rotation is around the top left point ( the origin ) of the view.",
        "When using the verifyWithRecaptcha ( ) method in your app, you must do the following:",
        "Checking for permissions before performing privileged actions seems fine to me.",
        "the code in onclick finds the two views in its layout and sets properties that control the amount of rotation, size of the bitmap, and x and y offsets.",
        "Fragment Hiding vs Replace In many of the examples above, we call transaction.replace ( ... ) to load a dynamic fragment which first removes the existing fragment from the activity invoking onStop and onDestroy for that fragment before adding the new fragment to the container.",
        "3 - Create the tvContent view",
        "Your example code prints the correct type value strings, but the deserialized object types are all instances of the Default class.",
        "Stream API can iterate over Collections in a very straightforward manner.",
        "We can create a custom ListView of User objects by subclassing ArrayAdapter to describe how to translate the object into a view within that class and then using it like any other adapter.",
        "I simply reorder the fragment list, update the viewPager and move to the new page without animation, the result is an endless loop in both directions:",
        "And replace the response_string with the value that you earlier got by the g-recaptcha-response field.",
        "In essence, because Hilt aggregates your modules into your root app Gradle project where Dagger generates the component implementation and because such code generated references all of your binding types in other modules, then the root app Gradle project must have visibility in its classpath to all of those other Gradle modules where you define Dagger modules along with its dependencies if they are used in those Dagger modules.",
        "Beginning in Android 6.0 -LRB- API level 23 -RRB-, users grant permissions to apps while the app is running, not when they install the app.",
        "I am using mic to record phone audio and also use the Telephony manager to find the calling state.",
        "You must check whether you have that permission every time you perform an operation that requires that permission.",
        "Basically you need to load a bitmap and pass to each event you want to draw.",
        "Calling inject ( ) will cause Dagger 2 to locate the singletons in the dependency graph to try to find a matching return type.",
        "For SELECTs and UPDATEs, indexes can things up, but only if the indexes you create can actually be used by the queries that you need speeding up.",
        "You will define it both where you provide the singletons ( @Provides annotation ), and where you inject them ( @Inject annotations ):",
        "Subcomponents are components that inherit and extend the object graph of a parent component.",
        "When your ListView is connected to an adapter, the adapter will instantiate rows until the ListView has been fully populated with enough items to fill the full height of the screen.",
        "One possible option is to move your generated classes into a separate module like it's LINK.",
        "Set the view Marker in the chart",
        "When I updated your sample with these annotations, Jackson correctly deserialized each object to the expected subclass.",
        "The parent waits for each child callback to complete, then fires off it's own handleSuccess -LRB- -RRB-.",
        "That means, that the widget will take care of asking questions, validating responses all the way till it determines that a user is actually a human, only then you get a g-recaptcha-response value.",
        "As you can see, there is nothing special for Cat and Dog, the only one that know about them is the abstract class Animal, so when deserializing, you'll target to Animal and the ObjectMapper will return the actual instance as you can see in the following test:",
        "once the bitmap is rotated, it needs to have its location translated to the place where it should display in the view.",
        "You can either rotate your bitmap when you draw it by using a matrix:",
        "In the Adding reCAPTCHA to your app section on the page that appears next, your public and private keys appear under Site key and Secret key, respectively.",
        "In rare cases, you can set the volume of an audio stream programmatically.",
        "The only real way of securing your data is by asking your user for a password, besides doing all the work I wrote about above.",
        "Tap on the Apply button to apply this heartbeat interval and you should start receiving notifications in time.",
        "Check permissions before calling Contacts.getAll ( )",
        "To avoid duplicates, you can add exclude clauses in each project build.gradle file.",
        "This becomes a problem specifically when seeking, because dataSpec.position will not be 0 in this case, yet your implementation will nevertheless read from the start of the media.",
        "Keep in mind that your targetSdkVersion must be > = 23 and your emulator / device must be running Marshmallow to see the new permissions model.",
        "The command result will show you human-readable tree hierarchy of all dependencies as below.",
        "Pin down exactly which queries you need to optimize.",
        "JsonArrayRequest -- A request for retrieving a JSONArray response body at a given URL.",
        "During deserialization, you would want Jackson to deserialize the `` Vehicle'' JSON object to the appropriate `` Car'' or `` Plane'' class.",
        "If you do not want the size of a node to change, set the minimum, maximum, and preferred sizes to the same size.",
        "If you have more complex queries that can't make use of any indexes that you might create, you can de-normalize your schema, structuring your data in such a way that the queries are simpler and can be answered using indexes.",
        "Is it possible to render a PDF Document in android app ?",
        "This is happening because FusedLocationProviderApi deprecated in a recent version of google play services.",
        "If you would like an application icon -LRB- but I discourage it -RRB-, you can use the method setLogo -LRB- -RRB-.",
        "To find duplicate dependencies or its required dependencies, you can visualize library dependencies in tree.",
        "With this method in place, we could take a single business JSON dictionary such as:",
        "In the end, I found out that the issue seemed to be data classes that have non-primitive members, e.g. a data class containing a List or another data class.",
        "Defining the Adapter Next, we need to define the adapter to describe the process of converting the Java object to a View ( in the getView method ).",
        "The above classes should be: The @JsonTypeInfo includes a few configuration fields to indicate how Jackson should find the classes to deserialize the JSON to.",
        "Note: Please, set HttpClient of your code -LRB- e.g. AsyncHttpClient -RRB- with that number port for testing purpose.",
        "requestLocationUpdates ( GoogleApiClient, LocationRequest, PendingIntent ) this API is used to receive location updates in the background even when the application is not active.",
        "layout_gravity is the way the TextView will align itself in its parent, in your case in the vertical LinearLayout",
        "Check the Accept the reCAPTCHA Terms of Service checkbox, then click Register.",
        "The easiest way to simulate network issues with MockWebServer is by setting the SocketPolicy to SocketPolicy.DISCONNECT _ AT_START, SocketPolicy.NO _ RESPONSE or etc:",
        "Try to check below FragmentPagerAdapter to get endless viewpager adapter:",
        "Every android app has its own internal storage only that app can access, you can read from there or write to it.",
        "If you are using this class to rasterize a PDF for printing or show a print preview, it is recommended that you respect the following contract in order to provide a consistent user experience when seeing a preview and printing, i.e. the user sees a preview that is the same as the printout.",
        "In addittion, you can do in a Fragment -LRB- for example when getting server data failed -RRB-:",
        "At that time, your app can request the runtime permission that's required for accessing that data.",
        "You can programmatically set the level of detail visible in notifications posted by your app on a secure lock screen, or even whether the notification will show on the lock screen at all.",
        "You can use a class prefixed with Dagger ( i.e. DaggerTwitterApiComponent.java ) that will be responsible for instantiating an instance of our dependency graph and using it to perform the injection work for fields annotated with @Inject.",
        "The reason why dataSpec.position needs to be included is already explained as clearly as I'm able to explain it in my response above.",
        "This class enables rendering a PDF document.",
        "I'm still convinced that there are some security settings in the OS that deny the access to the contacts.",
        "You will get a JSON Response with a success field.",
        "Then inside of the interceptor, you can verify if the request is annotated or no.",
        "So in a nutshell, when you run your test MockWebServer intercepts your network call providing you with the data you mock data.Why?So it comes down to this.",
        "You have to rotate the canvas first and then draw whatever you want.",
        "create the PdfRenderer",
        "Here, http://127.0.0.1 is the local URL of your computer and 8080 is the port MockWebServer will use.",
        "To be able to record, your app must tell the user that it will access the device's audio input.",
        "Afterwards, refer to Kirill's answer ; essentially a `` scope'' by itself only determines that it is a different scope from the other one.",
        "If you are using Android Studio, or if you are using Gradle from the command line, you can add your own stuff to BuildConfig or otherwise tweak the debug and release build types to help distinguish these situations at runtime.",
        "Normal permissions are automatically granted at install time and never prompt the user asking for permission.",
        "Specify a URL and get a JSON object or array ( respectively ) in response.",
        "Here is a LINK on how to record audio using the LINK.",
        "Android-Lollipop -LRB- api 21 -RRB- introduce a new API: LINK",
        "Now you should implement the logic for the back button.",
        "Using both WHERE predicates and ORDER BY both require an index and SQLite can only use one, so that can be a point where performance suffers.",
        "If the user granted the permission to your app, you can access the private user data.",
        "The SQLiteOpenHelper class contains a useful set of APIs for managing your database.",
        "Every application on Android runs in a secure sandbox environment, so other processes on the system can not access your code or private data without proper handshake.",
        "to this approach instead leveraging add, show, and hide in the FragmentTransaction:",
        "Every adapter has three primary methods: onCreateViewHolder to inflate the item layout and create the holder, onBindViewHolder to set the view attributes based on the data and getItemCount to determine the number of items.",
        "The user can grant or deny each permission, and the app can continue to run with limited capabilities even if the user denies a permission request.",
        "This means that that the zip function would have to check the number of parameters and cast them accordingly.",
        "Specifically, use the fused location provider to retrieve the device's last known location.",
        "Follow these steps to add a method to the MainActivity class that's called when the Send button is tapped:",
        "Make sure you have the icon set in the manifest.xml file, in the application tag as:",
        "A Rectangle whose width or height is exactly zero has location along those axes with zero dimension, but is otherwise considered empty.",
        "The function makeLoginRequest ( ) should take a callback as a parameter so that it can return a value asynchronously.",
        "when you press the rotate button, each of the images is rotated around its center, while maintaining its position in the center of the region on the screen.",
        "you should try this:",
        "The results of the query are returned to you in a Cursor object.",
        "Beginning with Android 5.0, notifications can appear on the lock screen.",
        "This tells the API to provide updates every 20 seconds ( preferably ), but if there is a change available within a 5 second period, it should provide that too.",
        "createAsync ( ) method returns a Future.",
        "Don't mess with the visibility flags of the container - FragmentTransaction.hide / show does that internally for you.",
        "It can perform different logic depending on the result:",
        "PdfRenderer -- This class enables rendering a PDF document.",
        "Accessing Google APIs To access Google APIs, we just need to perform one more step: create an instance of GoogleApiClient.",
        "You will connect your Fragment instances with the ViewPager using a PagerAdapter, which is an object that sits between the ViewPager and the data set containing the information you want the ViewPager to display ( in this case the movies array ).",
        "getLastLocation ( GoogleApiClient ) this API should be used when there is no need for continuous access to location from an application.",
        "We have a protocol where all JSON objects contain a _ type field that indicates what the JSON represents.",
        "If your expected response is one of these types, you probably don't have to implement a custom request.",
        "To invoke the SafetyNet reCAPTCHA API, you call the verifyWithRecaptcha ( ) method.",
        "In the example below, the activity `` FirstActivity'' will have an ActionBar with the string value of the resource identified by @string / activity_name.",
        "and in the LinearLayout, the default gravity -LRB- used here -RRB- is ` center'",
        "All I did was create a counter for the number of calls I'm going to do, then each async result calls ready -LRB- -RRB- -LRB- be sure to do this on the failure methods too, unless you're going to do something different -RRB-",
        "This may boost your phone speed, but it will lead to delayed or no notifications from your apps.",
        "You can limit the size of the scaling with something like",
        "So the first thing you should do its to create your custom adapter.",
        "First of all, always use HTTPS.",
        "To request the last known location, call the getLastLocation ( ) method.",
        "After the user completes the resolution provided by `` GooglePlayServicesUtil.getErrorDialog ( )'', a callback method `` onActivityResult ( )'' is fired, so we have to implement some logic to handle that call:",
        "This is a boolean value that will be true for a debug build, false otherwise:",
        "Applications often need to directly set the minimum, preferred, and maximum size constraints on controls.",
        "So normally the simplified algorithm is like that:",
        "This method returns either PERMISSION_GRANTED or PERMISSION_DENIED, depending on whether your app has the permission.",
        "The fused location provider is one of the location APIs in Google Play services.",
        "Although content providers are meant to make data available to other applications, you may of course have activities in your application that allow the user to query and modify the data managed by your provider.",
        "The startActivity ( ) method starts an instance of the DisplayMessageActivity that's specified by the Intent.",
        "gravity is the way the text will align itself in the TextView.",
        "Dependency Definition and Injection When writing code that uses Dependency Injection, there are two main components to consider:",
        "In you case, you first want to check if you such file exist before creating one.",
        "I don't know if it's useful, but you can simulate a timeout with MockWebServer:",
        "So ideally we also would have an easy way of processing an array of businesses into an ArrayList of Business objects.",
        "If the permission you need to add isn't listed under the normal permissions, you'll need to deal with `` Runtime Permissions''.",
        "In your activity's onCreate ( ) method, create an instance of the Fused Location Provider Client as the following code snippet shows.",
        "Starting with Android 8.0 ( API level 26 ) you can use a MediaMuxer to record multiple simultaneous audio and video streams.",
        "Anyone with HTTP POST knowledge could put random data inside of the g-recaptcha-response form field, and foll your site to make it think that this field was provided by the google widget.",
        "Use EXPLAIN QUERY PLAN on your queries to see which index would be used or if the query requires a full table scan.",
        "When an app requests a permission that belongs to a particular permission group ( i.e. READ_CONTACTS ), Android asks the user about the higher level group instead ( CONTACTS ).",
        "Specify a URL and receive a raw string in response.",
        "Listening for Location Updates After you invoke `` getLastLocation'', you might want to request periodic updates from the Fused Location Provider.",
        "When we want to transfer some sensitive data to server ( at runtime ), we generate a passcode ( aka secret key ) using a symmetric encryption ( say AES ).",
        "The ArrayAdapter fits in between an ArrayList ( data source ) and the ListView ( visual representation ) and configures two aspects:",
        "Volley provides the following classes for JSON requests:",
        "Some devices ( like Chromebooks ) have volume controls but do not allow apps to use the AudioManager methods described above to change the level of an audio stream.",
        "The ViewPager usually displays the `` pages'' using fragment instances, but it can also work with simple views such as ImageView if you want to display static content.",
        "To handle an individual key press, implement onKeyDown ( ) or onKeyUp ( ) as appropriate.",
        "To add an action button, pass a PendingIntent to the addAction ( ) method.",
        "I haven't tried recording phone call's but there is a option in LINK for:",
        "As a best practice, if you add a qualifier to a type, add qualifiers to all the possible ways to provide that dependency.",
        "it is used for the Android Music Remote control even if the App is in Lock mode.",
        "A typical use of the APIs to render a PDF looks like this:",
        "If the device is running Android 6.0 or higher, and your app's target SDK is 23 or higher: The app has to list the permissions in the manifest, and it must request each dangerous permission it needs while the app is running.",
        "However, in both of these cases, the zip function can only accept a single Object -LSB- -RSB- parameter since the types of the observables in the list are not known in advance as well as their number.",
        "We instantiate a new LocationRequest object.",
        "This line means: add a meta-property on serialization or read a meta-property on deserialization -LRB- include = JsonTypeInfo.As.PROPERTY -RRB- called'' @class'' -LRB- property ='' @class'' -RRB- that holds the fully-qualified Java class name -LRB- use = JsonTypeInfo.Id.CLASS -RRB-.",
        "Let's create a Java class that will act as the Business model in our application:",
        "If you want to render a PDF, you create a renderer and for every page you want to render, you open the page, render it, and close the page.",
        "When the app needs to use any of the protected features of the device ( sending network requests, accessing the camera, sending an SMS, etc ) it must obtain the appropriate permission from the user to do so.",
        "But these action buttons should not duplicate the action performed when the user taps the notification.",
        "If the user presses and holds the button, then onKeyDown ( ) is called multiple times.",
        "If your app can not communicate with the reCAPTCHA service successfully, it may be because the API is encountering an error.",
        "An adapter loads the information to be displayed from a data source, such as an array or database query, and creates a view for each item.",
        "Unscoped dependency will have simple Provider generated without any caching and any instance of that dependency created in component will be new for every new injection -LRB- as in constructor, or in module provision method, or just as a field -RRB-.",
        "I created a ViewPager that supports infinite looping effect, smart auto-scroll, compatible with any indicators and easy to use.",
        "I would suggest that you write your downloaded JSON out to a file and compare it with your original to see if there is a problem with the download logic.",
        "GoogleApiClient FusedLocationProviderApi requires the GoogleApiClient instance to get the Location and it can be obtained as below.",
        "The ActionBar by default now has just the title for the current activity.",
        "The simplest, and best long-term solution, is to use BuildConfig.DEBUG.",
        "requestLocationUpdates ( GoogleApiClient, LocationRequest, LocationListener ) this API should be used when there a need for continuous location updates and the location is accessed when the application is active in foreground.",
        "99 % of the time, not working properly == not used properly.",
        "dataSpec.position is the position within the media that the caller wants to start reading from.",
        "You can also do it by rotating the canvas before drawing:",
        "It appears that Jackson attempts to substitute the null with an instance of the default class.",
        "So in order to get a scoped provider in a module, you need to specify the scope for your module's provider method.",
        "The full implementation to our HTTP GET request is complete.Step 3: SummarizeWe've gone through and implemented, step by step, the process of creating an asynchronous HTTP GET request in Java, using Android's AsyncTask class.",
        "Next, we need to add method that would manage the deserialization of a JSON dictionary into a populated Business object:",
        "Swipe views allow you to navigate between sibling screens, such as tabs, with a horizontal finger gesture, or swipe.",
        "Google Location Services API Google Location Services API, also known as FusedLocationProviderApi, is Google's recommended way of getting a user's location.",
        "If your app needs to use resources or information outside of its own sandbox, you can declare a permission and set up a permission request that provides this access.",
        "Currently the recommended API for making screenshots is the LINK class available from API 24 -LRB- but the methods which accept Window parameter are available from API 26 == Android 8.0 Oreo -RRB-."
    ],
    "1": {
        "run_cnt": 1,
        "overall": {
            "precision": [
                0.6173364242043363
            ],
            "recall": [
                0.6553599598907633
            ],
            "fscore": [
                0.6010912760508862
            ]
        },
        "api": {
            "precision": [
                0.6048473154952357
            ],
            "recall": [
                0.6961283070845679
            ],
            "fscore": [
                0.623413526901899
            ]
        },
        "so": {
            "precision": [
                0.6507738095238096
            ],
            "recall": [
                0.674891640866873
            ],
            "fscore": [
                0.6107503607503608
            ]
        },
        "git": {
            "precision": [
                0.7230769230769231
            ],
            "recall": [
                0.7230769230769231
            ],
            "fscore": [
                0.7230769230769231
            ]
        },
        "misc": {
            "precision": [
                0.5430127606598195
            ],
            "recall": [
                0.5458770409434547
            ],
            "fscore": [
                0.5145679180750661
            ]
        }
    },
    "2": {
        "run_cnt": 1,
        "overall": {
            "precision": [
                0.5658537870843856
            ],
            "recall": [
                0.5579935906010826
            ],
            "fscore": [
                0.5286376213394536
            ]
        },
        "api": {
            "precision": [
                0.598273462277473
            ],
            "recall": [
                0.5453497757925507
            ],
            "fscore": [
                0.5136103865072319
            ]
        },
        "so": {
            "precision": [
                0.5437569953985822
            ],
            "recall": [
                0.5688618115712495
            ],
            "fscore": [
                0.5363726551226551
            ]
        },
        "git": {
            "precision": [
                0.5583333333333333
            ],
            "recall": [
                0.6166666666666667
            ],
            "fscore": [
                0.5502645502645502
            ]
        },
        "misc": {
            "precision": [
                0.5590995710287688
            ],
            "recall": [
                0.5476794504586575
            ],
            "fscore": [
                0.5301459963936506
            ]
        }
    },
    "3": {
        "run_cnt": 1,
        "overall": {
            "precision": [
                0.4889803258969797
            ],
            "recall": [
                0.5069215845002295
            ],
            "fscore": [
                0.4950217546720815
            ]
        },
        "api": {
            "precision": [
                0.5392185934592815
            ],
            "recall": [
                0.5549245276864043
            ],
            "fscore": [
                0.5455407664485217
            ]
        },
        "so": {
            "precision": [
                0.43852813852813854
            ],
            "recall": [
                0.44783974195738896
            ],
            "fscore": [
                0.44269655378959216
            ]
        },
        "git": {
            "precision": [
                NaN
            ],
            "recall": [
                NaN
            ],
            "fscore": [
                NaN
            ]
        },
        "misc": {
            "precision": [
                0.47244815651608496
            ],
            "recall": [
                0.5019995027948368
            ],
            "fscore": [
                0.47998827318598364
            ]
        }
    },
    "4": {
        "run_cnt": 1,
        "overall": {
            "precision": [
                0.5584356120070406
            ],
            "recall": [
                0.5942161022970934
            ],
            "fscore": [
                0.5507946565696137
            ]
        },
        "api": {
            "precision": [
                0.5631555944055944
            ],
            "recall": [
                0.5944957580733443
            ],
            "fscore": [
                0.5715939347518295
            ]
        },
        "so": {
            "precision": [
                0.5333333333333333
            ],
            "recall": [
                0.5916666666666667
            ],
            "fscore": [
                0.48740842490842495
            ]
        },
        "git": {
            "precision": [
                0.5284438775510205
            ],
            "recall": [
                0.548005698005698
            ],
            "fscore": [
                0.5326678272222827
            ]
        },
        "misc": {
            "precision": [
                0.6591836734693878
            ],
            "recall": [
                0.6911764705882353
            ],
            "fscore": [
                0.6722222222222223
            ]
        }
    },
    "5": {
        "run_cnt": 1,
        "overall": {
            "precision": [
                0.5011148608584134
            ],
            "recall": [
                0.521120267241656
            ],
            "fscore": [
                0.49196757495395443
            ]
        },
        "api": {
            "precision": [
                0.43782752684407095
            ],
            "recall": [
                0.4902234724825182
            ],
            "fscore": [
                0.43452203749760676
            ]
        },
        "so": {
            "precision": [
                0.5446656210693643
            ],
            "recall": [
                0.5432947878695614
            ],
            "fscore": [
                0.5396591294496823
            ]
        },
        "git": {
            "precision": [
                NaN
            ],
            "recall": [
                NaN
            ],
            "fscore": [
                NaN
            ]
        },
        "misc": {
            "precision": [
                0.5274302925962685
            ],
            "recall": [
                0.5327499660832994
            ],
            "fscore": [
                0.5049728855681141
            ]
        }
    },
    "6": {
        "run_cnt": 1,
        "overall": {
            "precision": [
                0.5542535129691479
            ],
            "recall": [
                0.5265515962578383
            ],
            "fscore": [
                0.5080542223868743
            ]
        },
        "api": {
            "precision": [
                0.49360562479067
            ],
            "recall": [
                0.5094852748261839
            ],
            "fscore": [
                0.49922014298198
            ]
        },
        "so": {
            "precision": [
                0.5823574356735107
            ],
            "recall": [
                0.5380743525480367
            ],
            "fscore": [
                0.5007370287712709
            ]
        },
        "git": {
            "precision": [
                0.611126893939394
            ],
            "recall": [
                0.5540258087968012
            ],
            "fscore": [
                0.5406173543906686
            ]
        },
        "misc": {
            "precision": [
                0.5219544899948685
            ],
            "recall": [
                0.5043422325646088
            ],
            "fscore": [
                0.49940392495720315
            ]
        }
    },
    "7": {
        "run_cnt": 1,
        "overall": {
            "precision": [
                0.6256837988544603
            ],
            "recall": [
                0.568044728889668
            ],
            "fscore": [
                0.5668253995666612
            ]
        },
        "api": {
            "precision": [
                0.5190084372149589
            ],
            "recall": [
                0.506949361832328
            ],
            "fscore": [
                0.5119469121951084
            ]
        },
        "so": {
            "precision": [
                0.6900946275946276
            ],
            "recall": [
                0.6
            ],
            "fscore": [
                0.5812156593406593
            ]
        },
        "git": {
            "precision": [
                NaN
            ],
            "recall": [
                NaN
            ],
            "fscore": [
                NaN
            ]
        },
        "misc": {
            "precision": [
                0.7102128646531285
            ],
            "recall": [
                0.6263249207836836
            ],
            "fscore": [
                0.647801854761771
            ]
        }
    },
    "8": {
        "run_cnt": 1,
        "overall": {
            "precision": [
                0.5252927111648041
            ],
            "recall": [
                0.5302438821200384
            ],
            "fscore": [
                0.5162958827124263
            ]
        },
        "api": {
            "precision": [
                0.54
            ],
            "recall": [
                0.5181818181818182
            ],
            "fscore": [
                0.5077369439071566
            ]
        },
        "so": {
            "precision": [
                0.5319708715057553
            ],
            "recall": [
                0.5575019321694853
            ],
            "fscore": [
                0.5325012800819252
            ]
        },
        "git": {
            "precision": [
                0.5136363636363637
            ],
            "recall": [
                0.5144927536231884
            ],
            "fscore": [
                0.5134502923976607
            ]
        },
        "misc": {
            "precision": [
                0.48750000000000004
            ],
            "recall": [
                0.4883449883449883
            ],
            "fscore": [
                0.4876431585292345
            ]
        }
    },
    "9": {
        "run_cnt": 1,
        "overall": {
            "precision": [
                0.5581937725889251
            ],
            "recall": [
                0.5692615832070803
            ],
            "fscore": [
                0.5498385847272298
            ]
        },
        "api": {
            "precision": [
                0.5200564971751412
            ],
            "recall": [
                0.5117472527472527
            ],
            "fscore": [
                0.5105072463768117
            ]
        },
        "so": {
            "precision": [
                0.6236600221483942
            ],
            "recall": [
                0.6589932712215321
            ],
            "fscore": [
                0.6153362284124252
            ]
        },
        "git": {
            "precision": [
                0.5288732394366197
            ],
            "recall": [
                0.5665584415584415
            ],
            "fscore": [
                0.5308880308880309
            ]
        },
        "misc": {
            "precision": [
                0.5061038011695906
            ],
            "recall": [
                0.48886326671057584
            ],
            "fscore": [
                0.49504613666031405
            ]
        }
    }
}