{
    "0": {
        "run_cnt": 1,
        "overall": {
            "precision": [
                0.525884075246105
            ],
            "recall": [
                0.5217298230535302
            ],
            "fscore": [
                0.5161521055934581
            ]
        },
        "api": {
            "precision": [
                0.49635752804548555
            ],
            "recall": [
                0.49608214779211596
            ],
            "fscore": [
                0.4826957120190203
            ]
        },
        "so": {
            "precision": [
                0.5832491582491582
            ],
            "recall": [
                0.6020531400966184
            ],
            "fscore": [
                0.5816293904045761
            ]
        },
        "git": {
            "precision": [
                0.49120879120879124
            ],
            "recall": [
                0.46875
            ],
            "fscore": [
                0.47777777777777775
            ]
        },
        "misc": {
            "precision": [
                0.5040382819794584
            ],
            "recall": [
                0.47987234580384225
            ],
            "fscore": [
                0.4897668997668998
            ]
        }
    },
    "venn_diagram_set": [
        "",
        "Beginning in Android 6.0 -LRB- API level 23 -RRB-, users grant permissions to apps while the app is running, not when they install the app.",
        "Check that your settings match these:",
        "Nov 1 2017 · Article ( 20 mins ) · Beginner",
        "Instead, provide Hilt with the binding information by creating an abstract function annotated with @Binds inside a Hilt module.",
        "That line controls where it's drawn.",
        "An example of polymorphic deserialization is if you want your JSON object to deserialize into a java subclass.",
        "Running this code produces the exception",
        "Here is a LINK on how to record audio using the LINK.",
        "The user can grant or deny each permission, and the app can continue to run with limited capabilities even if the user denies a permission request.",
        "With this approach you can easily access data as needed from within any event handlers.",
        "When a event arrives that specific state is changed, and we check if all the states are as desired.",
        "I'm writing some computation heave code in Kotlin with JavaRx Observables and RxKotlin.",
        ">>:",
        "You can find the latest version of Dagger in this GitHub project.",
        "In the meantime, you can inform the user that they must complete the CAPTCHA to continue using your app.",
        "Most camera features are activated and controlled using a Camera.Parameters object.",
        "LINK: LINK",
        "This is why forEach is slower than the C style.",
        "How to Stop Endless Buffering Now",
        "This is powerful, but can be easily misused.",
        "To learn more about Hilt component scopes, see Scoping in Android and Hilt.",
        "The Hilt module AnalyticsModule is annotated with @InstallIn ( ActivityComponent:: class ) because you want Hilt to inject that dependency into ExampleActivity.",
        "Returns the API response in a JsonObject.",
        "In this example we also have a private static class called ViewHolder.",
        "getView going to be called for each position every time it is displayed.",
        "Tag - Lookup a fragment by calling findFragmentByTag on the FragmentManager",
        "the zip is attached at the bottom of that page.",
        "In the meantime I think that you will need to annotate your child classes with @JsonTypeInfo and @JsonSubTypes to override the inherited annotations.",
        "Is fused API will give me exact result or exact location because some time GPS is switching the location ?",
        "ConnectException - mockwebserver can throw a timeout exception.",
        "You'll have to add 8 more items to the JSON file.",
        "These are some of the data storage technologies that are available in Android:",
        "To register a key pair for use with the SafetyNet reCAPTCHA API, navigate to the reCAPTCHA Android signup site, then complete the following sequence of steps:",
        "We're thrilled to announce the latest edition of SwiftUI by Tutorials -- completely reorganized, with new apps and new chapters to help you build your best UI ever !",
        "One advantage of this approach is that the graph is available to other Android framework classes.",
        "Using the Google Play services location APIs, your app can request the last known location of the user's device.",
        "This is how you can use it in your activity:",
        "try this its good way.",
        "As you guys can see that onAudioDeviceUpdate method is called and now DeviceId is changed to VOICE_RECOGNITION ( 6 ).",
        "Both the Activity and View class implement the KeyEvent.Callback interface, so you should generally override the callback methods in your extension of these classes as appropriate.",
        "float rotation = 30.0 f ;",
        "It especially uses it as banners of application with a simple item page.",
        "If the app requires a more complex translation between item and View then we need to create a custom ArrayAdapter instead.",
        "and successfully create a Business with Business.fromJson ( json ).",
        "Solved my location awareness application problem.DerekI know, right.",
        "Notifications remain visible until one of the following happens:",
        "gravity is the way the text will align itself in the TextView.",
        "EDIT END",
        "Before you declare and request runtime permissions in your app, evaluate whether your app needs to do so.",
        "setStreamVolume ( ) setStreamVolume ( )",
        "Uses classes from the java.json package.",
        "Most devices have a built-in speaker, headphone jacks for wired headsets, and many also feature Bluetooth connectivity and support for A2DP audio.",
        "So, in addition to being cautious about the apps you install from Google Play, it's also important to know which permissions those apps request from you.",
        "Malicious apps can use these privileges against you, but they're also important for legitimate apps.",
        "Register the receiver when you begin playback, and unregister it when you stop.",
        "let me know if it helps",
        "You will get a JSON Response with a success field.",
        "For finer control over network requests and caching, you could have a look at: LINK",
        "Opinions expressed by DZone contributors are their own.",
        "Instead of that you directly create the json object from string buffer.",
        "set android: layout_width = `` fill_parent'' for textView1",
        "To respond to modifier key events such as when a key is combined with Shift or Control, you can query the KeyEvent that's passed to the callback method.",
        "Offset and length audio files specified, unable to seek after playback · Issue # 8387 · google/ExoPlayer · GitHub",
        "Also, the text in the system permission dialog references the permission group associated with the permission that you requested.",
        "Snackbars can be swiped off screen.",
        "On the other hand, if your application is about sharing user location with his friend, you maybe just need to request the location once in a while.",
        "If you have a lot of string / text type data, consider creating Virtual tables using full text search -LRB- FTS3 -RRB-, which can run faster query.",
        "Support Report platform bug Report documentation bug Google Play support Join research studies",
        "After the user responds to the system permissions dialog, the system then invokes your app's implementation of onRequestPermissionsResult ( ).",
        "off course it is a little tedious to write raw query.",
        "Check whether your app should show a rationale to the user, explaining why your app needs the user to grant a particular runtime permission.",
        "4.",
        "The docs are here: LINK",
        "It Also uses MediaPlayer to play the audio back.",
        "A practical guide to using Hilt with Kotlin",
        "Note that these bindings correspond to the general activity and fragment types and not to any specific subclass.",
        "If not you should instantiate a new one.",
        "The solution from Illegal Argument is based on the value of the android: debuggable flag in the manifest.",
        "You can follow this link to get the Step By Step Code and also given Output Screenshot.",
        "For information on how to implement your own custom request, see Implementing a Custom Request.",
        "An app in lock task mode can start new activities as long as the activity doesn't start a new task -- except tasks that launch an allowlisted app.",
        "This rationale should clearly explain what data your app is trying to access, and what benefits the app can provide to the user if they grant the runtime permission.",
        "in main method --",
        "First of all, always use HTTPS.",
        "JsonObjectRequest and JsonArrayRequest ( both subclasses of JsonRequest ).",
        "For parent components, you would need to expose to the downstream component by specifying the type and a method:",
        "Well, you won't actually write your own adapter, per se ; you'll simply extend a regular adapter and make some tweaks.",
        "You are using the AppCompat version 21 + and it is normal.",
        "Also you can check the package name in your native code and a lot of other things.",
        "Keep alive time and time unit.",
        "Media is contained in a file, so dataSpec in FileDataSource specifies offset and length.",
        "To achieve this in a grid, define each column using the ColumnConstraints class and set the horizontal alignment constraint.",
        "Step 1: This code should be in Manifest.xml",
        "You will define it both where you provide the singletons ( @Provides annotation ), and where you inject them ( @Inject annotations ):",
        "Which can be saved to the gallery or whatsoever usage is necessary their after",
        "For example, this snippet fetches a JSON feed and displays it as text in the UI:",
        "Hello Steven the debug log trace tells you that you need ... requires android.permission.READ _ CONTACTS",
        "I dropped this into my ContentProvider.query -LRB- -RRB- and now I can see exactly how all the queries are getting performed.",
        "Just make a GET Request to",
        "If the device is running Android 6.0 or higher, and your app's target SDK is 23 or higher: The app has to list the permissions in the manifest, and it must request each dangerous permission it needs while the app is running.",
        "Classes that Hilt injects can have other base classes that also use injection.",
        "Beginning with Android 5.0, notifications can briefly appear in a floating window called a heads-up notification.",
        "These are permissions that are requested while the app is running ( instead of before the app is installed ).",
        "position:",
        "The InteractiveChart sample supports both scrolling ( panning ) and scaling with multiple fingers, using the ScaleGestureDetector `` span'' ( getCurrentSpanX/Y ) and `` focus'' ( getFocusX/Y ) features:",
        "The problem in the first case is that Dagger is overeager to use a single static factory instance for generating instances of scoped generic classes.",
        "This, and other information about the app, is stored in a Context object instance that you can pass into an ItemAdapter instance.",
        "Because we are extending the default Application class with the class MyApp, we have to specify MyApp as the application name in the AndroidManifest.xml in order for it to be instantiated.",
        "New SwiftUI by Tutorials, Third Edition -- Fully Updated with New Chapters !",
        "Yes, you will have no problems using:",
        "Unless your JSON structure is complicated, you won't have to deal with deserializing your JSON into a polymorphic data type.An example of polymorphic deserialization is if you want your JSON object to deserialize into a java subclass.",
        "This means you can immediately access the row's subviews without the need to look them up repeatedly.",
        "Unscoped - when no annotation declared.",
        "Similar to how private/public variables are managed, using a parent component allows more explicit control and better encapsulation, but using subcomponents makes dependency injection easier to manage at the expense of less encapsulation.",
        "For example, consider a provider that offers photo images as files in.",
        "Encodes this object as a compact JSON string, such as:",
        "And overrides getCount for you.",
        "ACCESS_COARSE_LOCATION permission is for approximate location access using cell towers and Wi-Fi.",
        "Setup Listeners for Capture - Connect listeners for your interface controls to start image or video capture in response to user actions, such as pressing a button.",
        "If the file is from an untrusted source it is recommended to run the renderer in a separate, isolated process with minimal permissions to limit the impact of security exploits.",
        "enjoy.",
        "( For example, if you allow an app to see who's calling you, you'll allow it to make phone calls, too. )",
        "It also has the option to make requests synchronously or asynchronously by using the CompletableFuture API.",
        "I wondered if it was because you had extracted the data classes out into their own files, rather than inside of the GreetingResource.kt file itself, so I tested with my previous 1.1.1.",
        "Make sure to add the following line - Happy case testingThat is all !",
        "This is necessary to hide direct reply UI and confirm to the user that their reply was received and processed correctly.",
        "I/AAudioStream: AudioStream:: open ( ) device = 7, perfMode = 12, callback: ON with frames = 0",
        "99 % of the time, not working properly == not used properly.",
        "Now, LoginActivity should get injections from LoginComponent because it has a login-specific configuration.",
        "In the file app > java > com.example.myfirstapp > MainActivity, add the following sendMessage ( ) method stub: Kotlin Java You might see an error because Android Studio can not resolve the View class used as the method argument.",
        "My Model Class:",
        "Now add the following property to your ViewPager to align it below the RecyclerTabLayout:",
        "Use getType ( ) to retrieve a mandatory value.",
        "and check this line without **",
        "basically I used a private string property taken as a string to construct a computed property with that enum correspondance.",
        "As long as the audio source options work, you should be good to go.",
        "Set the audio source using setAudioSource ( ).",
        "Note that the pages are rendered one by one, i.e. you can have only a single page opened at any given time.Concept: PdfRenderer will convert your PDF page into image and you can show it on ImageView.Let's learn how to use PdfRenderer library: Create a simple android project named as PdfRenderName your Activity as PdfRenderActivity ( The activity where we want to render a PDF Document ) Create a assets folder ( res → New → Folder → Assets Folder ) and put your PDF Document inside it.If you want to use FloatingActionButton for navigating through multiple pages of PDF Document then you have to add design library in build.gradle ( Module: app ) file .5.",
        "Let's tweak the network request handler in our activity:",
        "To check whether auto-reset functionality is disabled for your app, call isAutoRevokeWhitelisted ( ).",
        "@Reusable generic class fails to build",
        "With that in place, we can now pass an JSONArray of business json data and process that easily into a nice ArrayList object for easy use in our application with Business.fromJson ( myJsonArray ).",
        "There is an implicit order in which your objects are often created.",
        "Gets the number of pages in the document.",
        "For messages and calls, users can also choose to filter based on who the sender or caller is ( figure 13 ).",
        "Let's break down the parts of the graph:",
        "For example, it's useful in multi module projects - when one Gradle module defines one scope with its Dagger modules and another Gradle module defines another scope, while both of them can be used as single aliased scope in some third Gradle module that defines Dagger component.",
        "it is used for the Android Music Remote control even if the App is in Lock mode.",
        "The text was updated successfully, but these errors were encountered:",
        "This code put at head section on call get_action -LRB- this -RRB- method form button:",
        "and after finishing recording you can easily also stop the recording",
        "But I dont understand what difference they made ?",
        "If you specify null, like in this code sample, the framework does not insert a row when there are no values.",
        "If you need to share state between threads, you must be careful to manage access from threads using synchronization mechanisms such as locks.",
        "In fact components can declare many scopes -LRB- e.g. @ActivityScope and @UiScope -RRB- and Dagger will treat both of them as single scope - it's called scope aliasing.",
        "Such instructions are called bindings ...",
        "How to Use Jackson to Deserialize Json Fields into Polymorphic TypesDavid TruongJan 9, 2019 · 2 min read",
        "Now add the following at the top of the class to declare a RecyclerTabLayout instance:",
        "Jump to SectionTable of ContentsRow View RecyclingUsing a Basic ArrayAdapterUsing a Custom ArrayAdapterDefining the ModelCreating the View TemplateDefining the AdapterAttaching the Adapter to a ListViewPopulating Data into ListViewConstructing Models from External SourceAttaching Event Handlers Within AdapterImproving Performance with the ViewHolder PatternBeyond ViewHoldersReferencesUsing an ArrayAdapter with ListViewEdit PagePage HistoryIn Android development, any time we want to show a vertical list of scrollable items we will use a ListView which has data populated using an Adapter.",
        "For more information, you can see the tutorial at LINK",
        "Use IMarker Interface -LRB- MarkerView has been deprecated since release 3.0.0 -RRB-",
        "Fixing delayed notifications for a particular app If the notifications are being delayed for a particular app and not all of the apps, then there are multiple ways to fix it.",
        "Described in a simple and straight way.Yusuf MuftiI want to create a service that handle update location from some activities, I have problem related code below, that I could not put paramter mContext in addConnectionCallbacks ( )",
        "Detect and Access Camera - Create code to check for the existence of cameras and request access.",
        "As for storing data in the app what you can encrypt the data before storing or you can use another format other than SQLite for better security as you can view sqlite databases using the browser pretty easily.",
        "Dagger needs to satisfy all the dependencies that LoginActivity requires ( LoginViewModel with its own dependencies ).",
        "VISIBILITY_SECRET doesn't show any part of this notification on the lock screen.",
        "On client side, to generate secret key at runtime, encrypt sensitive string using secret key, and encrypt secret key using public key, this class will help you: 3.",
        "onPageScrollStateChanged Listener",
        "@massivemadness, in Hilt 2.31.x-alpha we added an experimental flag to be able to use Hilt in a layered multi-module project.",
        "Optimizing Performance Whenever you scroll the ListView, its adapter's getView ( ) method is called in order to create a row and display it on screen.",
        "get the LINK to render",
        "Simply call addToBackstack on each FragmentTransaction that should be recorded:",
        "More than just text ?",
        "Blocking the UI thread would mean the application would freeze and become unresponsive.",
        "getView -LRB- -RRB- is the main part of your adapter.",
        "Kotlin",
        "I have a good news and a bad news, good news is that pictures/names/numbers aren't flickering anymore since the latest update 2.18.2.",
        "you should try this:",
        "handle ( ) returns a CompletableFuture so you can continue chaining or.",
        "setPriority ( ) method added which tells the system how `` interruptive'' this notification should be ( e.g. setting it to high makes the notification appear as a heads-up notification ).",
        "Thank You Very Much !!",
        "You can also do it by rotating the canvas before drawing:",
        "The first step when adding a `` Runtime Permission'' is to add it to the AndroidManifest:",
        "I have a couple of queries.",
        "reference LINK",
        "For the previous method, LoginRetrofitService can be provided with no dependencies because the method has no parameters.",
        "Here you can find a nice way of creating dot indicators.",
        "onCreate of the Activity, you can use do the following",
        "Your technique of overriding the annotations in each of the child classes makes sense now that I understand that.",
        "Each callback in the chain is invoked only if the preceding callback was not enabled.",
        "Is the following any use to you ?",
        "An input queue that holds Runnable tasks.",
        "My Adapter code:",
        "Note that, run gradlew in Windows as below.",
        "The naive approach to this ( without any view caching ) looks like the following:",
        "It uses a custom CallAdapter to get annotation @Authenticated, and put data into a map, which later parsed in the Interceptor.",
        "The size of each tile is the size needed to hold the preferred size of the largest node in the tile pane.",
        "You can fulfill many use cases in your app, such as taking photos, pausing media playback, and displaying relevant ads, without needing to declare any permissions.",
        "You also need to provide the list of movies as a parameter.",
        "I think your DataSource is implemented incorrectly.",
        "When it opens, type a message in the text field and tap Send to see the message appear in the second activity.",
        "Return to the activity_main.xml file to call the method from the button: Select the button in the Layout Editor.",
        "For SELECTs and UPDATEs, indexes can things up, but only if the indexes you create can actually be used by the queries that you need speeding up.",
        "Each Hilt component is responsible for injecting its bindings into the corresponding Android class.",
        "The order of the keys is undefined.",
        "Recently, notifications on my Android phone were being delayed by up to 15 minutes, and sometimes didn't even reach me until I open the app.",
        "You are mistaking gravity and layout_gravity.",
        "You can run code in the main thread by using this Looper to create a Handler.",
        "LINK",
        "In above example, last line com.android.support: support-annotations presents overriden from 22.1.1 to 22.2.0 internally.",
        "Don't Let Your Old Social Media Accounts Come Back to Haunt You",
        "Have you checked RemoteControlClient ?",
        "There are several types of scopes supported:",
        "This new major version reflects the fact that the library no longer supports Java 7.",
        "The dependencies of a @Provides method are the parameters of that method.",
        "Sets the Drawable corresponding to the text cursor.",
        "get a seekable file descriptor from your pdf document:",
        "If the user denies or revokes a permission that a feature needs, gracefully degrade your app so that the user can continue using your app, possibly by disabling the feature that requires the permission.",
        "Only one index will be used on any given query.",
        "1.",
        "and in the LinearLayout, the default gravity -LRB- used here -RRB- is ` center'",
        "The app gets the corresponding row from the Cursor backing the ListView, gets the _ ID value for this row, appends it to the content URI, and sends the access request to the provider.",
        "The user can progressively expand the notification group and each notification within it for more details.",
        "The Drawable defaults to the value of the textCursorDrawable attribute.",
        "If the downstream modules will be performing the injection, they should also be removed from the upstream components too:",
        "If you to get started quickly, check out our guide on managing runtime permissions with PermissionsDispatcher.",
        "If, however, you'd like to intercept or directly handle the keyboard input yourself, you can do so by implementing callback methods from the KeyEvent.Callback interface, such as onKeyDown ( ) and onKeyMultiple ( ).",
        "Don't mess with the visibility flags of the container - FragmentTransaction.hide / show does that internally for you.",
        "We use intent ( android support library ) in Android & open a PDF Viewer of Android.",
        "Fragments are standalone components that can contain views, events and logic.",
        "Reference: LINK",
        "Dagger annotation processor will process the TypeElement annotated with @dagger.",
        "EDIT START: though generally, you don't need to instantiate your own implementations inside your modules, so you can actually just do this:",
        "For example, using the same list across different data sources within an app.",
        "Introducing the ViewPager Adding a ViewPager to the UI will allow the users to move forward or backward through the movies by swiping across the screen.",
        "Here is complete demo code to understand client side and server side process.",
        "This implements the getItemId ( ) method that defines a unique ID for each row in the list.",
        "So lets implement this IOException and handle it nicely.",
        "Its a widely reported defect.",
        "LINK - Takes a screenshot of the specified display and returns it via an AccessibilityService.ScreenshotResult.",
        "Then invent a IPredicate interface, create an anonymous implementation of that interface and do something like:",
        "When the reCAPTCHA API executes the onSuccess ( ) method, the user has successfully completed the CAPTCHA challenge.",
        "so just try something by editing the Manifest.xml like adding another permission, let see if its not correctly readed.",
        "TabLayout - Tabs at the top",
        "The following code snippet illustrates the request and a simple handling of the response:",
        "I had the same error and traced it to a bug with DrawableCompat.wrap -LRB- -RRB- in 23.4.0 that doesn't exist in earlier & later versions of the support library.",
        "You have given your TextView width wrap_content, and that is the problem, Check below code and replace it to your code.",
        "It sounds like you may be using the support library ?",
        "I hope this will help you.",
        "So let me do it for you: the correct hierarchy as suggested by google blogspot it is working fine for me: Check this out",
        "I am passionate about creating good mobile experiences and sharing my learnings with ... Author",
        "One thing that I ran across when I applied this approach to my production code is that you still need to keep the @JsonSubtypes annotation as part of the Base class.",
        "I need to do a little more testing.",
        "If you are targeting devices with earlier versions of Android, use Environment.getExternalStorageDirectory ( ) instead.",
        "This ensures that the OnBackPressedCallback is only added when the LifecycleOwner is Lifecycle.State.STARTED.",
        "Java is a registered trademark of Oracle and/or its affiliates.",
        "In activity add this and try",
        "@ 2-4601 The only manager that I have allow me to specify if an app can send push notification to the notifications bar ( options = Not authorized/Authorized/Notify ) also if an app is authorized to startup with android and if an app is allowed l working when the screen is locked ( for battery saving ).",
        "I think the key piece of information I was missing is that the annotations are inherited by the child classes, which makes the default class apply to all of the subclasses and not just the base class.",
        "You use them following the same basic pattern you use for other types of requests.",
        "When I open textsecure in the main screen, it displays the number/contacts names just like a flash, every second it displays numbers or contacts names.",
        "Anyway try this -LRB- I suspect your download method is buggy -RRB-:",
        "It should be a few lines of code to achieve what you want.",
        "This is what happens here: in this example, we have 4 fragments A-B-C-D if the user is on fragment A -LRB- first -RRB-, the new List will become: D-A-B-C -LSB- remove the last and push as first -RSB- I update the ViewPager and move -LRB- without animation -RRB- again to fragment A so index 1.",
        "If you use an ordering predicate -LRB- <, < =, > etc -RRB- then that needs to be in the last used column of the index.",
        "To request one of the many permissions, simply specify it in the AndroidManifest.xml: For example, an application that needs to read the user's contacts would add the following to it's AndroidManifest.xml:",
        "Your app always have access to read/write to these directories, so there is no need to permissions to request it:",
        "If you're building with Twilio and Java let me know about it.",
        "You could perhaps only do this when you're doing intensive operations that you can recover from manually.",
        "Example: LINK.",
        "It also helps simplify refactoring, since you can focus on what modules to build rather than focusing on the order in which they need to be created.",
        "To access an entry point, use the appropriate static method from EntryPointAccessors.",
        "Even if it this is an old question.",
        "For an app developer, permissions were very simple.",
        "raywenderlich.com Weekly The raywenderlich.com newsletter is the easiest way to stay up-to-date on everything you need to know as a mobile developer.",
        "Sets the Resources.Theme against which drop-down views are inflated.",
        "Rendering a PDF Document in Android Activity/Fragment ( Using PdfRenderer ) Chahat JainJun 26, 2018 · 4 min readWhen we want to render a PDF Document we always have a easy way.",
        "Alternatively, you could differentiate using BuildConfig.BUILD _ TYPE ;",
        "once the bitmap is rotated, it needs to have its location translated to the place where it should display in the view.",
        "/ / Ideally it will be client side only, so you should be able to make it / / more frequent -LRB- within reason -RRB- without worrying too much about performance scheduleRepeating -LRB- 500 -RRB- ; -RCB- public void run -LCB- / / check to see if all your callbacks have been completed if -LRB- notFinished -RRB- return ;",
        "JsonObjectRequest -- A request for retrieving a JSONObject response body at a given URL, allowing for an optional JSONObject to be passed in as part of the request body.",
        "with the api 23, permission <uses-permission android:name=\"android.pemission.READ_CONTACTS\"/> dont work, change the api level in the emulator for api 22 -LRB- lollipop -RRB- or lower",
        "In response to a request for a file from another application, your provider can offer a handle to the file.",
        "This bypasses the default discovery process.",
        "As promised, I'm putting an example for how to use annotations to serialize/deserialize polymorphic objects, I based this example in the Animal class from the tutorial you were reading.",
        "Try adding this piece of code before loading your viewPager",
        "Finding Fragment Within Pager If the fragment was dynamically added at runtime within an activity into a ViewPager using a FragmentPagerAdapter then we can lookup the fragment by upgrading to a SmartFragmentStatePagerAdapter as described in the ViewPager guide.",
        "Moreover, with the available APIs that are both simple to use and easy to understand, it should be a no-brainer to build basic location-based applications for Android.",
        "That means you can safely ship public key in your app and keep the private key on server.",
        "All permissions were handled at install-time.",
        "And in getView you get following things:",
        "Then, apply the Gradle plugin and add these dependencies in your app/build.",
        "I did this and quickly grepped it, but I didn't get a conclusive result.",
        "I can not reproduce your problem.",
        "Every android app has its own internal storage only that app can access, you can read from there or write to it.",
        "First off, you have to be careful with recording calls as there are legal requirements depending on the country.",
        "The good: A music app can save downloaded songs to your SD card, or a social networking app can save your friends' photos to your phone."
    ],
    "1": {
        "run_cnt": 1,
        "overall": {
            "precision": [
                0.6005522010053265
            ],
            "recall": [
                0.6088085540134643
            ],
            "fscore": [
                0.5951466475249134
            ]
        },
        "api": {
            "precision": [
                0.5838007680815189
            ],
            "recall": [
                0.5741620443593
            ],
            "fscore": [
                0.5722203946322889
            ]
        },
        "so": {
            "precision": [
                0.5874422268907562
            ],
            "recall": [
                0.6167363261093911
            ],
            "fscore": [
                0.5914665514665515
            ]
        },
        "git": {
            "precision": [
                0.7230769230769231
            ],
            "recall": [
                0.7230769230769231
            ],
            "fscore": [
                0.7230769230769231
            ]
        },
        "misc": {
            "precision": [
                0.6038958277374876
            ],
            "recall": [
                0.6037014903713196
            ],
            "fscore": [
                0.5892050529616792
            ]
        }
    },
    "2": {
        "run_cnt": 1,
        "overall": {
            "precision": [
                0.5642104922683145
            ],
            "recall": [
                0.5695854592193392
            ],
            "fscore": [
                0.5345445528913549
            ]
        },
        "api": {
            "precision": [
                0.5475881872842584
            ],
            "recall": [
                0.5463948393535989
            ],
            "fscore": [
                0.49308491002158583
            ]
        },
        "so": {
            "precision": [
                0.6342501744287459
            ],
            "recall": [
                0.615565106067492
            ],
            "fscore": [
                0.5986638409264267
            ]
        },
        "git": {
            "precision": [
                0.42592592592592593
            ],
            "recall": [
                0.38333333333333336
            ],
            "fscore": [
                0.40350877192982454
            ]
        },
        "misc": {
            "precision": [
                0.549133503795692
            ],
            "recall": [
                0.5886046628106105
            ],
            "fscore": [
                0.5426239929514189
            ]
        }
    },
    "3": {
        "run_cnt": 1,
        "overall": {
            "precision": [
                0.4680630711681339
            ],
            "recall": [
                0.4839053258294159
            ],
            "fscore": [
                0.4627943866438497
            ]
        },
        "api": {
            "precision": [
                0.5253540347554432
            ],
            "recall": [
                0.5522559363709447
            ],
            "fscore": [
                0.5267163224400067
            ]
        },
        "so": {
            "precision": [
                0.3944023569023569
            ],
            "recall": [
                0.3897801544860368
            ],
            "fscore": [
                0.3784282152397623
            ]
        },
        "git": {
            "precision": [
                NaN
            ],
            "recall": [
                NaN
            ],
            "fscore": [
                NaN
            ]
        },
        "misc": {
            "precision": [
                0.463972215392181
            ],
            "recall": [
                0.48839186176142696
            ],
            "fscore": [
                0.4614997721576669
            ]
        }
    },
    "4": {
        "run_cnt": 1,
        "overall": {
            "precision": [
                0.5794685815986954
            ],
            "recall": [
                0.6176164276497513
            ],
            "fscore": [
                0.5710592373186357
            ]
        },
        "api": {
            "precision": [
                0.551969696969697
            ],
            "recall": [
                0.5858750684181719
            ],
            "fscore": [
                0.5581333212912161
            ]
        },
        "so": {
            "precision": [
                0.6416666666666666
            ],
            "recall": [
                0.6916666666666667
            ],
            "fscore": [
                0.5987179487179487
            ]
        },
        "git": {
            "precision": [
                0.535013876040703
            ],
            "recall": [
                0.5746794871794871
            ],
            "fscore": [
                0.5385227272727273
            ]
        },
        "misc": {
            "precision": [
                0.5989795918367347
            ],
            "recall": [
                0.6188725490196079
            ],
            "fscore": [
                0.6066666666666666
            ]
        }
    },
    "5": {
        "run_cnt": 1,
        "overall": {
            "precision": [
                0.5148781207037308
            ],
            "recall": [
                0.5280279584217881
            ],
            "fscore": [
                0.5000485107828446
            ]
        },
        "api": {
            "precision": [
                0.46886147186147187
            ],
            "recall": [
                0.4830709487032223
            ],
            "fscore": [
                0.44057316637961796
            ]
        },
        "so": {
            "precision": [
                0.5520285855570298
            ],
            "recall": [
                0.5666707721215299
            ],
            "fscore": [
                0.5466018826816504
            ]
        },
        "git": {
            "precision": [
                NaN
            ],
            "recall": [
                NaN
            ],
            "fscore": [
                NaN
            ]
        },
        "misc": {
            "precision": [
                0.5266996993556771
            ],
            "recall": [
                0.5364468864468864
            ],
            "fscore": [
                0.5172778074554054
            ]
        }
    },
    "6": {
        "run_cnt": 1,
        "overall": {
            "precision": [
                0.5559726645490297
            ],
            "recall": [
                0.5729618446466911
            ],
            "fscore": [
                0.5518677385867513
            ]
        },
        "api": {
            "precision": [
                0.543018471664173
            ],
            "recall": [
                0.5924119441164896
            ],
            "fscore": [
                0.5419600444752456
            ]
        },
        "so": {
            "precision": [
                0.5566610147384896
            ],
            "recall": [
                0.5665309106098579
            ],
            "fscore": [
                0.5549857058934557
            ]
        },
        "git": {
            "precision": [
                0.6019762437138598
            ],
            "recall": [
                0.6483102370004741
            ],
            "fscore": [
                0.6075352055352056
            ]
        },
        "misc": {
            "precision": [
                0.5354546825915854
            ],
            "recall": [
                0.5225136835893754
            ],
            "fscore": [
                0.5212939075778777
            ]
        }
    },
    "7": {
        "run_cnt": 1,
        "overall": {
            "precision": [
                0.571887105602061
            ],
            "recall": [
                0.59092462959704
            ],
            "fscore": [
                0.5565745454647303
            ]
        },
        "api": {
            "precision": [
                0.4975335941232681
            ],
            "recall": [
                0.5185801862050878
            ],
            "fscore": [
                0.4865506389979358
            ]
        },
        "so": {
            "precision": [
                0.6036111111111111
            ],
            "recall": [
                0.6333333333333333
            ],
            "fscore": [
                0.5900859557109556
            ]
        },
        "git": {
            "precision": [
                0.6116071428571428
            ],
            "recall": [
                0.7083333333333333
            ],
            "fscore": [
                0.6166666666666667
            ]
        },
        "misc": {
            "precision": [
                0.6372860989140059
            ],
            "recall": [
                0.5920917570402107
            ],
            "fscore": [
                0.5995534773049005
            ]
        }
    },
    "8": {
        "run_cnt": 1,
        "overall": {
            "precision": [
                0.5570968873807451
            ],
            "recall": [
                0.5729334992661773
            ],
            "fscore": [
                0.5496570981995287
            ]
        },
        "api": {
            "precision": [
                0.5729166666666666
            ],
            "recall": [
                0.5477272727272727
            ],
            "fscore": [
                0.5446075663466968
            ]
        },
        "so": {
            "precision": [
                0.5391604139894154
            ],
            "recall": [
                0.5922241543917076
            ],
            "fscore": [
                0.5407200090465575
            ]
        },
        "git": {
            "precision": [
                0.5863636363636364
            ],
            "recall": [
                0.5917874396135265
            ],
            "fscore": [
                0.5883040935672514
            ]
        },
        "misc": {
            "precision": [
                0.55
            ],
            "recall": [
                0.5466200466200466
            ],
            "fscore": [
                0.5479204339963833
            ]
        }
    },
    "9": {
        "run_cnt": 1,
        "overall": {
            "precision": [
                0.5718759380814677
            ],
            "recall": [
                0.6028674108515296
            ],
            "fscore": [
                0.5679704984847659
            ]
        },
        "api": {
            "precision": [
                0.5451970892238798
            ],
            "recall": [
                0.5530521978021978
            ],
            "fscore": [
                0.5485475305250695
            ]
        },
        "so": {
            "precision": [
                0.6319065656565657
            ],
            "recall": [
                0.6812758799171843
            ],
            "fscore": [
                0.6236248473748474
            ]
        },
        "git": {
            "precision": [
                0.519927536231884
            ],
            "recall": [
                0.5535714285714286
            ],
            "fscore": [
                0.514554794520548
            ]
        },
        "misc": {
            "precision": [
                0.526937134502924
            ],
            "recall": [
                0.5479649215569115
            ],
            "fscore": [
                0.5245185799258608
            ]
        }
    }
}