{
    "0": {
        "run_cnt": 1,
        "overall": {
            "precision": [
                0.5513151092406412
            ],
            "recall": [
                0.6590106183539246
            ],
            "fscore": [
                0.5238086588907827
            ]
        },
        "api": {
            "precision": [
                0.4648936170212766
            ],
            "recall": [
                0.4776876267748479
            ],
            "fscore": [
                0.46797626355637406
            ]
        },
        "so": {
            "precision": [
                0.5923611111111111
            ],
            "recall": [
                0.7552083333333334
            ],
            "fscore": [
                0.545079365079365
            ]
        },
        "git": {
            "precision": [
                0.5807692307692308
            ],
            "recall": [
                0.7121212121212122
            ],
            "fscore": [
                0.5775749674054759
            ]
        },
        "misc": {
            "precision": [
                0.5261904761904762
            ],
            "recall": [
                0.5948275862068966
            ],
            "fscore": [
                0.4833333333333333
            ]
        }
    },
    "venn_diagram_set": [
        "",
        "The TextView being in wrap_content this does nothing, as the TextView is exactly the size of the text.",
        "More Android Android Enterprise Security Source",
        "All callbacks registered via addCallback are evaluated when you call super.onBackPressed ( ).",
        "Hello i used the following code and i did not get any errors in 2.2, 2.3.3 code is very simple.",
        "Since you want to offset the icon to the top right, you will need to offset the ( x, y ) position slightly, but make sure you use dp because if you simply offset the ( x, y ) by some amount it willnot translate to different devices.",
        "For example, here's the onKeyUp ( ) implementation again, with some extra handling for when the Shift key is held down with one of the keys:",
        "When you use a MediaExtractor to extract a file that contains metadata tracks, the metadata's mime format appears as an instance of MediaFormat.",
        "If you are doing a large number of INSERTs, try dropping indexes and recreating them at the end.",
        "It has one form which should be useful for you:",
        "and in the LinearLayout, the default gravity -LRB- used here -RRB- is ` center'",
        "this will rotate the image to 45 degrees",
        "If you are using Android Studio, or if you are using Gradle from the command line, you can add your own stuff to BuildConfig or otherwise tweak the debug and release build types to help distinguish these situations at runtime.",
        "actionBar = getActionBar -LRB- -RRB- ;",
        "LINK",
        "A typical use of the APIs to render a PDF looks like this:",
        "Inserts the specified object at the specified index in the array.",
        "Use android: fillViewport = `` true'' in ScrollView",
        "You may extend it from BaseAdapter.",
        "layout_gravity is the way the TextView will align itself in its parent, in your case in the vertical LinearLayout",
        "This is a common `` problem''.",
        "I used following code for json, for me it support all android version.",
        "You have given your TextView width wrap_content, and that is the problem, Check below code and replace it to your code.",
        "to record just hit the menu button while in call in android phone it will store conversation in amr format and in root directory of sd card max 20 min conversation.",
        "I am using mic to record phone audio and also use the Telephony manager to find the calling state.",
        "Now the user can continue to scroll right and will find fragment A.",
        "It worked well for me and I only ran into one LINK.",
        "An activity populates the ActionBar from within the onCreateOptionsMenu ( ) method:",
        "About DZone Send feedback Careers",
        "or",
        "Called by the garbage collector on an object when garbage collection determines that there are no more references to the object.",
        "IN Style.xml",
        "gradle",
        "That line controls where it's drawn.",
        "Based on @Sakthi's code, but add scaling: -RRB-",
        "Send push notification using postman",
        "getView -LRB- -RRB- is the main part of your adapter.",
        "For more info on how scopes work refer to LINK and Dagger's generated code.",
        "While developing for a target platform of 2.3.3 using Eclipse on Ubuntu, I had permission failures in the log file that indicated I needed this exact line while working on something similar.",
        "If an uncaught exception is thrown by the finalize method, the exception is ignored and finalization of that object terminates.",
        "Its working fine for me.",
        "A component can depend on only one other scoped component.",
        "Note as shown above that there are other data sources besides an ArrayAdapter such as the CursorAdapter which instead binds directly to a result set from a Local SQLite Database.",
        "To overcome this, I have created a custom ViewPager -LRB- based on LINK -RRB- that calculates it's height in the required manner.",
        "Every android app has its own internal storage only that app can access, you can read from there or write to it.",
        "This library is simple and works well: LINK LINK",
        "The @JsonSubTypes tells Jackson which classes it should deserialize to.The above should be able to deserialize the following JSON objects into the appropriate objects:",
        "- processor class1 -LSB-, class2, class3 ... -RSB-",
        "Note that starting with Android 8.0 ( API level 26 ) MediaRecorder supports the MPEG2_TS format, which is useful for streaming: Kotlin Java",
        "99 % of the time, not working properly == not used properly.",
        "Jackson Polymorphic DeserializationHow to Use Jackson to Deserialize Json Fields into Polymorphic TypesDavid TruongJan 9, 2019 · 2 min readPhoto by Markus Spiske on UnsplashJackson deserialization/serialization works out of the box most of the time.",
        "To receive user input from the notification's reply UI, call RemoteInput.getResultsFromIntent ( ), passing it the Intent received by your BroadcastReceiver:",
        "The solution to OP's problem can be found below.",
        "It's a ViewGroup that can be placed anywhere in your layout.",
        "Try adding this piece of code before loading your viewPager",
        "Note that for every instance of component itself new instance of that dependency will be created.",
        "As for storing data in the app what you can encrypt the data before storing or you can use another format other than SQLite for better security as you can view sqlite databases using the browser pretty easily.",
        "onBackPressed is always called, regardless of any registered instances of OnBackPressedCallback.",
        "after that, you can easily start recording anywhere you want",
        "You need not give permission for GPS, Network providers.",
        "In the adapter I am using two arraylists rtyArray and qtyArray to hold the position of the Edittext data in the model class.",
        "Of course there are some obfuscating approaches, like ProGuard that you should use, but they wouldn't stop a determined hacker to find our private key in our code.",
        "Remember to implement FragmentStatePagerAdapter NOT FragmentPagerAdapter",
        "A minor point to add to Robie's otherwise comprehensive answer: the VFS in SQLite -LRB- which is mostly concerned with locking -RRB- can be swapped out for alternatives.",
        "Use EXPLAIN QUERY PLAN on your queries to see which index would be used or if the query requires a full table scan.",
        "Fragments can communicate up to their parent activity using an interface and listeners",
        "Defining the Adapter Next, we need to define the adapter to describe the process of converting the Java object to a View ( in the getView method ).",
        "First function of scopes is a way to tell Dagger compiler which scopes are allowed within scoped component.",
        "Only when a callback is enabled ( i.e., isEnabled ( ) returns true ) will the dispatcher call the callback's handleOnBackPressed ( ) to handle the Back button event.",
        "First off, you have to be careful with recording calls as there are legal requirements depending on the country.",
        "See Setting Up a Request Queue for an example.",
        "I've seen this cause a crash on Android 5.1.",
        "So please check with LINK for that and update accordingly.",
        "and then:",
        "Did try to comment there but it looks too ugly because don't know how to make multiline.",
        "While if you do not insist on custom annotations, the easiest way for now in my opinion is to add custom header to the api interface, then read and remove it in the interceptor.",
        "jObj.getJSONObject -LRB- i -RRB- ; / * i is a integer, index value * /",
        "I have no experience with Gradle, but it seems like you need to do something like this.",
        "In modern Android UIs developers should lean more on a visually distinct color scheme for toolbars than on their application icon.",
        "Danny GonzalezDanny is a full-stack software engineer with 7 + years of experience doing project management and building web and mobile applications.",
        "If true, adjusts the padding of this view to leave space for the system windows.",
        "Of the suggestions proposed, LINK actually combines observable results with each other, which may or may not be what is wanted, but was not asked in the question.",
        "onCreate of the Activity, you can use do the following",
        "Instances of this class are not thread safe.",
        "Hence it shouldn't be hard to represent enums internally in a way that both platforms could work with it.",
        "Build and run the project.",
        "It is taken from bundells post from LINK",
        "If the file is from an untrusted source it is recommended to run the renderer in a separate, isolated process with minimal permissions to limit the impact of security exploits.",
        "You are mistaking gravity and layout_gravity.",
        "In this way, we can call displayFragment -LRB- homeFragment -RRB- for example.",
        "Here is a debug log: https://gist.github.com/anonymous/cc03830f4322e1c1a1f4",
        "Next, we need to add method that would manage the deserialization of a JSON dictionary into a populated Business object:"
    ],
    "1": {
        "run_cnt": 1,
        "overall": {
            "precision": [
                0.5901790951423305
            ],
            "recall": [
                0.5558407034142329
            ],
            "fscore": [
                0.5361820831048582
            ]
        },
        "api": {
            "precision": [
                0.7058823529411764
            ],
            "recall": [
                0.7430555555555556
            ],
            "fscore": [
                0.7206349206349207
            ]
        },
        "so": {
            "precision": [
                0.64312675070028
            ],
            "recall": [
                0.611013986013986
            ],
            "fscore": [
                0.5781790427676269
            ]
        },
        "git": {
            "precision": [
                0.46153846153846156
            ],
            "recall": [
                0.35294117647058826
            ],
            "fscore": [
                0.4000000000000001
            ]
        },
        "misc": {
            "precision": [
                0.506245461147422
            ],
            "recall": [
                0.46911345734875143
            ],
            "fscore": [
                0.4500968988585088
            ]
        }
    },
    "2": {
        "run_cnt": 1,
        "overall": {
            "precision": [
                0.513401820980154
            ],
            "recall": [
                0.48745047156004884
            ],
            "fscore": [
                0.4748493190913755
            ]
        },
        "api": {
            "precision": [
                0.42517813136183435
            ],
            "recall": [
                0.4288443646996279
            ],
            "fscore": [
                0.41137949787002626
            ]
        },
        "so": {
            "precision": [
                0.6410947712418301
            ],
            "recall": [
                0.5763343799058085
            ],
            "fscore": [
                0.5393887326877018
            ]
        },
        "git": {
            "precision": [
                NaN
            ],
            "recall": [
                NaN
            ],
            "fscore": [
                NaN
            ]
        },
        "misc": {
            "precision": [
                0.4837998754976367
            ],
            "recall": [
                0.46474212044604485
            ],
            "fscore": [
                0.47404712481014283
            ]
        }
    },
    "3": {
        "run_cnt": 1,
        "overall": {
            "precision": [
                0.5275717388027401
            ],
            "recall": [
                0.550952934661045
            ],
            "fscore": [
                0.5069315394220785
            ]
        },
        "api": {
            "precision": [
                0.4911445660989457
            ],
            "recall": [
                0.5339637229984944
            ],
            "fscore": [
                0.4497459081255111
            ]
        },
        "so": {
            "precision": [
                0.6086564171122995
            ],
            "recall": [
                0.5959211553473849
            ],
            "fscore": [
                0.6007799671592775
            ]
        },
        "git": {
            "precision": [
                NaN
            ],
            "recall": [
                NaN
            ],
            "fscore": [
                NaN
            ]
        },
        "misc": {
            "precision": [
                0.5011278195488722
            ],
            "recall": [
                0.5314685314685315
            ],
            "fscore": [
                0.4988615586297306
            ]
        }
    },
    "4": {
        "run_cnt": 1,
        "overall": {
            "precision": [
                0.5497301880974407
            ],
            "recall": [
                0.6771171672228402
            ],
            "fscore": [
                0.5177153079554301
            ]
        },
        "api": {
            "precision": [
                NaN
            ],
            "recall": [
                NaN
            ],
            "fscore": [
                NaN
            ]
        },
        "so": {
            "precision": [
                0.5708333333333333
            ],
            "recall": [
                0.6375
            ],
            "fscore": [
                0.5132575757575757
            ]
        },
        "git": {
            "precision": [
                0.5284921369102683
            ],
            "recall": [
                0.5940860215053764
            ],
            "fscore": [
                0.5066041860596316
            ]
        },
        "misc": {
            "precision": [
                0.55
            ],
            "recall": [
                0.9224137931034483
            ],
            "fscore": [
                0.5488530161427357
            ]
        }
    },
    "5": {
        "run_cnt": 1,
        "overall": {
            "precision": [
                0.5269546876309823
            ],
            "recall": [
                0.5585252696649756
            ],
            "fscore": [
                0.519954452720574
            ]
        },
        "api": {
            "precision": [
                0.5290966386554622
            ],
            "recall": [
                0.5525925925925925
            ],
            "fscore": [
                0.5160018173936242
            ]
        },
        "so": {
            "precision": [
                0.5597337006427915
            ],
            "recall": [
                0.6357980255039078
            ],
            "fscore": [
                0.5623387402769873
            ]
        },
        "git": {
            "precision": [
                NaN
            ],
            "recall": [
                NaN
            ],
            "fscore": [
                NaN
            ]
        },
        "misc": {
            "precision": [
                0.4745732415765484
            ],
            "recall": [
                0.45151515151515154
            ],
            "fscore": [
                0.4623069743763788
            ]
        }
    },
    "6": {
        "run_cnt": 1,
        "overall": {
            "precision": [
                0.5563929611311884
            ],
            "recall": [
                0.630869597275973
            ],
            "fscore": [
                0.5636662616397508
            ]
        },
        "api": {
            "precision": [
                0.510142400464981
            ],
            "recall": [
                0.5193764568764568
            ],
            "fscore": [
                0.497293073408559
            ]
        },
        "so": {
            "precision": [
                0.5913411201801294
            ],
            "recall": [
                0.7201027998121926
            ],
            "fscore": [
                0.6090995083348025
            ]
        },
        "git": {
            "precision": [
                NaN
            ],
            "recall": [
                NaN
            ],
            "fscore": [
                NaN
            ]
        },
        "misc": {
            "precision": [
                0.5152731241750432
            ],
            "recall": [
                0.5192797313349404
            ],
            "fscore": [
                0.5164563331333133
            ]
        }
    },
    "7": {
        "run_cnt": 1,
        "overall": {
            "precision": [
                0.550479075170445
            ],
            "recall": [
                0.6150340328608734
            ],
            "fscore": [
                0.523903789357468
            ]
        },
        "api": {
            "precision": [
                0.536092530657748
            ],
            "recall": [
                0.5752136752136752
            ],
            "fscore": [
                0.538433908045977
            ]
        },
        "so": {
            "precision": [
                0.5699074074074074
            ],
            "recall": [
                0.6358974358974359
            ],
            "fscore": [
                0.5010128760128759
            ]
        },
        "git": {
            "precision": [
                NaN
            ],
            "recall": [
                NaN
            ],
            "fscore": [
                NaN
            ]
        },
        "misc": {
            "precision": [
                0.5357231213276983
            ],
            "recall": [
                0.6235592859532281
            ],
            "fscore": [
                0.543710040685847
            ]
        }
    },
    "8": {
        "run_cnt": 1,
        "overall": {
            "precision": [
                0.5283459595959595
            ],
            "recall": [
                0.5201474210963921
            ],
            "fscore": [
                0.49781294002992116
            ]
        },
        "api": {
            "precision": [
                NaN
            ],
            "recall": [
                NaN
            ],
            "fscore": [
                NaN
            ]
        },
        "so": {
            "precision": [
                0.5805555555555555
            ],
            "recall": [
                0.6730233368164402
            ],
            "fscore": [
                0.5816035816035816
            ]
        },
        "git": {
            "precision": [
                0.4772727272727273
            ],
            "recall": [
                0.3387096774193548
            ],
            "fscore": [
                0.39622641509433965
            ]
        },
        "misc": {
            "precision": [
                0.475
            ],
            "recall": [
                0.3958333333333333
            ],
            "fscore": [
                0.43181818181818177
            ]
        }
    },
    "9": {
        "run_cnt": 1,
        "overall": {
            "precision": [
                0.5189466237970535
            ],
            "recall": [
                0.5658141508079638
            ],
            "fscore": [
                0.5072193576941536
            ]
        },
        "api": {
            "precision": [
                0.48411801632140616
            ],
            "recall": [
                0.44495607071027843
            ],
            "fscore": [
                0.4635093167701863
            ]
        },
        "so": {
            "precision": [
                0.5522480620155039
            ],
            "recall": [
                0.65692897141173
            ],
            "fscore": [
                0.5449645716978185
            ]
        },
        "git": {
            "precision": [
                NaN
            ],
            "recall": [
                NaN
            ],
            "fscore": [
                NaN
            ]
        },
        "misc": {
            "precision": [
                0.5038230739450251
            ],
            "recall": [
                0.55
            ],
            "fscore": [
                0.4943115776126237
            ]
        }
    }
}