{
    "0": {
        "run_cnt": 1,
        "overall": {
            "precision": [
                0.5197717812300602
            ],
            "recall": [
                0.5158013826963739
            ],
            "fscore": [
                0.5095684272286541
            ]
        },
        "api": {
            "precision": [
                0.4893678026947643
            ],
            "recall": [
                0.459462064976381
            ],
            "fscore": [
                0.47152451239797266
            ]
        },
        "so": {
            "precision": [
                0.5592592592592592
            ],
            "recall": [
                0.5742753623188406
            ],
            "fscore": [
                0.5516014473331546
            ]
        },
        "git": {
            "precision": [
                0.45852390852390856
            ],
            "recall": [
                0.44107142857142856
            ],
            "fscore": [
                0.44853294853294856
            ]
        },
        "misc": {
            "precision": [
                0.5521924154277096
            ],
            "recall": [
                0.5591596851076123
            ],
            "fscore": [
                0.5455982905982906
            ]
        }
    },
    "venn_diagram_set": [
        "",
        "It also helps simplify refactoring, since you can focus on what modules to build rather than focusing on the order in which they need to be created.",
        "My answer builds on that from Kevin Wong, here as a one-liner using CollectionUtils from spring and a Java 8 lambda expression.",
        "I've seen this cause a crash on Android 5.1.",
        "The example code above will access the first, back-facing camera on a device with more than one camera.",
        "The model in this case is Business and for our application, let's suppose we just need the name, phone, and image of the business which are all provided by the Search API.",
        "To handle an individual key press, implement onKeyDown ( ) or onKeyUp ( ) as appropriate.",
        "I spent some time thinking about it.",
        "Encodes this object as a compact JSON string, such as:",
        "bt when i load the list, it load wrong list items time to time.",
        "There have been reports that this value is not 100 % reliable from Eclipse-based builds, though I personally have not encountered a problem, so I can not say how much of an issue it really is.",
        "I simply reorder the fragment list, update the viewPager and move to the new page without animation, the result is an endless loop in both directions:",
        "@ahamrani If I were you I would go ask on Huawei/EmUI related forums before voiding my warranty ...",
        "Make sure you don't have something like that hanging around",
        "If you run the app now you won't be able to see any movies:",
        "But I dont understand what difference they made ?",
        "For example, here's an implementation of SQLiteOpenHelper that uses some of the commands shown above:",
        "parent",
        "After that override getView -LRB- -RRB- method and make sure to return your custom View there.",
        "Specify a URL and receive a raw string in response.",
        "When using the verifyWithRecaptcha ( ) method in your app, you must do the following:",
        "In human speech it would be like,",
        "- processor class1 -LSB-, class2, class3 ... -RSB-",
        "For me, the problem was that I copied something from an example and used",
        "For other services, you might need to intercept calls in a different way.",
        "It is worth noting that apparently Dagger2 creates a single instance per scoped provider in a module per component.",
        "EXAMPLE:",
        "Create a PendingIntent for the reply action.",
        "You should only declare modules once in a component.",
        "inject.Scope annotation - Dependencies declared with that scope with have caching Provider with double-check lock generated and only single instance will be created for it within component declared with the same scope and its creation will be thread safe.",
        "Specify a URL and get a JSON object or array ( respectively ) in response.",
        "You can either rotate your bitmap when you draw it by using a matrix:",
        "In your activity's onCreate ( ) method, create an instance of the Fused Location Provider Client as the following code snippet shows.",
        "I haven't tried recording phone call's but there is a option in LINK for:",
        "and in the LinearLayout, the default gravity -LRB- used here -RRB- is ` center'",
        "Your app can then access the related data for a period of time that depends on your app's behavior and the user's actions:",
        "For those who want to capture a GLSurfaceView, the getDrawingCache or drawing to canvas method won't work.",
        "Validating the response is really easy.",
        "Volley provides the following classes for JSON requests:",
        "For example, you can not constructor-inject an interface.",
        "I would add these:",
        "Hope it helps !",
        "The following code snippet shows how to invoke this method:",
        "You don't need to use so many lists, just create a class that will contain all the data of single item, there is no need for buttons, use just text change listener instead.",
        "You can also add one or more metadata tracks with custom information for each frame, but only to MP4 containers.",
        "Having an interface like this helps with mocking the client for tests, which I appreciate.",
        "Update Note: This tutorial is now up to date with the latest version of Android Studio version 3.0.1, and uses Kotlin for app development.",
        "I didn't see a specific issue opened for this, but looking at the code for DrawableWrapperDonut/DrawableWrapperGingerbread, I can see that the problem was introduced around 23.4.0 and later fixed, so if you were using the buggy version, switching to a good version should fix this crash.",
        "Initial and maximum pool size.",
        "Runtime permissions are permissions that are requested as they are needed while the app is running.",
        "Check this tutorial you will get information about how to draw bitmap and how to rotate canvas",
        "As discussed in Detecting Common Gestures, GestureDetector helps you detect common gestures used by Android such as scrolling, flinging, and long press.",
        "If the user granted the permission to your app, you can access the private user data.",
        "Only one index will be used on any given query.",
        "For example, this makes it easy to replace interface implementations with mock objects.",
        "Anyway, I don't really like this solution, setting getCount to return Integer.MAX _ VALUE can have huge impact on application performance.",
        "See this example code for a working example.",
        "Scoped generic class fails to build · Issue # 671 · google/dagger · GitHub",
        "The user has now plenty of swiping to do in either direction before they reach an end.",
        "SQLiteDatabase databases you create are private to your application and provider.",
        "An application icon An `` upward'' navigation to logical parent An application or activity-specific title Primary action icons for an activity Consistent navigation ( including navigation drawer )",
        "Kotlin",
        "Traditionally, you manage a request code yourself as part of the permission request and include this request code in your permission callback logic.",
        "This will automatically show the HomeFragment and hide any other fragment in the list.",
        "You annotate a class with @RunWith ( AndroidJUnit4:: class ) to specify that AndroidJUnit4 is the runner for this test.",
        "You'll have to add 8 more items to the JSON file.",
        "Mark Complete ( All Chapters ) Clear Progress ( All Chapters )",
        "Screen Orientation - Often within apps, the portrait version of an activity has a substantially different layout from the landscape version.",
        "Go back to MainActivity.kt and first import the ViewPager to be able to use it with this line:",
        "This answer is a modification to mangu23 LINK I only added a for loop to avoid repetition and to easily add more fragments without boilerplate code.",
        "JsonArrayRequest -- A request for retrieving a JSONArray response body at a given URL.",
        "When I updated your sample with these annotations, Jackson correctly deserialized each object to the expected subclass.",
        "When the app needs to use any of the protected features of the device ( sending network requests, accessing the camera, sending an SMS, etc ) it must obtain the appropriate permission from the user to do so.",
        "At the time I am writing this article, the latest version of Google Play Services available is 6.5.87.",
        "Based on LINK.",
        "And replace the response_string with the value that you earlier got by the g-recaptcha-response field.",
        "And you can get the json object by passing index value like,",
        "I believe I had a similar problem.",
        "Press Alt + Enter, or Option + Return on a Mac, to import these other needed classes:",
        "It introduced the concept of runtime permissions.",
        "Before you pull your hairs out make sure you are using:",
        "now you can do what you want with the bitmap.",
        "To be able to record, your app must tell the user that it will access the device's audio input.",
        "Create a new class by right-clicking on the com.raywenderlich.alltherecipes package and selecting New > Kotlin File/Class.",
        "Here is a LINK on how to record audio using the LINK.",
        "However, in most cases it is best to use Hilt to manage all of your usage of Dagger on Android.",
        "This connects the volume controls to STREAM_MUSIC whenever the target activity or fragment is visible.",
        "If your app isn't currently playing anything, hitting the volume keys adjusts the music volume ( or the ringer volume before Android 9 ).",
        "When a event arrives that specific state is changed, and we check if all the states are as desired.",
        "Now, we just need to connect this adapter to a ListView to be populated:",
        "Hilt automatically creates and destroys instances of generated component classes following the lifecycle of the corresponding Android classes.",
        "An Intent is an object that provides runtime binding between separate components, such as two activities.",
        "However, I'm somewhat new to Jackson, so perhaps I'm missing something here.",
        "This nested fragment is known as a child fragment.",
        "If you run the app and tap the button on the first activity, the second activity starts but is empty.",
        "Get news and tips by email Subscribe",
        "Please see LINK for more info.",
        "Java 7",
        "If you try any of this out then there is a chance that you will do everything correct and yet your action bar will not show.",
        "It is also working on a real device and I tested it in Panasonic P81.",
        "custom event icon/add small icon to event · Issue # 181 · SundeepK/CompactCalendarView · GitHub",
        "the final action in the ondraw method is the drawing of the bitmap.",
        "Defining the Adapter Next, we need to define the adapter to describe the process of converting the Java object to a View ( in the getView method ).",
        "- proc: only means that only annotation processing is done, without any subsequent compilation.",
        "Previously it would have added an App Bar but Google recommends that we change to using the Toolbar widget.",
        "To model the response of the network request, we have our own Result class.",
        "I suspect the version of Jackson are you using explains the difference.",
        "Next, we need to add method that would manage the deserialization of a JSON dictionary into a populated Business object:",
        "If you have a lot of string / text type data, consider creating Virtual tables using full text search -LRB- FTS3 -RRB-, which can run faster query.",
        "off course it is a little tedious to write raw query.",
        "This is usually not necessary, however, because callbacks are automatically removed when their associated LifecycleOwner is destroyed.",
        "More than just text ?",
        "ViewPager - Swiping between fragments",
        "This will ensure that the ViewPager doesn't request the element at an index larger than movies.size because the remainder after you divide the position by movies.size will always be greater than or equal to 0 and less than movies.size.",
        "and dont forget to set scaleType property to matrix of ImageView tag like:",
        "The content of the array is obtained through Resources.getTextArray ( int ).",
        "Yes, it is possible ` to receive notifications from google cloud message when the application is fully closed'.",
        "Generates the classes that it uses at runtime to create the actual objects and their dependencies.",
        "reference LINK",
        "Whether or not to trust the master-key method, I'll leave to you.",
        "Pardon the misspelling, I meant polling.",
        "Unless your JSON structure is complicated, you won't have to deal with deserializing your JSON into a polymorphic data type.",
        "Using a Custom ArrayAdapter When we want to display a series of items from a list using a custom representation of the items, we need to use our own custom XML layout for each item.",
        "The function parameters tell Hilt the dependencies of the corresponding type.",
        "In the desired layout, the labels are right-justified and the fields are left-justified.",
        "If the user presses and holds the button, then onKeyDown ( ) is called multiple times.",
        "Your task is to populate each element of the row view with the relevant recipe data, hence, you'll define what text goes in the `` title'' element, the `` subtitle'' element and so on.",
        "A Toolbar is a generalization of action bars for use within application layouts.",
        "Core Java APIs for making Java http requests Since Java 1.1 there has been an HTTP client in the core libraries provided with the JDK.",
        "ArrayAdapter is a subclass of BaseAdapter which takes ArrayList -LRB- or array -RRB- in constructor.",
        "If using the fasterxml then,",
        "If the action accesses shared state, it is responsible for providing the required synchronization.",
        "Add the calling app's package name to the site key on the reCAPTCHA Admin Console, or disable package name validation for your site key.",
        "You are mistaking gravity and layout_gravity.",
        "Note: Most of the audio sources ( including DEFAULT ) apply processing to the audio signal.",
        "I figured out a solution in order to avoid this problem using the:",
        "After the user responds to the system permissions dialog, the system then invokes your app's implementation of onRequestPermissionsResult ( ).",
        "Change the android: label or android: icon to modify the ActionBar title or icon for a given activity or for the application as a whole.",
        "Create a face detection listener",
        "Please also check this developer app given for how to integrate RemoteControlClient: LINK However UI for the RemoteControlClient defer as per the device you can not updates its UI to your own but you have control to show and display the component and control of the Music app.",
        "It provides the best accuracy based on our needs.",
        "How to pass large data between server and client ( android ) securely?Using RSA and AES ( Hybrid ) encryption techniqueMayank Mohan UpadhyayFollowJun 14, 2017 · 5 min readHello guys, Most of the times, we pass sensitive data from our Android app to our server.",
        "Make sure you add it outside of the application tag.",
        "I had the same error and traced it to a bug with DrawableCompat.wrap -LRB- -RRB- in 23.4.0 that doesn't exist in earlier & later versions of the support library.",
        "Adds the specified Collection at the end of the array.",
        "Notice that the starter project contains a Recipe class that models and stores the information about the recipes that will be displayed.",
        "The last thing you have to do is let the RecyclerTabLayout know what titles to display on the Tabs.",
        "Dedicated devices cookbook with further examples to restrict the dedicated devices and enhance the user experience.",
        "Note: Your app can not customize the dialog that appears when you call launch ( ).",
        "In case you want to switch back to default heartbeat interval, either uninstall the app or set the default interval right from the app.",
        "Creates a new ArrayAdapter from external resources.",
        "Runtime Permissions If the permission you need to add isn't listed under the normal permissions, you'll need to deal with `` Runtime Permissions''.",
        "Getting locked out of your own Android phone can be really frustrating and quite embarrassing.",
        "The bad: A malicious app can secretly turn on your camera and record what's going on around you.",
        "Presenting navigational components such as the navigation drawer or the viewpager.",
        "In you case, you first want to check if you such file exist before creating one.",
        "I think that's done in `` Contacts/src/com/android/contacts/ui/QuickContactWindow.java'', but I am not completely sure.",
        "Sets the TextClassifier for this TextView.",
        "And if you are building a media player, also read Using MediaStyle notifications with a foreground service.",
        "getAnnotation -LRB- annotationClass -RRB-",
        "Users can swipe down on the status bar to open the notification drawer, where they can view more details and take actions with the notification.",
        "For more information, you can see the tutorial at LINK",
        "The workaround in the issue mentioned by Dany was working the last time I checked it.",
        "This usually allows Android to properly navigate to previous destinations when the Back button is pressed.",
        ":] Where to Go From Here ?",
        "It returns the title of the movie that corresponds with the fragment created inside getItem ( position: Int ).",
        "@geoand you're correct, it still works if I remove @RegisterForReflection.",
        "When the user makes a choice, the system asynchronously invokes your implementation of ActivityResultCallback, which you defined in the previous step.",
        "Set the output file format using setOutputFormat ( ).",
        "You can download the solution here.",
        "I have seen Android location access tutorial examples giving all the available permission in the world.",
        "Attach the RemoteInput object to an action using addRemoteInput ( ).",
        "In addition to Stream, which is a stream of object references, there are primitive specializations for IntStream, LongStream, and DoubleStream, all of which are referred to as `` streams'' and conform to the characteristics and restrictions described here.",
        "And you can use then like that:",
        "the second step is to translate the view up and left by half the width and half the height.",
        "For example:",
        "note that the 2 null args may allow you to clip some portion in the page and perform a transformation -LRB- using a LINK -RRB- of the clip",
        "Returns the value mapped by name if it exists and is a boolean or can be coerced to a boolean, or fallback otherwise.",
        "Notice that there's a FrameLayout with the id of @ + id/child _ fragment_container in which the child fragment will be inserted.",
        "Returns the API response in a JsonObject.",
        "I dropped this into my ContentProvider.query -LRB- -RRB- and now I can see exactly how all the queries are getting performed.",
        "Wont help you in this case.",
        "with the api 23, permission <uses-permission android:name=\"android.pemission.READ_CONTACTS\"/> dont work, change the api level in the emulator for api 22 -LRB- lollipop -RRB- or lower",
        "The system passes in the user response to the permission dialog, as well as the request code that you defined, as shown in the following code snippet:",
        "Connecting the PagerAdapter and the ViewPager Open MainActivity.kt and add the following line at the top to declare your MoviesPagerAdapter:",
        "If you launch a foreground service while the activity is visible, and the user then moves your app to the background, your app can continue to access the data until that foreground service stops.",
        "getView going to be called for each position every time it is displayed.",
        "What to do?Hybrid solution to the rescue!Consider this: Using an asymmetric encryption ( say RSA ), the server generates a key pair consisting of a public key and a private key.Server saves these keys in a secure location.We take public key and ship it in our app ( client ).",
        "Here was my approach to this in kotlin",
        "Subcomponent Builders Available starting in v2 .7",
        "Any thread in your app can run in parallel to other threads, including the main thread, so you should ensure that your code is thread-safe.",
        "I think we will know more about your issue after you make either one or both of the above changes: -RRB-",
        "The @Singleton annotation also signals to the Dagger compiler that the instance should be created only once in the application.",
        "I hope this tutorial is of some use to you, and helps you on your way to creating an awesome Android application.",
        "layout_gravity is the way the TextView will align itself in its parent, in your case in the vertical LinearLayout",
        "If you want to take screenshot from fragment than follow this:",
        "You can use the ApplicationComponent to get a reference to LoginComponent and then inject LoginActivity as follows:",
        "Please give your suggestions in a detailed manner.",
        "The user can grant or deny each permission, and the app can continue to run with limited capabilities even if the user denies a permission request.",
        "onCreate of the Activity, you can use do the following",
        "Reference: LINK",
        "You might expect the Location object that's contained in the most recent call to getLastLocation ( ) to be the most accurate.",
        "You may also find useful LINK and LINK.",
        "and successfully create a Business with Business.fromJson ( json ).",
        "Here is how I apply offset and length.",
        "LINK http://developer.android.com/reference/javax/net/ssl/package-summary.html LINK",
        "Embedding a Fragment in an Activity There are two ways to add a fragment to an activity: dynamically using Java and statically using XML.",
        "All callbacks registered via addCallback are evaluated when you call super.onBackPressed ( ).",
        "I am using this solution in case to find out that my app is running on debug version.",
        "If you want to render a PDF, you create a renderer and for every page you want to render, you open the page, render it, and close the page.",
        "Try this:",
        "Please let me know your suggestions and comments.You can find me on Medium and LinkedIn ... Thanks for reading ...",
        "The activity also removes registered callbacks when their associated LifecycleOwner is destroyed, which prevents memory leaks and makes it suitable for use in fragments or other lifecycle owners that have a shorter lifetime than the activity.",
        "gravity is the way the text will align itself in the TextView.",
        "Maven depenendency for pretius-jddl -LRB- check newest version at LINK:",
        "In the question, all that was wanted was execution of each of the operations, either one-by-one or in parallel -LRB- which was not specified, but linked Bolts example was about parallel execution -RRB-.",
        "The SafetyNet service includes a reCAPTCHA API that you can use to protect your app from malicious traffic.",
        "Reusing View and Logic Components - Fragments enable re-use of parts of your screen including views and event logic over and over in different ways across many disparate activities.",
        "Ah, thanks @oztimpower, I had forgot !",
        "Next, you'll need to initiate the permission request and handle the result.",
        "to subscribe to this conversation on GitHub.",
        "From the OnCreateView method ?",
        "To enable Smart Reply, call setAllowGeneratedResponses ( true ) on the reply action.",
        "notice that the drawbitmap method uses the matrix with the various transformations encoded in it.",
        "It wasn't until I moved the * uses-permission ... READ_CONTACTS * line to outside the application tag that things worked.",
        "If that is how you wish to distinguish a `` debug'' build from a `` release'' build, then by definition, that's the best solution.",
        "so user can drag the image off the screen and zoom-In, zoom-out the image.",
        "Note: This class takes ownership of the passed in file descriptor and is responsible for closing it when the renderer is closed.",
        "This ensures that the OnBackPressedCallback is only added when the LifecycleOwner is Lifecycle.State.STARTED.",
        "If you use an ordering predicate -LRB- <, < =, > etc -RRB- then that needs to be in the last used column of the index.",
        "This topic provides simple examples for sizing and aligning nodes in a pane.",
        "Joe Howard Joe's path to software development began in the fields of computational physics and systems engineering.",
        "Also, all example on developer.android.com are terrible, any one of them really works.Olaoye OluwapelumiThanks, really helpful.",
        "Before Marshmallow, permissions were handled at install-time and specified in the AndroidManifest.xml within the project.",
        "onScroll ( ) is only called when a finger is down ; as soon as the finger is lifted from the screen, the gesture either ends, or a fling gesture is started ( if the finger was moving with some speed just before it was lifted ).",
        "What if you then decide to add your favorite TV series as well ?",
        "Level up your Twilio API skills in TwilioQuest, an educational game for Mac, Windows, and Linux.",
        "An intent may also contain `` extras'' data that the destination activity displays in the UI ; the user then has the option of changing this data before using it to modify the data in the provider.",
        "Note that, run gradlew in Windows as below.",
        "For example, if each page in the swipe view should consume the entire layout, then your layout should look like this:",
        "get the LINK to render",
        "In fact components can declare many scopes -LRB- e.g. @ActivityScope and @UiScope -RRB- and Dagger will treat both of them as single scope - it's called scope aliasing.",
        "So the first thing you should do its to create your custom adapter.",
        "If you need this mode there are some guidelines to use it properly: here are LINK.",
        "On the other hand, if your application is about sharing user location with his friend, you maybe just need to request the location once in a while.",
        "MockWebServer makes it possible to easily test how your apps behave when making HTTP/HTTPS calls.",
        "The TextView being in wrap_content this does nothing, as the TextView is exactly the size of the text.",
        "Open activity_main.xml and paste the following snippet above the ViewPager:",
        "you have to use the matrix to rotate image look the lines",
        "Read more about getters and setters in Kotlin here.",
        "Sometimes, this is not possible and you have to use Dagger modules.",
        "Check the success field for true or false",
        "Returns the value mapped by name if it exists and is an int or can be coerced to an int, or 0 otherwise.",
        "You will probably want to add more functionality later, but it will help you get started.",
        "Short battery life is one of the biggest downfalls of Android phones, and there are times when you ... Read more",
        "For additional design guidance for tab layouts, see the Material Design documentation for tabs.",
        "I dont know how its was worked in android 4.0.",
        "As you can read LINK:",
        "You can have indexes that contain multiple columns -LRB- to assist queries with multiple predicates -RRB-.",
        "An audio app should provide the ability to balance its output volume with other apps that might be playing on the same stream.",
        "Set the audio encoder using setAudioEncoder ( ).",
        "Anyone with HTTP POST knowledge could put random data inside of the g-recaptcha-response form field, and foll your site to make it think that this field was provided by the google widget.",
        "Next, we define the parent component:",
        "If the holder holds the view you want, you can reuse it.",
        "A practical guide to using Hilt with Kotlin",
        "The JSON structure was quite complex, with multiple levels and even an array.",
        "If an uncaught exception is thrown by the finalize method, the exception is ignored and finalization of that object terminates.",
        "David TruongJan 9, 2019 · 2 min read",
        "1 - Enable touch in the chart",
        "More information LINK",
        "So in order to get a scoped provider in a module, you need to specify the scope for your module's provider method.",
        "after that, you can easily start recording anywhere you want",
        "the zip is attached at the bottom of that page.",
        "Jackson Polymorphic DeserializationHow to Use Jackson to Deserialize Json Fields into Polymorphic TypesDavid TruongJan 9, 2019 · 2 min readPhoto by Markus Spiske on UnsplashJackson deserialization/serialization works out of the box most of the time.",
        "The Action Bar follows the material design guidelines and uses a LINK.",
        "In the fragment, add a method:",
        "Snackbars should still work with AppCompat themes, which don't specify a snackbarButtonStyle.",
        "What the ViewHolder class does is cache the call to findViewById ( ).",
        "To find duplicate dependencies or its required dependencies, you can visualize library dependencies in tree.",
        "So let me do it for you: the correct hierarchy as suggested by google blogspot it is working fine for me: Check this out",
        "Let me know if you guys need anything more in this tutorial.",
        "Unscoped dependency will have simple Provider generated without any caching and any instance of that dependency created in component will be new for every new injection -LRB- as in constructor, or in module provision method, or just as a field -RRB-.",
        "TabLayout - Tabs at the top",
        "you should try this:",
        "Suppose that AnalyticsService has an internal state that requires the same instance to be used every time -- not only in ExampleActivity, but anywhere in the app.",
        "Example code for LoginUserNameFragment appears in the following code snippet:",
        "I don't know if it can help anybody, but here is what I use as a workaround:",
        "Use a raw framework class to avoid Java 7's poor type inference when ...",
        "create two class to achieve this goal: GcmBroadcastReceiver and GcnIntentService.",
        "Any exception thrown by the finalize method causes the finalization of this object to be halted, but is otherwise ignored.",
        "Reduce the amount of time that the system waits to reset the permissions.",
        "It is up to you which road you take, but I found the solution helpful, especially if you use a base class for all of your activities.",
        "There are several considerations when using these approaches:",
        "Preparing the ViewPager For step one, open MainActivity.kt and remove everything inside onCreate ( ), below this line:",
        "Creating an instance of UserRemoteDataSource is not that expensive, so scoping it to the component's lifecycle is not necessary.",
        "and not:",
        "This can be done by adding an onCreateOptionsMenu method to the fragment directly.",
        "Also, if you're only interested in the completion of your task, not return values, you should probably look into LINK instead of LINK.",
        "In Android, this pattern is common in details screens where the id of the element to show is only known at runtime, not at compile time when Dagger generates the DI graph.",
        "If you haven't done so already, read the topic Content provider basics to learn more about providers and how they work.",
        "If the user denied the permission instead, gracefully degrade your app experience so that it provides functionality to the user, even without the information that's protected by that permission.",
        "When an event appears upstream ( UUID ), it is delegated to one of 10 `` rails'' -- concurrent, independent pipelines.",
        "So ideally we also would have an easy way of processing an array of businesses into an ArrayList of Business objects.",
        "Back navigation is how users move backward through the history of screens they previously visited.",
        "From version 8.0.0 of the Twilio Helper Library, the type of future returned is now a CompletableFuture which has a.",
        "How to Post to DZone",
        "- the explicit creation of multiple threads",
        "The steps are explained in more detail below.",
        "Granting and revoking runtime permissions:",
        "A good implementation that never crashes your app would be:",
        "This lesson describes how to use these standard request types.",
        "As long as the audio source options work, you should be good to go.",
        "About the authorDanny is a full-stack software engineer with 7 + years of experience doing project management and building web and mobile applications.",
        "The problem in the first case is that Dagger is overeager to use a single static factory instance for generating instances of scoped generic classes.",
        "I guess all that's really missing in the generated code is a typecast to Provider to achieve erasure bliss.",
        "That's all there was to it.",
        "Creating threads is expensive, so you should create a thread pool only once as your app initializes."
    ],
    "1": {
        "run_cnt": 1,
        "overall": {
            "precision": [
                0.6260938991373811
            ],
            "recall": [
                0.6702044649284545
            ],
            "fscore": [
                0.6268760876210546
            ]
        },
        "api": {
            "precision": [
                0.615641126250306
            ],
            "recall": [
                0.6701894485985397
            ],
            "fscore": [
                0.6234913675511143
            ]
        },
        "so": {
            "precision": [
                0.6536904761904762
            ],
            "recall": [
                0.7307739938080495
            ],
            "fscore": [
                0.6697474747474749
            ]
        },
        "git": {
            "precision": [
                0.6538461538461539
            ],
            "recall": [
                0.6538461538461539
            ],
            "fscore": [
                0.6538461538461539
            ]
        },
        "misc": {
            "precision": [
                0.5813016253663736
            ],
            "recall": [
                0.574723036819811
            ],
            "fscore": [
                0.5498184737385953
            ]
        }
    },
    "2": {
        "run_cnt": 1,
        "overall": {
            "precision": [
                0.5435104147994002
            ],
            "recall": [
                0.5242521095085741
            ],
            "fscore": [
                0.5111855484963649
            ]
        },
        "api": {
            "precision": [
                0.5292132048610091
            ],
            "recall": [
                0.49895202703306923
            ],
            "fscore": [
                0.4715259155780124
            ]
        },
        "so": {
            "precision": [
                0.5810721761664177
            ],
            "recall": [
                0.5747237562720066
            ],
            "fscore": [
                0.5566016284122691
            ]
        },
        "git": {
            "precision": [
                0.43103448275862066
            ],
            "recall": [
                0.4166666666666667
            ],
            "fscore": [
                0.423728813559322
            ]
        },
        "misc": {
            "precision": [
                0.5473939600646551
            ],
            "recall": [
                0.525631946646614
            ],
            "fscore": [
                0.5240717378857325
            ]
        }
    },
    "3": {
        "run_cnt": 1,
        "overall": {
            "precision": [
                0.49674956533548864
            ],
            "recall": [
                0.5224324776624844
            ],
            "fscore": [
                0.4939403134796838
            ]
        },
        "api": {
            "precision": [
                0.5174235690784986
            ],
            "recall": [
                0.5380157905518514
            ],
            "fscore": [
                0.5166616248853091
            ]
        },
        "so": {
            "precision": [
                0.4707912457912458
            ],
            "recall": [
                0.45904422375010606
            ],
            "fscore": [
                0.44746458450101906
            ]
        },
        "git": {
            "precision": [
                NaN
            ],
            "recall": [
                NaN
            ],
            "fscore": [
                NaN
            ]
        },
        "misc": {
            "precision": [
                0.495142546555718
            ],
            "recall": [
                0.5650429810557064
            ],
            "fscore": [
                0.5101209605841812
            ]
        }
    },
    "4": {
        "run_cnt": 1,
        "overall": {
            "precision": [
                0.5803353835417095
            ],
            "recall": [
                0.6153111038108141
            ],
            "fscore": [
                0.5762236825975054
            ]
        },
        "api": {
            "precision": [
                0.551969696969697
            ],
            "recall": [
                0.5858750684181719
            ],
            "fscore": [
                0.5581333212912161
            ]
        },
        "so": {
            "precision": [
                0.621031746031746
            ],
            "recall": [
                0.6869047619047619
            ],
            "fscore": [
                0.5964285714285714
            ]
        },
        "git": {
            "precision": [
                0.5285805626598465
            ],
            "recall": [
                0.5352207977207977
            ],
            "fscore": [
                0.5261098852603707
            ]
        },
        "misc": {
            "precision": [
                0.6591836734693878
            ],
            "recall": [
                0.6911764705882353
            ],
            "fscore": [
                0.6722222222222223
            ]
        }
    },
    "5": {
        "run_cnt": 1,
        "overall": {
            "precision": [
                0.5665270424381152
            ],
            "recall": [
                0.59903792283537
            ],
            "fscore": [
                0.5549194975500344
            ]
        },
        "api": {
            "precision": [
                0.539946399815965
            ],
            "recall": [
                0.5611789007537888
            ],
            "fscore": [
                0.5204903893708448
            ]
        },
        "so": {
            "precision": [
                0.5825527360066833
            ],
            "recall": [
                0.6575525357262673
            ],
            "fscore": [
                0.5861056094068703
            ]
        },
        "git": {
            "precision": [
                NaN
            ],
            "recall": [
                NaN
            ],
            "fscore": [
                NaN
            ]
        },
        "misc": {
            "precision": [
                0.5894605220502745
            ],
            "recall": [
                0.5841168091168091
            ],
            "fscore": [
                0.5707198620395697
            ]
        }
    },
    "6": {
        "run_cnt": 1,
        "overall": {
            "precision": [
                0.5817157024636551
            ],
            "recall": [
                0.5957751371502441
            ],
            "fscore": [
                0.5614852749697155
            ]
        },
        "api": {
            "precision": [
                0.5612892170958861
            ],
            "recall": [
                0.5994580545716909
            ],
            "fscore": [
                0.562674286778805
            ]
        },
        "so": {
            "precision": [
                0.5874972516722876
            ],
            "recall": [
                0.5750730994152047
            ],
            "fscore": [
                0.5703958484881261
            ]
        },
        "git": {
            "precision": [
                0.6054613935969868
            ],
            "recall": [
                0.6462913007710114
            ],
            "fscore": [
                0.5377805285500583
            ]
        },
        "misc": {
            "precision": [
                0.571999361628693
            ],
            "recall": [
                0.5810033735373825
            ],
            "fscore": [
                0.5672338590296278
            ]
        }
    },
    "7": {
        "run_cnt": 1,
        "overall": {
            "precision": [
                0.5458110418992772
            ],
            "recall": [
                0.5563503069781611
            ],
            "fscore": [
                0.5345410298262848
            ]
        },
        "api": {
            "precision": [
                0.5334028471528471
            ],
            "recall": [
                0.5350734512049421
            ],
            "fscore": [
                0.5220500545363234
            ]
        },
        "so": {
            "precision": [
                0.5352564102564102
            ],
            "recall": [
                0.5645833333333334
            ],
            "fscore": [
                0.5214171245421245
            ]
        },
        "git": {
            "precision": [
                NaN
            ],
            "recall": [
                NaN
            ],
            "fscore": [
                NaN
            ]
        },
        "misc": {
            "precision": [
                0.5917366946778712
            ],
            "recall": [
                0.5824379658142544
            ],
            "fscore": [
                0.5857707909745284
            ]
        }
    },
    "8": {
        "run_cnt": 1,
        "overall": {
            "precision": [
                0.5403525809625256
            ],
            "recall": [
                0.5764879158640721
            ],
            "fscore": [
                0.5415981258300138
            ]
        },
        "api": {
            "precision": [
                0.5768115942028985
            ],
            "recall": [
                0.6058080808080808
            ],
            "fscore": [
                0.5724386724386724
            ]
        },
        "so": {
            "precision": [
                0.5634028382318396
            ],
            "recall": [
                0.6264121885797418
            ],
            "fscore": [
                0.5684977868243352
            ]
        },
        "git": {
            "precision": [
                0.5136363636363637
            ],
            "recall": [
                0.5144927536231884
            ],
            "fscore": [
                0.5134502923976607
            ]
        },
        "misc": {
            "precision": [
                0.425
            ],
            "recall": [
                0.4300699300699301
            ],
            "fscore": [
                0.42736588306208567
            ]
        }
    },
    "9": {
        "run_cnt": 1,
        "overall": {
            "precision": [
                0.5615985134763989
            ],
            "recall": [
                0.5811499578758897
            ],
            "fscore": [
                0.5549161364516578
            ]
        },
        "api": {
            "precision": [
                0.5312761982868599
            ],
            "recall": [
                0.5385521978021979
            ],
            "fscore": [
                0.534344376445336
            ]
        },
        "so": {
            "precision": [
                0.628798449612403
            ],
            "recall": [
                0.6785584886128364
            ],
            "fscore": [
                0.6201948517811042
            ]
        },
        "git": {
            "precision": [
                0.519927536231884
            ],
            "recall": [
                0.5535714285714286
            ],
            "fscore": [
                0.514554794520548
            ]
        },
        "misc": {
            "precision": [
                0.5061038011695906
            ],
            "recall": [
                0.48886326671057584
            ],
            "fscore": [
                0.49504613666031405
            ]
        }
    }
}