{
    "0": {
        "run_cnt": 1,
        "overall": {
            "precision": [
                0.510677136102668
            ],
            "recall": [
                0.49305745490632286
            ],
            "fscore": [
                0.4833062543533109
            ]
        },
        "api": {
            "precision": [
                0.4648936170212766
            ],
            "recall": [
                0.4776876267748479
            ],
            "fscore": [
                0.46797626355637406
            ]
        },
        "so": {
            "precision": [
                0.5402777777777777
            ],
            "recall": [
                0.5364583333333334
            ],
            "fscore": [
                0.5059523809523809
            ]
        },
        "git": {
            "precision": [
                0.5555555555555556
            ],
            "recall": [
                0.5870967741935484
            ],
            "fscore": [
                0.5566502463054187
            ]
        },
        "misc": {
            "precision": [
                0.4523809523809524
            ],
            "recall": [
                0.3275862068965517
            ],
            "fscore": [
                0.37999999999999995
            ]
        }
    },
    "venn_diagram_set": [
        "When a scale -LRB- ie, pinch -RRB- gesture is detected, then the scale factor is used to resize the ImageView.",
        "Next, you'll need to initiate the permission request and handle the result.",
        "Here's a bit of code to get EXPLAIN QUERY PLAN results into Android logcat from a running Android app.",
        "Set the audio encoder using setAudioEncoder ( ).",
        "If you want to render a PDF, you create a renderer and for every page you want to render, you open the page, render it, and close the page.",
        "You can read more about this on the material design guidelines which state: `` The use of application icon plus title as a standard layout is discouraged on API 21 devices and newer.''",
        "This bug incorrectly sets the drawable bounds to 0 -LRB- or negative in the case of an inset drawable -RRB-.",
        "The use of application icon plus title as a standard layout is discouraged on API 21 devices and newer.",
        "If you would like an application icon -LRB- but I discourage it -RRB-, you can use the method setLogo -LRB- -RRB-.",
        "During deserialization, you would want Jackson to deserialize the `` Vehicle'' JSON object to the appropriate `` Car'' or `` Plane'' class.",
        "The FragmentStatePagerAdapter will stop creating new fragments when the current index reaches the number of objects returned by getCount ( ), so you need to change the method to return a fairly large number that the users are not very likely to reach by continuously swiping in the same direction.",
        "If you are using this class to rasterize a PDF for printing or show a print preview, it is recommended that you respect the following contract in order to provide a consistent user experience when seeing a preview and printing, i.e. the user sees a preview that is the same as the printout.",
        "Values may be any mix of JSONObjects, JSONArrays, Strings, Booleans, Integers, Longs, Doubles or NULL.",
        "If the user presses and holds the button, then onKeyDown ( ) is called multiple times.",
        "Then inside of the interceptor, you can verify if the request is annotated or no.",
        "Now add the following code in your PdfRenderActivity -- 7.",
        "Beginning in Android 6.0 -LRB- API level 23 -RRB-, users grant permissions to apps while the app is running, not when they install the app.",
        "with the api 23, permission <uses-permission android:name=\"android.pemission.READ_CONTACTS\"/> dont work, change the api level in the emulator for api 22 -LRB- lollipop -RRB- or lower",
        "that is done because rotation is around the top left point ( the origin ) of the view.",
        "Anyone with HTTP POST knowledge could put random data inside of the g-recaptcha-response form field, and foll your site to make it think that this field was provided by the google widget.",
        "This line means: add a meta-property on serialization or read a meta-property on deserialization -LRB- include = JsonTypeInfo.As.PROPERTY -RRB- called'' @class'' -LRB- property ='' @class'' -RRB- that holds the fully-qualified Java class name -LRB- use = JsonTypeInfo.Id.CLASS -RRB-.",
        "So really you want to replace:",
        "Note that in the zip function, the parameters have concrete types that correspond to the types of the observables being zipped.",
        "You need to have implement a LINK and declare it in the AndroidManifest.xml.",
        "For example, if you added three callbacks named one, two and three in order, they would be invoked in the order of three, two, and one, respectively.",
        "You can either rotate your bitmap when you draw it by using a matrix:",
        "You may extend it from BaseAdapter.",
        "When doing so, the callbacks are invoked in the reverse order in which they are added - the callback added last is the first given a chance to handle the Back button event.",
        "A Toolbar is a generalization of action bars for use within application layouts.",
        "Since the version of Retrofit 2.6.0, you can get the annotations in OkHttp Interceptor using the tag field like this:",
        "It triggers when you scroll the view -LRB- list for example -RRB-.",
        "reCAPTCHA is a free service that uses an advanced risk analysis engine to protect your app from spam and other abusive actions.",
        "If you are using Android Studio, or if you are using Gradle from the command line, you can add your own stuff to BuildConfig or otherwise tweak the debug and release build types to help distinguish these situations at runtime.",
        "It wasn't until I moved the * uses-permission ... READ_CONTACTS * line to outside the application tag that things worked.",
        "basically I used a private string property taken as a string to construct a computed property with that enum correspondance.",
        "Before using the reCAPTCHA API, you need to add the SafetyNet API to your project.",
        "Use EXPLAIN QUERY PLAN on your queries to see which index would be used or if the query requires a full table scan.",
        "You can also do it by rotating the canvas before drawing:",
        "This is a boolean value that will be true for a debug build, false otherwise:",
        "And replace the response_string with the value that you earlier got by the g-recaptcha-response field.",
        "The simplest, and best long-term solution, is to use BuildConfig.DEBUG.",
        "inject.Scope annotation - Dependencies declared with that scope with have caching Provider with double-check lock generated and only single instance will be created for it within component declared with the same scope and its creation will be thread safe.",
        "You use them following the same basic pattern you use for other types of requests.",
        "Unscoped dependency will have simple Provider generated without any caching and any instance of that dependency created in component will be new for every new injection -LRB- as in constructor, or in module provision method, or just as a field -RRB-.",
        "You can develop these things yourself, but if you would like to use a pre-made custom view, copy LINK into your project and use it like a normal ImageView.",
        "Use ANALYZE to allow SQLite's query planner to work more efficiently.",
        "It is worth noting that apparently Dagger2 creates a single instance per scoped provider in a module per component.",
        "To overcome this, I have created a custom ViewPager -LRB- based on LINK -RRB- that calculates it's height in the required manner.",
        "Displaying ActionBar Icon In the new Android 5.0 material design guidelines, the style guidelines have changed to discourage the use of the icon in the ActionBar.",
        "When GCM delivers a message to your device, BroadcastReceiver will receive the message and call the onReceive -LRB- -RRB- function, wherein you may start a service to actually perform the intended task for you.",
        "After that override getView -LRB- -RRB- method and make sure to return your custom View there.",
        "Android-Lollipop -LRB- api 21 -RRB- introduce a new API: LINK",
        "I am using mic to record phone audio and also use the Telephony manager to find the calling state.",
        "After adding this code, our `` MainActivity'' should look like this:",
        "Now Android allows you to decide which permissions to accept on a case-by-case basis -- after the app is installed.",
        "But the easiest option is to generate java code directly and your generated java classes will be picked up by javac automatically, launching second round of annotation processing, where dagger will process them.",
        "The `` onConnected'' method will look like this:",
        "get a seekable file descriptor from your pdf document:",
        "Dangerous permission groups, however, can give apps access to things like your calling history, private messages, location, camera, microphone, and more.",
        "to this approach instead leveraging add, show, and hide in the FragmentTransaction:",
        "A typical use of the APIs to render a PDF looks like this:",
        "If you have more complex queries that can't make use of any indexes that you might create, you can de-normalize your schema, structuring your data in such a way that the queries are simpler and can be answered using indexes.",
        "Using this approach, all three fragments will remain in the container once added initially and then we are simply revealing the desired fragment and hiding the others within the container.",
        "ComponentActivity, the base class for FragmentActivity and AppCompatActivity, allows you to control the behavior of the Back button by using its OnBackPressedDispatcher, which you can retrieve by calling getOnBackPressedDispatcher ( ).",
        "While developing for a target platform of 2.3.3 using Eclipse on Ubuntu, I had permission failures in the log file that indicated I needed this exact line while working on something similar.",
        "To do this, we need to create our own custom ArrayAdapter class.",
        "Gets a View that displays in the drop down popup the data at the specified position in the data set.",
        "For simplicity in rendering a camera preview, you should change your application's preview activity orientation to landscape by adding the following to your manifest.",
        "We can create a custom ListView of User objects by subclassing ArrayAdapter to describe how to translate the object into a view within that class and then using it like any other adapter.",
        "That means, that the widget will take care of asking questions, validating responses all the way till it determines that a user is actually a human, only then you get a g-recaptcha-response value.",
        "You set this text view a width of `` wrap_content'' it means, what ever the text is, the view take the size of the text.",
        "First of all your Animal class with the Json Annotations for the subclasses.",
        "How to make a dependency injectable To make an object embeddable in Hilt, you need to tell Hilt how to instantiate that object.",
        "Consider the following below: If you have a JSON object for `` Vehicle'', it could be a `` Car'' or `` Plane'', each with its own fields, some unique to the other.",
        "So the correct way to do this is:",
        "The cool thing about the new Google Recaptcha is that the validation is now completely encapsulated in the widget.",
        "Usually, you should use onKeyUp ( ) if you want to be sure that you receive only one event.",
        "This tells the ViewPager to display the movie found in the middle of the array.",
        "Make sure you have the icon set in the manifest.xml file, in the application tag as:",
        "To be able to record, your app must tell the user that it will access the device's audio input.",
        "I would suggest that you write your downloaded JSON out to a file and compare it with your original to see if there is a problem with the download logic.",
        "The following example code demonstrates how to create a basic camera preview class that can be included in a View layout.",
        "These are permissions that are requested while the app is running ( instead of before the app is installed ).",
        "with some custome code which simply draws a drawable icon.",
        "Since getCount ( ) now returns a number larger than the size of the list, the ViewPager will try to access the movie at an index greater than the array size when the user swipes past the last movie.",
        "This class enables rendering a PDF document.",
        "Pin down exactly which queries you need to optimize.",
        "To handle an individual key press, implement onKeyDown ( ) or onKeyUp ( ) as appropriate.",
        "So in order to get a scoped provider in a module, you need to specify the scope for your module's provider method."
    ],
    "1": {
        "run_cnt": 1,
        "overall": {
            "precision": [
                0.5572326510834613
            ],
            "recall": [
                0.5958725424901895
            ],
            "fscore": [
                0.5234671303585554
            ]
        },
        "api": {
            "precision": [
                0.6411764705882352
            ],
            "recall": [
                0.6666666666666667
            ],
            "fscore": [
                0.6507936507936508
            ]
        },
        "so": {
            "precision": [
                0.5594940476190476
            ],
            "recall": [
                0.6562187812187812
            ],
            "fscore": [
                0.543356799694828
            ]
        },
        "git": {
            "precision": [
                0.46153846153846156
            ],
            "recall": [
                0.35294117647058826
            ],
            "fscore": [
                0.4000000000000001
            ]
        },
        "misc": {
            "precision": [
                0.5573804468708928
            ],
            "recall": [
                0.5526745585569115
            ],
            "fscore": [
                0.48903121810592093
            ]
        }
    },
    "2": {
        "run_cnt": 1,
        "overall": {
            "precision": [
                0.5527381622166436
            ],
            "recall": [
                0.5796931040589087
            ],
            "fscore": [
                0.5410015835621085
            ]
        },
        "api": {
            "precision": [
                0.5527289703760293
            ],
            "recall": [
                0.5889154704944178
            ],
            "fscore": [
                0.5228781800087081
            ]
        },
        "so": {
            "precision": [
                0.5905365951877579
            ],
            "recall": [
                0.5959903192046049
            ],
            "fscore": [
                0.5847864427574573
            ]
        },
        "git": {
            "precision": [
                NaN
            ],
            "recall": [
                NaN
            ],
            "fscore": [
                NaN
            ]
        },
        "misc": {
            "precision": [
                0.5243962313687689
            ],
            "recall": [
                0.5605534178730048
            ],
            "fscore": [
                0.5217554918306474
            ]
        }
    },
    "3": {
        "run_cnt": 1,
        "overall": {
            "precision": [
                0.524739437999207
            ],
            "recall": [
                0.5203942717910274
            ],
            "fscore": [
                0.4981724404294935
            ]
        },
        "api": {
            "precision": [
                0.5079835766423357
            ],
            "recall": [
                0.481178694820305
            ],
            "fscore": [
                0.4539239174449942
            ]
        },
        "so": {
            "precision": [
                0.5734848484848485
            ],
            "recall": [
                0.5681433775696071
            ],
            "fscore": [
                0.5638561067060053
            ]
        },
        "git": {
            "precision": [
                NaN
            ],
            "recall": [
                NaN
            ],
            "fscore": [
                NaN
            ]
        },
        "misc": {
            "precision": [
                0.5011278195488722
            ],
            "recall": [
                0.5314685314685315
            ],
            "fscore": [
                0.4988615586297306
            ]
        }
    },
    "4": {
        "run_cnt": 1,
        "overall": {
            "precision": [
                0.5154957134368899
            ],
            "recall": [
                0.6638017550364602
            ],
            "fscore": [
                0.5114354070280909
            ]
        },
        "api": {
            "precision": [
                NaN
            ],
            "recall": [
                NaN
            ],
            "fscore": [
                NaN
            ]
        },
        "so": {
            "precision": [
                0.4873737373737374
            ],
            "recall": [
                0.6333333333333333
            ],
            "fscore": [
                0.4753484501768255
            ]
        },
        "git": {
            "precision": [
                0.5263655462184874
            ],
            "recall": [
                0.5649641577060932
            ],
            "fscore": [
                0.5288135593220339
            ]
        },
        "misc": {
            "precision": [
                0.55
            ],
            "recall": [
                0.9224137931034483
            ],
            "fscore": [
                0.5488530161427357
            ]
        }
    },
    "5": {
        "run_cnt": 1,
        "overall": {
            "precision": [
                0.5087454966024774
            ],
            "recall": [
                0.4885363055270001
            ],
            "fscore": [
                0.49310335894841906
            ]
        },
        "api": {
            "precision": [
                0.4897709204454729
            ],
            "recall": [
                0.4715913370998117
            ],
            "fscore": [
                0.479663786554133
            ]
        },
        "so": {
            "precision": [
                0.5037592592592594
            ],
            "recall": [
                0.4888911741852919
            ],
            "fscore": [
                0.48182312398643673
            ]
        },
        "git": {
            "precision": [
                NaN
            ],
            "recall": [
                NaN
            ],
            "fscore": [
                NaN
            ]
        },
        "misc": {
            "precision": [
                0.5541740049313139
            ],
            "recall": [
                0.5218939393939394
            ],
            "fscore": [
                0.5369028561799647
            ]
        }
    },
    "6": {
        "run_cnt": 1,
        "overall": {
            "precision": [
                0.516725352745919
            ],
            "recall": [
                0.5426921662449461
            ],
            "fscore": [
                0.5108348634481573
            ]
        },
        "api": {
            "precision": [
                0.510142400464981
            ],
            "recall": [
                0.5193764568764568
            ],
            "fscore": [
                0.497293073408559
            ]
        },
        "so": {
            "precision": [
                0.5304369375244555
            ],
            "recall": [
                0.5743760347937826
            ],
            "fscore": [
                0.5256091522059958
            ]
        },
        "git": {
            "precision": [
                NaN
            ],
            "recall": [
                NaN
            ],
            "fscore": [
                NaN
            ]
        },
        "misc": {
            "precision": [
                0.48902934308051577
            ],
            "recall": [
                0.48679820424134435
            ],
            "fscore": [
                0.48744093159315927
            ]
        }
    },
    "7": {
        "run_cnt": 1,
        "overall": {
            "precision": [
                0.5220721777586953
            ],
            "recall": [
                0.5095268366844865
            ],
            "fscore": [
                0.48045966359767417
            ]
        },
        "api": {
            "precision": [
                0.536092530657748
            ],
            "recall": [
                0.5752136752136752
            ],
            "fscore": [
                0.538433908045977
            ]
        },
        "so": {
            "precision": [
                0.503968253968254
            ],
            "recall": [
                0.44551282051282054
            ],
            "fscore": [
                0.4068783068783069
            ]
        },
        "git": {
            "precision": [
                NaN
            ],
            "recall": [
                NaN
            ],
            "fscore": [
                NaN
            ]
        },
        "misc": {
            "precision": [
                0.5352077105453046
            ],
            "recall": [
                0.5398610224127969
            ],
            "fscore": [
                0.532857454228422
            ]
        }
    },
    "8": {
        "run_cnt": 1,
        "overall": {
            "precision": [
                0.5062950937950939
            ],
            "recall": [
                0.4750683981078864
            ],
            "fscore": [
                0.4692952975416904
            ]
        },
        "api": {
            "precision": [
                NaN
            ],
            "recall": [
                NaN
            ],
            "fscore": [
                NaN
            ]
        },
        "so": {
            "precision": [
                0.5358585858585858
            ],
            "recall": [
                0.5724486241727621
            ],
            "fscore": [
                0.5182551653139889
            ]
        },
        "git": {
            "precision": [
                0.4772727272727273
            ],
            "recall": [
                0.3387096774193548
            ],
            "fscore": [
                0.39622641509433965
            ]
        },
        "misc": {
            "precision": [
                0.47619047619047616
            ],
            "recall": [
                0.4166666666666667
            ],
            "fscore": [
                0.4444444444444445
            ]
        }
    },
    "9": {
        "run_cnt": 1,
        "overall": {
            "precision": [
                0.5289494683337794
            ],
            "recall": [
                0.5437888150326281
            ],
            "fscore": [
                0.5096536702258685
            ]
        },
        "api": {
            "precision": [
                0.48411801632140616
            ],
            "recall": [
                0.44495607071027843
            ],
            "fscore": [
                0.4635093167701863
            ]
        },
        "so": {
            "precision": [
                0.5783720930232558
            ],
            "recall": [
                0.647897632380391
            ],
            "fscore": [
                0.563898931389194
            ]
        },
        "git": {
            "precision": [
                NaN
            ],
            "recall": [
                NaN
            ],
            "fscore": [
                NaN
            ]
        },
        "misc": {
            "precision": [
                0.49964698331193835
            ],
            "recall": [
                0.4864583333333333
            ],
            "fscore": [
                0.47443013193656214
            ]
        }
    }
}