{
    "task": "andriod aws cleanTransferListener not working",
    "description": "andriod aws cleanTransferListener not working in my app. I am using S3Transfer Utility to transfer data from local to server. I am using Wifi Data and my Sdk version is 2.2.7.\n\n```\nI have set observer.setTransferListener(new UploadListener()); Listener while uploading my Image and video file on amazon s3 server. But when I am trying to clear Listener , It wouldn't be clear Listener. \n```\n\nWhy I am getting this problem. Any Provide me solution on this issue ASAP\n",
    "type": "GIT",
    "link": "https://github.com/aws-amplify/aws-sdk-android/issues/73",
    "question_id": "73",
    "resources": {
        "api": [],
        "git": [
            {
                "link": "https://github.com/aws-amplify/aws-sdk-android/issues/958",
                "content": [
                    "TransferUtility does not update the TransferListener when the preferred network type is not available · Issue # 958 · aws-amplify/aws-sdk-android · GitHub",
                    "TransferUtility does not update the TransferListener when the preferred network type is not available",
                    "When using the following method",
                    "in airplane mode, TransferStatusUpdater won't notify any listener because is not added by the time TransferRecord.checkPreferredNetworkAvailability has been called.",
                    "A code sample or steps:",
                    "Which AWS service ( s ) are affected ?",
                    "Debugging TransferUtility class you can see the following.",
                    "then the listener would be called.",
                    "The text was updated successfully, but these errors were encountered:",
                    "-LSB- S3 -RSB- -LSB- TransferUtility -RSB- Register TransferListener before submitting a transfer job",
                    "@GerardoRobledo Thank you for the detailed analysis.",
                    "I have submitted PR # 961 to fix the issue.",
                    "I will update this thread when the fix is released.",
                    "S3 Missing TransferUtility state in airplane mode",
                    "This has been fixed in 2.13.5 version of the SDK.",
                    ""
                ],
                "title": "TransferUtility does not update the TransferListener when the preferred network type is not available · Issue # 958 · aws-amplify/aws-sdk-android · GitHub"
            }
        ],
        "qa": [],
        "other": [
            {
                "link": "https://aws.amazon.com/blogs/mobile/introducing-the-transfer-utility-for-the-aws-sdk-for-android",
                "type": "misc",
                "content": [
                    "Click here to return to Amazon Web Services homepage",
                    "Contact Sales Support English My Account",
                    "Products Solutions Pricing Documentation Learn Partner Network AWS Marketplace Customer Enablement Events Explore More",
                    "عربي Bahasa Indonesia Deutsch English Español Français Italiano Português",
                    "Tiếng Việt Türkçe Ρусский ไทย 日本語 한국어 中文 ( 简体 ) 中文 ( 繁體 )",
                    "AWS Management Console Account Settings Billing & Cost Management Security Credentials AWS Personal Health Dashboard",
                    "Support Center Knowledge Center AWS Support Overview",
                    "Products Solutions Pricing Introduction to AWS Getting Started Documentation Training and Certification Developer Center Customer Success Partner Network AWS Marketplace Support Log into Console Download the Mobile App",
                    "Blog Home Category Edition Follow",
                    "Architecture AWS Cost Management AWS Partner Network AWS Podcast AWS Marketplace AWS News Big Data Business Productivity Compute Contact Center Containers Database Desktop & Application Streaming Developer DevOps Enterprise Strategy Front-End Web & Mobile Game Tech",
                    "HPC Infrastructure & Automation Industries Internet of Things Machine Learning Management & Governance Media Messaging & Targeting Modernizing with AWS Networking & Content Delivery Open Source Public Sector Quantum Computing Robotics SAP Security, Identity, & Compliance Startups Storage Training & Certification",
                    "中国版 Édition Française Deutsche Edition 日本版 한국 에디션 Edição em Português Edición en Español English Edition Версия на русском Edisi Bahasa Indonesia",
                    "Introducing the Transfer Utility for the AWS SDK for Android",
                    "by Weston Edwards | on 22 JUL 2015 | Permalink | Comments | Share",
                    "Last year, as part of the Version 2 release of the AWS Mobile SDK for Android, we introduced the ability to pause and resume transfers.",
                    "Since then, we have received helpful feedback from the community, and learned more about the needs of mobile developers like you.",
                    "Today we are pleased to announce the introduction of a new and easier way to transfer data between your Android app and Amazon S3, the S3 Transfer Utility for the AWS SDK for Android.",
                    "What is difference between the Transfer Utility and the Transfer Manager ?",
                    "The Transfer Utility is a new client, with many of the same features as the Transfer Manager, but designed to be simpler and more efficient to use.",
                    "Some of the feature enhancements include:",
                    "It uses the local SQLite database to persist all metadata about transfers, allowing them to be paused and resumed without the developer having to serialize or persist any data.",
                    "It utilizes native Android Services so you don't have to worry about threading or the app being killed.",
                    "It automatically pauses and resumes transfers when internet connectivity is lost and regained.",
                    "It has general configuration improvements for performance with S3 on mobile.",
                    "The detailed differences are described in the sections below.",
                    "Uploading and Downloading The Transfer Manager has APIs that support the use of I/O streams.",
                    "With these APIs, pausing and resuming was not possible.",
                    "Additionally, you had to specify the content size ahead of time, further reducing the usefulness of streams.",
                    "With the Transfer Utility there is one file based API for uploading and downloading, which you can always pause or resume ( on top of the automatic pause and resume functionality described below ).",
                    "Tracking Transfer Progress The Transfer Utility makes tracking transfers more mobile friendly.",
                    "The primary way of tracking transfers is through instances of the TransferObserver class.",
                    "TransferObserver instances are returned from the download ( ) and upload ( ) methods.",
                    "They are automatically saved to local storage and can be queried for based on id, type ( upload, download, or any ), or state ( such as paused ) from anywhere within the app as shown below.",
                    "TransferObservers gives access to the state, the total bytes transferred thus far, the total bytes to transfer ( for easily calculating progress bars ), and a unique ID you can use to keep track of distinct transfers.",
                    "You can also specify a TransferListener, which will be updated on state or progress change, as well as if an error occurs.",
                    "Pausing Transfers With the Transfer Manager, there is no guarantee a transfer can be paused, and there are multiple ways to attempt to pause.",
                    "Also, pauses require developers to serialize metadata about the transfer to persistent storage which they must manage.",
                    "The Transfer Utility handles persisting of all transfer metadata for you.",
                    "If an app is killed, crashes, or loses internet connectivity, transfers are automatically paused.",
                    "You can manually pause a transfer by id with pause ( transferId ), pause all downloads ( or uploads ) with pauseAllWithType ( TransferType.DOWNLOAD ), or pause all transfers with pauseAllWithType ( TransferType.ANY ).",
                    "Resuming Transfers The Transfer Utility automatically pauses transfers in many scenarios.",
                    "In the case that your transfer was paused due to loss of network connectivity, it will automatically resume when the network is available again.",
                    "In the case that the transfer is manually paused, or the app is killed, it can be resumed with the resume ( transferId ) method.",
                    "Summary and Transfer Manager deprecation plan Overall, we have built the Transfer Utility as an improvement and simplification over the Transfer Manager.",
                    "We believe it fits better with the needs of customers and helps accelerate high quality app development.",
                    "The Transfer Utility will replace the Transfer Manager, and going forward the Transfer Manager will be deprecated.",
                    "To help customers migrate from the Transfer Manager to the new Transfer Utility, we have posted a migration guide.",
                    "Additional help, and request for feedback The step by step Getting Started Guide The Sample on GitHub The latest SDK API Reference As always, we really appreciate community feedback: as a comment on this blog, a post on our forums, or as a GitHub issue.",
                    "AWS AppSync AWS Device Farm Amazon Pinpoint AWS Amplify",
                    "AWS for Mobile Facebook LinkedIn Twitch Email Updates",
                    "Sign In to the Console",
                    "What Is Cloud Computing ?",
                    "AWS Inclusion, Diversity & Equity What Is DevOps ?",
                    "What Is a Container ?",
                    "What Is a Data Lake ?",
                    "AWS Cloud Security What's New Blogs Press Releases",
                    "Getting Started Training and Certification AWS Solutions Portfolio Architecture Center Product and Technical FAQs Analyst Reports AWS Partner Network",
                    "Developer Center SDKs & Tools.",
                    "NET on AWS Python on AWS Java on AWS PHP on AWS Javascript on AWS",
                    "Contact Us AWS Careers File a Support Ticket Knowledge Center AWS Support Overview Legal",
                    "Amazon is an Equal Opportunity Employer: Minority / Women / Disability / Veteran / Gender Identity / Sexual Orientation / Age.",
                    "Language عربي Bahasa Indonesia Deutsch English Español Français Italiano Português Tiếng Việt Türkçe Ρусский ไทย 日本語 한국어 中文 ( 简体 ) 中文 ( 繁體 )",
                    "Privacy | Site Terms | Cookie Preferences | © 2021, Amazon Web Services, Inc. or its affiliates.",
                    ""
                ],
                "title": "Introducing the Transfer Utility for the AWS SDK for Android | Front-End Web & Mobile"
            }
        ]
    },
    "parsed": true
}