{
    "task": "Support for GoogleApiClient and new FusedLocationProviderApi",
    "description": "Hello,\n\nI am wondering whether there is a way to test the new location API in Google Play Services with robolectric\n",
    "type": "GIT",
    "link": "https://github.com/robolectric/robolectric/issues/1425",
    "question_id": "1425",
    "resources": {
        "api": [
            {
                "link": "https://developer.android.com/training/location/retrieve-current",
                "type": "android",
                "content": [
                    "Using the Google Play services location APIs, your app can request the last known location of the user's device.",
                    "In most cases, you are interested in the user's current location, which is usually equivalent to the last known location of the device.",
                    "Specifically, use the fused location provider to retrieve the device's last known location.",
                    "The fused location provider is one of the location APIs in Google Play services.",
                    "It manages the underlying location technology and provides a simple API so that you can specify requirements at a high level, like high accuracy or low power.",
                    "It also optimizes the device's use of battery power.",
                    "Note: When your app is running in the background, access to location should be critical to the core functionality of the app and is accompanied with proper disclosure to users.",
                    "This lesson shows you how to make a single request for the location of a device using the getLastLocation ( ) method in the fused location provider.",
                    "To access the fused location provider, your app's development project must include Google Play services.",
                    "Download and install the Google Play services component via the SDK Manager and add the library to your project.",
                    "For details, see the guide to Setting Up Google Play Services.",
                    "Apps whose features use location services must request location permissions, depending on the use cases of those features.",
                    "In your activity's onCreate ( ) method, create an instance of the Fused Location Provider Client as the following code snippet shows.",
                    "Once you have created the Location Services client you can get the last known location of a user's device.",
                    "When your app is connected to these you can use the fused location provider's getLastLocation ( ) method to retrieve the device location.",
                    "The precision of the location returned by this call is determined by the permission setting you put in your app manifest, as described in the guide on how to request location permissions.",
                    "To request the last known location, call the getLastLocation ( ) method.",
                    "The following code snippet illustrates the request and a simple handling of the response:",
                    "The getLastLocation ( ) method returns a Task that you can use to get a Location object with the latitude and longitude coordinates of a geographic location.",
                    "The location object may be null in the following situations:",
                    "You might expect the Location object that's contained in the most recent call to getLastLocation ( ) to be the most accurate.",
                    "However, because the accuracy of a location varies, the most recent value isn't necessarily the best.",
                    "You should include logic for choosing which location to show based on several criteria.",
                    "The set of criteria also varies, depending on the use cases of your app and results from field testing.",
                    "To validate the accuracy of a location that's returned from getLastLocation ( ), complete steps that include the following:",
                    "Location is turned off in the device settings.",
                    "The result could be null even if the last location was previously retrieved because disabling location also clears the cache.",
                    "The device never recorded its location, which could be the case of a new device or a device that has been restored to factory settings.",
                    "Google Play services on the device has restarted, and there is no active Fused Location Provider client that has requested location after the services restarted.",
                    "To avoid this situation you can create a new client and request location updates yourself.",
                    "For more information, see Receiving Location Updates.",
                    "Check whether the location retrieved is significantly newer than the previously fetched location.",
                    "Check whether the accuracy claimed by the location is better or worse than that of the previous estimate.",
                    "Check the provider that's associated with the new location.",
                    "Decide whether you trust this provider more than the one used in your app's cached location.",
                    ""
                ],
                "title": "Get the last known location  |  Android Developers"
            }
        ],
        "git": [
            {
                "link": "https://github.com/mcharmas/Android-ReactiveLocation/issues/158",
                "content": [
                    "Use GPS in background service · Issue # 158 · mcharmas/Android-ReactiveLocation · GitHub",
                    "Use GPS in background service",
                    "I have a service, where I get location updates.",
                    "If I will close app ( hide, back button ), service steel works and app give me not GPS location.",
                    "I don't see icon about GPS connection in status bar.",
                    "As you see, I was set up Priority to PRIORITY_HIGH_ACCURACY, but getting not GPS location.",
                    "I need something like this: LocationManager.GPS _ PROVIDER",
                    "Please, tell me, how to use GPS connection in background service ?",
                    "Sorry for my Russian English.",
                    "The text was updated successfully, but these errors were encountered:",
                    "I was resolve this problem with permissions.",
                    "Consider using requestLocationUpdates(LocationRequest locationRequest, PendingIntent intent).",
                    "It may be better for the batter live and performance for your users.",
                    "Corresponding method from GMS: https://developers.google.com/android/reference/com/google/android/gms/location/FusedLocationProviderApi.html#requestLocationUpdates(com.google.android.gms.common.api.GoogleApiClient, com.google.android.gms.location.LocationRequest, android.app.PendingIntent)"
                ],
                "title": "Use GPS in background service · Issue # 158 · mcharmas/Android-ReactiveLocation · GitHub"
            }
        ],
        "qa": [
            {
                "uid": "46481789",
                "link": "https://stackoverflow.com/questions/46481789",
                "title": "Android LocationServices.FusedLocationApi deprecated",
                "answers": [
                    {
                        "uid": 46482065,
                        "score": 157,
                        "text": [
                            "This is happening because FusedLocationProviderApi deprecated in a recent version of google play services.",
                            "You can check it LINK.",
                            "The official guide now suggests using LINK.",
                            "You can find the detailed guide LINK.",
                            "for e.g inside onCreate -LRB- -RRB- or onViewCreated -LRB- -RRB- create a FusedLocationProviderClient instance",
                            "Kotlin",
                            "and for requesting the last known location all you have to do is call",
                            "Java",
                            "and",
                            "Simple, Isn't it ?",
                            "Yesterday Google updated its official developer page with LINK that says",
                            "Please continue using the FusedLocationProviderApi class and don't migrate to the FusedLocationProviderClient class until Google Play services version 12.0.0 is available, which is expected to ship in early 2018.",
                            "Using the FusedLocationProviderClient before version 12.0.0 causes the client app to crash when Google Play services is updated on the device.",
                            "We apologize for any inconvenience this may have caused.",
                            "LINK So I think we should continue using the deprecated LocationServices.FusedLocationApi until Google resolves the issue.",
                            "The warning is gone now.",
                            "LINK says: LINK I think Play Services won't crash when it updates itself in the background.",
                            "So we can use new FusedLocationProviderClient now."
                        ]
                    },
                    {
                        "uid": 46745641,
                        "score": 2,
                        "text": [
                            "Yes, it's deprecated !",
                            "Here are some points you'll need while using new LINK."
                        ]
                    },
                    {
                        "uid": 47951456,
                        "score": 16,
                        "text": [
                            "And our fragment_location.",
                            "xml"
                        ]
                    },
                    {
                        "uid": 48855328,
                        "score": -1,
                        "text": [
                            "problem is with your import statement",
                            "remove this",
                            "add"
                        ]
                    },
                    {
                        "uid": 52093360,
                        "score": -1,
                        "text": [
                            "Please make your Activity implement LocationListener from Google Services, not from Android OS, this worked for me."
                        ]
                    },
                    {
                        "uid": 52456262,
                        "score": -1,
                        "text": [
                            "use getFusedLocationProviderClient instead LocationServices.FusedLocationApi.",
                            "Kotlin",
                            "java"
                        ]
                    },
                    {
                        "uid": 52534820,
                        "score": 4,
                        "text": [
                            "Use this method",
                            "LINK"
                        ]
                    },
                    {
                        "uid": 57012410,
                        "score": 2,
                        "text": [
                            "Yes, it has been deprecated.",
                            "FusedLocationProviderClient is easier than FusedLocationProviderApi, because FusedLocationProviderApiusually requires GoogleApiClient too, which we need to connect to Google Play Service manually.",
                            "If you previously used GoogleApiClient, now GoogleApiClientis no longer needed -LRB- LINK -RRB-.",
                            "To get last location, can use this function:"
                        ]
                    }
                ],
                "tags": [
                    "java",
                    "android",
                    "deprecated",
                    "android-fusedlocation"
                ]
            }
        ],
        "other": [
            {
                "link": "https://www.toptal.com/android/android-developers-guide-to-google-location-services-api",
                "type": "misc",
                "content": [
                    "Knowing your user's location is useful information in many applications we develop and use today.",
                    "There are a lot of popular location-based applications out there that are making our lives easier, as well as changing the way that we use these services.",
                    "An example is the wildly popular application Foursquare, where users who frequent to an establishment and `` check in'' often win discounts.",
                    "Uber, which helps you get a ride from your mobile phone at a lower rate than a normal taxi.",
                    "The list is large and still growing.",
                    "In this article, we are going to build a simple Android application to determine the user's latitude and longitude using Android's Google Location Services API.",
                    "When developing Android applications, there are a couple of ways to get the user's location.",
                    "Package `` android.location'' The package `` android.location'' has been available since Android was first introduced, and it gives us access to location services.",
                    "These services allow applications to obtain periodic updates of the device's geographical location.",
                    "The package provides two means of acquiring location data:",
                    "LocationManager.GPS _ PROVIDER: Determines location using satellites.",
                    "Depending on the conditions, this provider may take a while to return a location fix.",
                    "LocationManager.NETWORK _ PROVIDER: Determines location based on availability of nearby cell towers and WiFi access points.",
                    "This is faster than GPS_PROVIDER.",
                    "When you are looking for user location you have to play with these providers and their availability.",
                    "Ideally you obtain the first location using NETWORK_PROVIDER, which might not be as accurate, but is much faster.",
                    "You might then make an attempt to increase accuracy by listening for a better location fix using the GPS_PROVIDER.",
                    "The APIs provided by this package are fairly low-level, and require the developer of the application to handle the finer details of determining when to request location data and schedule calls to the API in an optimized way.",
                    "To improve developer experience with location based system services and ease the process of developing location-aware applications, Google introduced a new way of requesting a user's location using Google Play Services.",
                    "It offers a simpler API with higher accuracy, low-power geofencing, and much more.",
                    "Google Location Services API Google Location Services API, also known as FusedLocationProviderApi, is Google's recommended way of getting a user's location.",
                    "It provides the best accuracy based on our needs.",
                    "Some of the advantages of using this API over the previous one are:",
                    "Simplicity: Unlike the previous API, you no longer have to deal with multiple providers.",
                    "Instead, you specify high-level needs, such as `` high accuracy'' or `` low power'', and it will take a suitable approach.",
                    "Availability: Gives your app immediate access to the best, most recent known location.",
                    "Usually this information is readily available, you just have to ask for it.",
                    "Power-efficiency: Minimizes your application's usage of power.",
                    "Versatility: Meets a wide range of needs, from foreground uses - needing highly accurate location data, to background uses - requiring only periodic location updates with negligible power impact.",
                    "Let us build a location-based Android application using this API.",
                    "For this, we will use Google's suggested IDE for Android application development - Android Studio.",
                    "Getting started with Android Studio is pretty straight forward.",
                    "Their website describes the procedure involving the installation and configuration of Android Studio in great detail, including how to bootstrap your first Android application for development.",
                    "Android Studio should make things super-easy for us.",
                    "However, we will need to begin by configuring the build script and adding Google Play Services as a dependency for this application.",
                    "This can be done by modifying the `` build.gradle'' file as follows:",
                    "At the time I am writing this article, the latest version of Google Play Services available is 6.5.87.",
                    "Make sure you always check for the latest version available before you start.",
                    "In case newer versions comes out later down the road and you decide to update it for your own projects, test all location related features against all versions of Android you are supporting.",
                    "At this point, we should be able to start doing the actual work for our application.",
                    "Requesting Permission, Configuring AndroidManifest.xml Androids have specific security features that would prevent any arbitrary application from requesting a precise user location.",
                    "To solve this, we need to edit `` AndroidManifest.xml'' and add the permission we require for this application:",
                    "While we are at it, we should also define the version of Google Play Services we are using for this application:",
                    "Checking for Google Play Services Availability Before accessing features provided by Google Play Services, we must check if the device has Google Play Services installed, and that the version is the one we intend to use ( 6.5.87 ).",
                    "This method will check for Google Play Services, and in case the device doesn't have it installed ( it's rare, but I've seen such cases ), it will open a dialog with the corresponding error and invite the user to install/update Google Play Services from the Google Play Store.",
                    "After the user completes the resolution provided by `` GooglePlayServicesUtil.getErrorDialog ( )'', a callback method `` onActivityResult ( )'' is fired, so we have to implement some logic to handle that call:",
                    "Accessing Google APIs To access Google APIs, we just need to perform one more step: create an instance of GoogleApiClient.",
                    "The Google API Client provides a common entry point to all the Google Play services, and manages the network connection between the user's device and each Google service.",
                    "Our first step here is to initiate the connection.",
                    "I usually call this code from `` onCreate'' method of the activity:",
                    "By chaining a series of method calls, we are specifying the callback interface implementation and the Location Service API that we want to use.",
                    "The interface implementation, in this case `` this'', will receive response to the asynchronous `` connect ( )'' method when the connection to Google Play Services succeed, fail, or become suspended.",
                    "After adding this code, our `` MainActivity'' should look like this:",
                    "Then in our `` onStart'' method we call the `` connect'' method and wait for `` onConnected'' callback method be invoked:",
                    "The `` onConnected'' method will look like this:",
                    "This callback is fired when Google Play Services is connected, which means by then we should have the last known location.",
                    "However, this location can be null ( it's rare but not impossible ).",
                    "In that case, what I recommend is to listen for location updates which will be covered next.",
                    "Listening for Location Updates After you invoke `` getLastLocation'', you might want to request periodic updates from the Fused Location Provider.",
                    "Depending on your application, this period could be short or long.",
                    "For instance, if you are building an application that tracks a user's location while he drives, you will need to listen for updates on short intervals.",
                    "On the other hand, if your application is about sharing user location with his friend, you maybe just need to request the location once in a while.",
                    "Creating a request is pretty easy - you can call this method inside the `` onCreate'' method:",
                    "We instantiate a new LocationRequest object.",
                    "Set the interval to 20 seconds ( 20000 milliseconds ).",
                    "Furthermore, we set a throttled update rate to 5 seconds.",
                    "This tells the API to provide updates every 20 seconds ( preferably ), but if there is a change available within a 5 second period, it should provide that too.",
                    "Finally, we set the priority to `` PRIORITY_HIGH_ACCURACY'', among the other available priority options: PRIORITY_BALANCED_POWER_ACCURACY, PRIORITY_LOW_POWER, PRIORITY_NO_POWER.",
                    "Once you have built the request, you are ready to start listening on location updates after `` onConnected ( )'' method has been fired:",
                    "All that remains now is to implement the callback method to satisfy the LocationListener interface:",
                    "Stop Listening for Updates It is important to explicitly stop listening for updates when you don't need them anymore, or if the user leaves your application.",
                    "The following method should be invoked from within `` onPause'' callback:",
                    "... and disconnecting Google API:",
                    "Wrapping Up As you can see, the fundamental ideas behind implementing location aware applications in Android is very simple.",
                    "Moreover, with the available APIs that are both simple to use and easy to understand, it should be a no-brainer to build basic location-based applications for Android.",
                    "The small sample application we have built here is meant to demonstrate exactly that.",
                    "You can find the complete source code for this on GitHub.",
                    "Please note that to keep things simple, the application is not handling the `` onConnectionFailed'' callback method.",
                    "Hopefully this tutorial will help you get started with using the Google Location Services API.",
                    "TagsAndroidLocationGPSGeolocationView full profile Danny GonzalezFreelance Software EngineerAbout the authorDanny is a full-stack software engineer with 7 + years of experience doing project management and building web and mobile applications.",
                    "He is passionate about the tech world and the cutting edge, and he's also interested in SEM and digital marketing.Hire DannyCommentsMahbubur RahmanIt crashes just after few moments of application launched every time.",
                    "I can see the toast once after launch.Nikita BaroniaDoes it run in background for updating locations?Bryan MillsIn the parent activity dudeBryan Millsshouldn't you initialize the GoogleApiClient in onActivityResult as well ?",
                    "I feel like you'd be getting a null-pointer in the case that the user didn't have a valid google play services package installed, or am i missing a concept here?Jessica TurnerGreat Article Danny.",
                    "Thanks, Jessica ( www.becomeceleb.com?profile ) DerekI recommend buying a book or borrowing one from a library, which is will most likely be too old by now.",
                    "The book that I borrowed was published in 2012.",
                    "If you have some money, you can buy a course online.Roberto RobsonI'm facing the same problem here.",
                    "It is almost impossible to find A GOOD EXAMPLE of how create a service that must run in background and receive location updates.",
                    "Also, all example on developer.android.com are terrible, any one of them really works.Olaoye OluwapelumiThanks, really helpful.",
                    "Solved my location awareness application problem.DerekI know, right.",
                    "I can't find anything on the internet that actually works.",
                    "Not even developer.android.com guides, YouTube videos, etc.Cristian Bellwhen was this written ?",
                    "for which SDK level it is ?",
                    "right now - April 2016 like 1/2 of the functions here are already deprecared,: ) Manawar AliThanks for nice tutorial.",
                    "Described in a simple and straight way.Yusuf MuftiI want to create a service that handle update location from some activities, I have problem related code below, that I could not put paramter mContext in addConnectionCallbacks ( )",
                    "Toptal handpicks top Android developers to suit your needs.Top 3 % WhyClientsEnterpriseCommunityBlogAbout UsFollow us onLog InGo to Your Profile",
                    "Mobile8 minute readAndroid Developer's Guide to the Google Location Services APIDanny GonzalezDanny is a full-stack software engineer with 7 + years of experience doing project management and building web and mobile applications.SHARE",
                    "Mobile8 minute readAndroid Developer's Guide to the Google Location Services API",
                    "Danny GonzalezDanny is a full-stack software engineer with 7 + years of experience doing project management and building web and mobile applications.SHARE",
                    "Danny GonzalezDanny is a full-stack software engineer with 7 + years of experience doing project management and building web and mobile applications.",
                    "Danny is a full-stack software engineer with 7 + years of experience doing project management and building web and mobile applications.",
                    "Knowing your user's location is useful information in many applications we develop and use today.",
                    "Could you help me ?",
                    "ThanksDaniel Gomez RicoInside a fragment where should I call every method?Vignesh Rhi can you post something related to setting API provided by google play serviceIllahi Buxgreat job i love itHumberto MorenoIs not the same!Humberto Morenogreat job !",
                    "Thanks for this article.palugomoNice info ... i really like it, and its not a crime to use a example from internet abbiya.",
                    "Have a nice day.Please enable JavaScript to view the comments powered by Disqus.comments powered by DisqusWorld-class articles, delivered weekly.Get great contentSubscription implies consent to our privacy policyThank you!Check out your inbox to confirm your invite.Trending ArticlesEngineeringIcon ChevronBack-endBuilding a Node.js / TypeScript REST API, Part 2: Models, Middleware, and ServicesEngineeringIcon ChevronWeb Front-endCreating Live Dashboards With Airtable and ReactEngineeringIcon ChevronBack-endThe Definitive Guide to DateTime ManipulationEngineeringIcon ChevronProject ManagementEnhanced Git Flow ExplainedSee our related talentAndroidMobileJavaHire the authorView full profile Danny GonzalezFreelance Software EngineerRead NextEngineeringIcon ChevronEngineering ManagementPeople, Product, and Technology: A Beginner's Guide to Engineering Management",
                    "View full profile Danny GonzalezFreelance Software EngineerAbout the authorDanny is a full-stack software engineer with 7 + years of experience doing project management and building web and mobile applications.",
                    "He is passionate about the tech world and the cutting edge, and he's also interested in SEM and digital marketing.Hire Danny",
                    "View full profile Danny GonzalezFreelance Software Engineer",
                    "About the authorDanny is a full-stack software engineer with 7 + years of experience doing project management and building web and mobile applications.",
                    "CommentsMahbubur RahmanIt crashes just after few moments of application launched every time.",
                    "Have a nice day.Please enable JavaScript to view the comments powered by Disqus.comments powered by Disqus",
                    "Mahbubur RahmanIt crashes just after few moments of application launched every time.",
                    "I can see the toast once after launch.",
                    "It crashes just after few moments of application launched every time.",
                    "Nikita BaroniaDoes it run in background for updating locations ?",
                    "Does it run in background for updating locations ?",
                    "Bryan MillsIn the parent activity dude",
                    "In the parent activity dude",
                    ""
                ],
                "title": "Building Location Aware Applications with Google's Location Services API  | Toptal"
            },
            {
                "link": "https://javapapers.com/android/android-location-fused-provider",
                "type": "misc",
                "content": [
                    "Android Location Fused Provider Last modified on June 19th, 2017 by Joe.",
                    "This Android tutorial is to explain what a fused location provider is and how to use it to get the location using a sample Android application.",
                    "We need not explicitly choose either GPS or Network location Provider, as the `` Fused Location Provider'' automatically chooses the underlying technology and gives the best location as per the need.",
                    "In this tutorial we will be using the FusedLocationProviderApi which is the latest API and the best among the available possibilities to get location in Android.",
                    "If for some reason you wish to use the old APIs then refer the earlier written tutorial to get current location in Android.",
                    "It provides simple and easy to use APIs.",
                    "Provides high accuracy over other options.",
                    "Utilizes low power by choosing the most efficient way to access the location.",
                    "Three Use Cases for location access With respect to fused location provider, we can broadly classify the API usage in three use cases.",
                    "getLastLocation ( GoogleApiClient ) this API should be used when there is no need for continuous access to location from an application.",
                    "Like one shot access or get user location based on some action.",
                    "This is the simplified way to get the device location and also may not provide high accuracy.",
                    "requestLocationUpdates ( GoogleApiClient, LocationRequest, LocationListener ) this API should be used when there a need for continuous location updates and the location is accessed when the application is active in foreground.",
                    "requestLocationUpdates ( GoogleApiClient, LocationRequest, PendingIntent ) this API is used to receive location updates in the background even when the application is not active.",
                    "So the difference is PendingIntent.",
                    "Example Android Application to Get Location Download Following is an example Android application that shows how to get the current user location.",
                    "This also continuously updates the location on the move.",
                    "Prerequisite Google Play Services is required.",
                    "If you are using Android Studio and Gradle, you should have the following dependencies added in build.gradle file",
                    "Note: As of now ( 14 March 2015 ), Fused location provider API is not working in all the Android Nexus virtual device emulators.",
                    "Its a widely reported defect.",
                    "You can use any other AVD to test in the emulator like WVGA AVDs.",
                    "I used `` 4 WVGA API 21'' virtual device in emulator to test it.",
                    "It is also working on a real device and I tested it in Panasonic P81.",
                    "AndroidManifest.xml Remember to give access permissions as shown below.",
                    "You need not give permission for GPS, Network providers.",
                    "I have seen Android location access tutorial examples giving all the available permission in the world.",
                    "Just on android.permission.ACCESS _ FINE_LOCATION is enough.",
                    "ACCESS_COARSE_LOCATION permission is for approximate location access using cell towers and Wi-Fi.",
                    "ACCESS_FINE_LOCATION is for precise location access using GPS or cell towers and Wi-Fi.",
                    "Choose the one that is appropriate for you and do not give both.",
                    "Battery power is used accordingly.",
                    "GoogleApiClient FusedLocationProviderApi requires the GoogleApiClient instance to get the Location and it can be obtained as below.",
                    "Instantiating the GoogleApiClient should be done in onCreate of the application Activity.",
                    "googleApiClient.connect ( ) should be done in onStart and disconnect ( ) in onStop.",
                    "When the GoogleApiClient is connected successfully, onConnected ( Bundle ) callback will be called.",
                    "Location Interface Implementations for Callbacks The following interfaces should be implemented to get the location update.",
                    "LocationListener provides call back for location change through onLocationChanged.",
                    "Continuous Location Access Activity Following is the complete class which accesses the Fused Location Provider to get the location continuously in the Android example application.",
                    "Test Run the Location Application via Android Emulator In Eclipse, Open DDMS perspective ( Window - > Open Perspective )",
                    "Select your emulator device Select the tab named emulator control In ` Location Controls' panel, ` Manual' tab, give the Longitude and Latitude as input and ` Send'.",
                    "In Android Studio, open Android Device Monitor The below screen shot will help,",
                    "Get Current Location in Android Find Places Nearby in Google Maps using Google Places API -- Android App Android Get Address with Street Name, City for Location with Geocoding",
                    "Comments on `` Android Location Fused Provider''",
                    "Android Show Current Location on Map using Google Maps API says:",
                    "-LSB- ... -RSB- This tutorial is to learn how to show the current location on map in an Android application using Google Maps API.",
                    "Previously we have seen tutorials to get the current location using the different location providers.",
                    "If you are looking to just get the latitude and longitude of a location, the refer get current location using Android Fused location provider tutorial.",
                    "I couldn't find a specific example of grabbing the fused provider anywhere until getting here.",
                    "This tutorial is great !",
                    "Is there another way to get the location as soon as see the activity on my screen in oppose to clicking a button ?",
                    "I've tried placing the request for location in onCreate, onStart and onResume, but that only works in onResume after I really resume from standby.",
                    "Thanks you, this tutorial is so great.",
                    "Have a nice day !",
                    "Last modified on June 19th, 2017 by Joe.",
                    "How would I setup pooling so that I can send the onChanged ( ) location from the FusedLocationService back to the View without having to click on the button ?",
                    "Pardon the misspelling, I meant polling.",
                    "Great tutorial, but I have a problem.",
                    "I tried it and it works on emulator ( Nexus 4 ), but on my real device Samsung Galaxy mini ( 2.3.6 ) it starts, but when I click the button ( `` Show Location'' ) an error message pop up and the program is closing automatically.",
                    "Can you help me ?",
                    "What can be the problem ?",
                    "I do have google service, I was connecting to Wifi, I have mobile net, but my GPS location probably wasn't found, because I was indoor ( but this is why I need fuse location, so I guess it can't be a problem ).",
                    "@Naphtali, @Paul and @Daniel, I have updated the tutorial and fixed some defects in it.",
                    "Added feature to get location onChange.",
                    "Now dynamically the location will be updated when the device gets a new location.",
                    "Need not click the button to get the location.",
                    "Now it is tested in both Emulator and real device.",
                    "Let me know if you guys need anything more in this tutorial.",
                    "Android Location Tracker with Google Maps - Java Tutorial says:",
                    "-LSB- ... -RSB- the Android location using fused provider tutorial to understand better about the Android fused location provider API and how it can be used -LSB- ... -RSB-",
                    "Hi Joe, I implemented your code in my eclipse and tried to run in emulator.But on clicking show location i am not getting anything displayed in emulator and location `` null'' showing in log.",
                    "Would you please help anything i am missing.",
                    "How do we know if getLastLocation is not an obsolete location ?",
                    "Google documentation mentions that it may be null however it does not say how old it may be ?",
                    "Is fused API will give me exact result or exact location because some time GPS is switching the location ?",
                    "Best Android tutorials I found so far.",
                    "I wanst getting how to go about fusedLocationApi.",
                    "But this made my life a lot easier.",
                    "Hi, its Very Nice Tutorial.",
                    "I have a Question can we on the gps or location service automatically without user manually in android if yes then please share the flow.",
                    "Hi, Thank you Sir for this great tutorial.",
                    "I have a couple of queries.",
                    "How can i use PendingIntenet for getting location updates when app is running in background ( A short snippet will be gr8 ).",
                    "What if the WiFi is OFF ?",
                    "From where are the location coordinated are retrieved ?",
                    "Thank You Very Much !!",
                    "This helped me alot for my application.",
                    "and its really simple also if you follow this completely.",
                    "This tutorial is great except I have one question.",
                    "I am trying to implement the request in a class and upload the results in a separate class which happens to be a fragment.",
                    "What should I use in place of `` this'' when building the GoogleApiClient and where should I call connect from ?",
                    "From the OnCreateView method ?",
                    "hi, thanks for this great tutorials.",
                    "i have followed it but i am not receiving any location.",
                    "I'm developing an app using this fused location provider and all seems to work good.",
                    "But the problems I have is that the locations I get dont have any information about altitude.",
                    "Can it works when i am in offline?Plz reply any one",
                    "May you have peace knowing that your social role and function is well and effective.",
                    ""
                ],
                "title": "Android Location Fused Provider - Javapapers"
            }
        ]
    },
    "parsed": true
}